<?php
return array(
	array(66,"","01 后台管理员" ),
	array(52,"","02 非金钱管理账户" ),

	array(37,"","10 助教组长" ),
	array(59,"","11 助教一般" ),
	array(39,"","20 教研组长" ),
	array(70,"","21 教研-一般" ), 

	array(67,"","23 教研-排课" ), //
	array(68,"","30 市场助长" ), // 
	array(69,"","31 市场一般" ), // 


	array(72,"","32 市场分配资源" ), //
	array(73,"","33 市场-一般-初级" ), // 
	array(57,"","40 顾问组长" ), // 

	array(38,"","41 顾问-一般" ),
	array(74,"","42 顾问-统计" ),
	array(77,"","43 顾问-小组长" ),
	array(76,"","44 顾问-其他" ),
	array(58,"","50 财务" ),
	array(75,"","51 人事" ),
	array(71,"","61 产品" ),
	array(42,"","91 题库-编辑" ),
	array(49,"","92 题库-审核" ),
	array(43,"","93 题库-编辑-统计" ),
	array(78,"","99 角色" ),
	array(48,"","工具箱 学校编辑" ),
	array(60,"","统计" ),
	array(61,"","统计金额" ),
	array(54,"","预约+工具" ),
	array(51,"","预约管理" ),
	array(36,"","超级管理员" ),
	array(55,"","查看合同金额" ),
	array(47,"","查看用户" ),

);
