<?php
return array(
	array(0,"","未回访" ),
	array(1,"","无效资源" ),
	array(2,"","未接通" ),

	array(3,"","有效-意向A档" ),
	array(4,"","有效-意向B档" ),
	array(5,"","有效-意向C档" ),
	array(11,"","试听-时间待定" ), //,有预约意向，但时间没有确定

	array(9,"test_lesson_report","试听-预约" ), //
	array(10,"test_lesson_set_lesson","试听-已排课" ), // 教务 
	array(12,"","试听-时间确定" ), // 和家长确认  销售处理


	array(13,"","试听-无法排课" ), //教务
	array(14,"","试听-驳回" ), // 教务  
	array(15,"","试听-课程取消" ), //    教务 


	array(6,"","已试听-待跟进" ),
	array(7,"","已试听-未签-A档" ),
	array(20,"","已试听-未签-B档" ),
	array(21,"","已试听-未签-C档" ),
	array(8,"","已试听-已签" ),

);
