<?php
return array (
    //家长端
    array(101,"","小学图标" ),
    array(102,"","初中图标" ),
    array(103,"","广告闪图" ),
    array(104,"","家长端轮播图" ),
    //学生端
    array(201,"","学生端主页图标" ),
    array(202,"","学生服饰" ),
    array(203,"","学生头饰" ),
    array(204,"","男老师服饰" ),
    array(205,"","女老师服饰" ),
    array(206,"","活动背景" ),
    array(207,"","1v1课程图片" ),
    array(208,"","主页轮播图" ),
    array(209,"","推送消息图标" ),
    array(210,"","商城轮播图" ),
    array(211,"","公开课课程图片" ),
    array(212,"","小班课课程图片" ),
    array(213,"","用户默认头像" ),
    //网页
    //array(301,"","网页轮播图" ),
    array(302,"","首页电脑轮播图"),
    array(303,"","首页移动端轮播图"),
    //微信
    array(401,"","老师群二维码（陈煜）" ),
    array(402,"","优学优享(文章)" ),
    array(403,"","微信伯乐奖" ),
    // 移动端
    array(501,"","移动端轮播图"),
    //其他
    array(9901,"","老师帮二维码" ),
    array(9999,"","其他" ),
);