<?php
return array(
    //old
    array( 7795923 ,'register','用户注册验证码-old',),
    array( 7771547,'','通用验证-old',),
    //new
    array( 124425073,'','学生上课迟到提醒',),
    array( 90885048,'','培训邀约8-31',),
    array( 86000023,'','老师报名模板 8-16',),
    array( 85645014,'','老师报名模板new 8-15',),
    array( 72765026,'','短信通知（价格调整）',),
    array( 66515139,'','家长预约5-9',),
    array( 63750218,'','预约完成4-28',),
    array( 55565027,'','老师注册通知3-15',),
    array( 51615035,'','老师注册通知',),
    array( 51410003,'','老师签单奖励通知',),
    array( 46725145,'','解除排课限制通知2-14',),
    array( 46835164,'','限制老师排课通知2-14',),
    array( 46785153,'','试听取消-不付工资2-14',),
    array( 46880148,'','第一次支付成功2-14',),
    array( 46800132,'','第二次支付成功2-14',),
    array( 46675251,'','注册老师账号通知2-14'),
    array( 46805178,'','晚8点 通知老师明天上课',),
    array( 46750146,'','老师反馈通知2-14',),
    array( 46670149,'','老师试讲可重申2-14',),
    array( 46705122,'','老师视频不完整 2',),
    array( 46375041,'','老师视频不完整',),
    array( 46745131,'','老师试讲未通过2-14',),
    array( 46790219,'','通知老师上传试讲2-14',),
    array( 46660108,'','老师冻结通知2-14',),
    array( 46720087,'','老师解冻通知2-14',),
    array( 46865086,'','老师试讲通过2-14',),
    array( 46680138,'','通知老师课程取消-付工资2-14',),
    array( 46690154,'','通知明天上课2-14',),
    array( 34775122,'','价格调整',),
    array( 33865292,'','通知老师试听课程取消-不付工资',),
    array( 34015213,'','老师试讲通过',),
    array( 30110108,'','通知老师课程取消',),
    array( 27725043,'','报名免费课程',),
    array( 27315033,'','预约完成3',),
    array( 18345084,'','通知明天上课',),
    array( 11051022,'','合同确认，重置家长密码',),
    array( 10671030,'','注册验证码',),
    /*
 	{"code":"423933","index":2}
    array( 10671029,'','通用验证',),
    \App\Helper\Utils::sms_common($phone,$sms_id,$arr);
    */
    array( 10671029,'','通用验证',),
    array( 10615821,'','早7点 通知家长1v1&小班上课',),
    array( 11035096,'','早7点 通知家长试听上课',),
    array( 10642098,'','晚8点 通知老师明天上课',),
    array( 12755231,'','注册老师账号通知'),
    array( 12040030,'','课件上传提醒'),
    array( 11865003,'','第二次支付成功'),
    array( 11275039,'','试听排课完成 '),
    array( 11295014,'','预约完成 '),
    array( 11565037,'','通知家长预约成功',),
    array( 15960017,'','销售回访后通知家长',),
    array( 16785465,'','通知家长预约成功2',),
);

/**
   模板类型: 短信通知
   模板名称: 通知老师课程取消
   模板ID: SMS_ 30110108
   模板内容: 原定${lesson_time}给${student_nick}上的${lesson_name}取消 ,原因:${reason}
   申请说明: 通知老师课程取消
*/
