<?php

/*
  1.成功邀请学员提醒
  恭喜您成功邀请学员XXX参加测评课，您获得5元奖励。
  如课程老师成功联系学员，将再获得5元奖励。


  2.
  课程老师已成功联系学员XXX，您获得5元奖励。
  如学员成功预约测评课，将再获得10元奖励。


  3.
  您邀请的学员XXX成功预约测评课，您获得10元奖励。
  如学员成功上完测评课，将再获得30元奖励。

  4.
  您邀请的学员XXX成功上完测评课，您获得30元奖励。
  如学员购买课程，将再获得该学员学费的5%（最高500元）奖励。

*/
return array(
    "name" => "类型" ,
        array(1001,"","成功邀请学员提醒"),
        array(1002,"","成功联系学员提醒"),
        array(1003,"","学员成功预约测评课提醒"),
        array(1004,"","学员测评课成功提醒"),
        array(2001,"","等级升级提醒"),
        array(2002,"","正式学员佣金提醒"),
);
