var g_enum_map={

accept_flag : {
	desc_map : {
		'0' : "待处理",
		'1' : "同意",
		'2' : "驳回"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//待处理
		V_0:0,
		//同意
		V_1:1,
		//驳回
		V_2:2,

		//待处理
		S_0:"0",
		//同意
		S_1:"1",
		//驳回
		S_2:"2"


},

account_role : {
	desc_map : {
		'0' : "未设置",
		'1' : "助教",
		'2' : "销售",
		'3' : "教务",
		'4' : "教研",
		'5' : "全职老师",
		'6' : "薪资运营",
		'7' : "TMK"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//未设置
		V_0:0,
		//助教
		V_1:1,
		//销售
		V_2:2,
		//教务
		V_3:3,
		//教研
		V_4:4,
		//全职老师
		V_5:5,
		//薪资运营
		V_6:6,
		//TMK
		V_7:7,

		//未设置
		S_0:"0",
		//助教
		S_1:"1",
		//销售
		S_2:"2",
		//教务
		S_3:"3",
		//教研
		S_4:"4",
		//全职老师
		S_5:"5",
		//薪资运营
		S_6:"6",
		//TMK
		S_7:"7"


},

ad_status : {
	desc_map : {
		'0' : "不可点击",
		'1' : "可点击"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//不可点击
		V_0:0,
		//可点击
		V_1:1,

		//不可点击
		S_0:"0",
		//可点击
		S_1:"1"


},

assess_res : {
	desc_map : {
		'1' : "通过",
		'0' : "不通过"
	},
	simple_desc_map: {
		'1' : "",
		'0' : ""
	},
	s2v_map:{
		"1" : 1,
		"0" : 0
	},
	v2s_map:{
		 '1':  "1",
		 '0':  "0"
	},

		//通过
		V_1:1,
		//不通过
		V_0:0,

		//通过
		S_1:"1",
		//不通过
		S_0:"0"


},

assistant_type : {
	desc_map : {
		'1' : "全职",
		'2' : "兼职"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//全职
		V_1:1,
		//兼职
		V_2:2,

		//全职
		S_1:"1",
		//兼职
		S_2:"2"


},

ass_test_lesson_type : {
	desc_map : {
		'1' : "扩课",
		'2' : "换老师",
		'3' : "未听报"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//扩课
		V_1:1,
		//换老师
		V_2:2,
		//未听报
		V_3:3,

		//扩课
		S_1:"1",
		//换老师
		S_2:"2",
		//未听报
		S_3:"3"


},

attendance_type : {
	desc_map : {
		'1' : "在家办公",
		'2' : "提前下班",
		'3' : "节假日延休"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//在家办公
		V_1:1,
		//提前下班
		V_2:2,
		//节假日延休
		V_3:3,

		//在家办公
		S_1:"1",
		//提前下班
		S_2:"2",
		//节假日延休
		S_3:"3"


},

authority : {
	desc_map : {
		'1' : "录入回访",
		'2' : "分配老师",
		'3' : "分配助教",
		'4' : "学员排课",
		'5' : "更改礼品状态",
		'6' : "新增合同",
		'7' : "合同退费",
		'8' : "更改合同状态",
		'9' : "更改退费状态",
		'10' : "录入备注信息",
		'11' : "提交分析报告",
		'12' : "修改学生信息",
		'13' : "设置课程内容",
		'14' : "试听排课",
		'15' : "测评分析",
		'201' : "教师管理",
		'202' : "助教管理",
		'203' : "查看员工绩效",
		'204' : "",
		'301' : "课堂监控",
		'501' : "用户管理",
		'502' : "角色管理",
		'503' : "权限管理",
		'504' : "商城管理"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'204' : "",
		'301' : "",
		'501' : "",
		'502' : "",
		'503' : "",
		'504' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"15" : 15,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"204" : 204,
		"301" : 301,
		"501" : 501,
		"502" : 502,
		"503" : 503,
		"504" : 504
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '15':  "15",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '204':  "204",
		 '301':  "301",
		 '501':  "501",
		 '502':  "502",
		 '503':  "503",
		 '504':  "504"
	},

		//录入回访
		V_1:1,
		//分配老师
		V_2:2,
		//分配助教
		V_3:3,
		//学员排课
		V_4:4,
		//更改礼品状态
		V_5:5,
		//新增合同
		V_6:6,
		//合同退费
		V_7:7,
		//更改合同状态
		V_8:8,
		//更改退费状态
		V_9:9,
		//录入备注信息
		V_10:10,
		//提交分析报告
		V_11:11,
		//修改学生信息
		V_12:12,
		//设置课程内容
		V_13:13,
		//试听排课
		V_14:14,
		//测评分析
		V_15:15,
		//教师管理
		V_201:201,
		//助教管理
		V_202:202,
		//查看员工绩效
		V_203:203,
		//
		V_204:204,
		//课堂监控
		V_301:301,
		//用户管理
		V_501:501,
		//角色管理
		V_502:502,
		//权限管理
		V_503:503,
		//商城管理
		V_504:504,

		//录入回访
		S_1:"1",
		//分配老师
		S_2:"2",
		//分配助教
		S_3:"3",
		//学员排课
		S_4:"4",
		//更改礼品状态
		S_5:"5",
		//新增合同
		S_6:"6",
		//合同退费
		S_7:"7",
		//更改合同状态
		S_8:"8",
		//更改退费状态
		S_9:"9",
		//录入备注信息
		S_10:"10",
		//提交分析报告
		S_11:"11",
		//修改学生信息
		S_12:"12",
		//设置课程内容
		S_13:"13",
		//试听排课
		S_14:"14",
		//测评分析
		S_15:"15",
		//教师管理
		S_201:"201",
		//助教管理
		S_202:"202",
		//查看员工绩效
		S_203:"203",
		//
		S_204:"204",
		//课堂监控
		S_301:"301",
		//用户管理
		S_501:"501",
		//角色管理
		S_502:"502",
		//权限管理
		S_503:"503",
		//商城管理
		S_504:"504"


},

book_grade : {
	desc_map : {
		'0' : "未填写",
		'400' : "学龄前",
		'100' : "小学",
		'101' : "一年级",
		'102' : "二年级",
		'103' : "三年级",
		'104' : "四年级",
		'105' : "五年级",
		'106' : "六年级",
		'200' : "初中",
		'201' : "七年级",
		'202' : "八年级",
		'203' : "九年级",
		'300' : "高中",
		'301' : "高一",
		'302' : "高二",
		'303' : "高三"
	},
	simple_desc_map: {
		'0' : "",
		'400' : "",
		'100' : "",
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'105' : "",
		'106' : "",
		'200' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'300' : "",
		'301' : "",
		'302' : "",
		'303' : ""
	},
	s2v_map:{
		"0" : 0,
		"400" : 400,
		"100" : 100,
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"105" : 105,
		"106" : 106,
		"200" : 200,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"300" : 300,
		"301" : 301,
		"302" : 302,
		"303" : 303
	},
	v2s_map:{
		 '0':  "0",
		 '400':  "400",
		 '100':  "100",
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '105':  "105",
		 '106':  "106",
		 '200':  "200",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '300':  "300",
		 '301':  "301",
		 '302':  "302",
		 '303':  "303"
	},

		//未填写
		V_0:0,
		//学龄前
		V_400:400,
		//小学
		V_100:100,
		//一年级
		V_101:101,
		//二年级
		V_102:102,
		//三年级
		V_103:103,
		//四年级
		V_104:104,
		//五年级
		V_105:105,
		//六年级
		V_106:106,
		//初中
		V_200:200,
		//七年级
		V_201:201,
		//八年级
		V_202:202,
		//九年级
		V_203:203,
		//高中
		V_300:300,
		//高一
		V_301:301,
		//高二
		V_302:302,
		//高三
		V_303:303,

		//未填写
		S_0:"0",
		//学龄前
		S_400:"400",
		//小学
		S_100:"100",
		//一年级
		S_101:"101",
		//二年级
		S_102:"102",
		//三年级
		S_103:"103",
		//四年级
		S_104:"104",
		//五年级
		S_105:"105",
		//六年级
		S_106:"106",
		//初中
		S_200:"200",
		//七年级
		S_201:"201",
		//八年级
		S_202:"202",
		//九年级
		S_203:"203",
		//高中
		S_300:"300",
		//高一
		S_301:"301",
		//高二
		S_302:"302",
		//高三
		S_303:"303"


},

book_status : {
	desc_map : {
		'0' : "未回访",
		'1' : "无效资源",
		'2' : "未接通",
		'3' : "有效-意向A档",
		'4' : "有效-意向B档",
		'5' : "有效-意向C档",
		'11' : "试听-时间待定",
		'9' : "试听-预约",
		'10' : "试听-已排课",
		'12' : "试听-时间确定",
		'13' : "试听-无法排课",
		'14' : "试听-驳回",
		'15' : "试听-课程取消",
		'6' : "已试听-待跟进",
		'7' : "已试听-未签-A档",
		'20' : "已试听-未签-B档",
		'21' : "已试听-未签-C档",
		'8' : "已试听-已签"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'11' : "",
		'9' : "",
		'10' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'6' : "",
		'7' : "",
		'20' : "",
		'21' : "",
		'8' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"11" : 11,
		"test_lesson_report" : 9,
		"test_lesson_set_lesson" : 10,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"15" : 15,
		"6" : 6,
		"7" : 7,
		"20" : 20,
		"21" : 21,
		"8" : 8
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '11':  "11",
		 '9':  "test_lesson_report",
		 '10':  "test_lesson_set_lesson",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '15':  "15",
		 '6':  "6",
		 '7':  "7",
		 '20':  "20",
		 '21':  "21",
		 '8':  "8"
	},

		//未回访
		V_0:0,
		//无效资源
		V_1:1,
		//未接通
		V_2:2,
		//有效-意向A档
		V_3:3,
		//有效-意向B档
		V_4:4,
		//有效-意向C档
		V_5:5,
		//试听-时间待定
		V_11:11,
		//试听-预约
		V_TEST_LESSON_REPORT:9,
		//试听-已排课
		V_TEST_LESSON_SET_LESSON:10,
		//试听-时间确定
		V_12:12,
		//试听-无法排课
		V_13:13,
		//试听-驳回
		V_14:14,
		//试听-课程取消
		V_15:15,
		//已试听-待跟进
		V_6:6,
		//已试听-未签-A档
		V_7:7,
		//已试听-未签-B档
		V_20:20,
		//已试听-未签-C档
		V_21:21,
		//已试听-已签
		V_8:8,

		//未回访
		S_0:"0",
		//无效资源
		S_1:"1",
		//未接通
		S_2:"2",
		//有效-意向A档
		S_3:"3",
		//有效-意向B档
		S_4:"4",
		//有效-意向C档
		S_5:"5",
		//试听-时间待定
		S_11:"11",
		//试听-预约
		S_TEST_LESSON_REPORT:"test_lesson_report",
		//试听-已排课
		S_TEST_LESSON_SET_LESSON:"test_lesson_set_lesson",
		//试听-时间确定
		S_12:"12",
		//试听-无法排课
		S_13:"13",
		//试听-驳回
		S_14:"14",
		//试听-课程取消
		S_15:"15",
		//已试听-待跟进
		S_6:"6",
		//已试听-未签-A档
		S_7:"7",
		//已试听-未签-B档
		S_20:"20",
		//已试听-未签-C档
		S_21:"21",
		//已试听-已签
		S_8:"8"


},

boolean : {
	desc_map : {
		'0' : "否",
		'1' : "是"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//否
		V_0:0,
		//是
		V_1:1,

		//否
		S_0:"0",
		//是
		S_1:"1"


},

call_phone_type : {
	desc_map : {
		'0' : "tq",
		'1' : "云通讯",
		'2' : "天润"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"tq" : 0,
		"ytx" : 1,
		"tl" : 2
	},
	v2s_map:{
		 '0':  "tq",
		 '1':  "ytx",
		 '2':  "tl"
	},

		//tq
		V_TQ:0,
		//云通讯
		V_YTX:1,
		//天润
		V_TL:2,

		//tq
		S_TQ:"tq",
		//云通讯
		S_YTX:"ytx",
		//天润
		S_TL:"tl"


},

can_set : {
	desc_map : {
		'1' : "不可设置",
		'2' : "可设置"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//不可设置
		V_1:1,
		//可设置
		V_2:2,

		//不可设置
		S_1:"1",
		//可设置
		S_2:"2"


},

change_teacher_reason_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "家长投诉",
		'2' : "教学问题",
		'3' : "时间匹配问题",
		'4' : "突然不带甩课问题",
		'5' : "无故缺席",
		'6' : "退费",
		'7' : "拒课",
		'100' : "其他"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'100' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"100" : 100
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '100':  "100"
	},

		//未设置
		V_0:0,
		//家长投诉
		V_1:1,
		//教学问题
		V_2:2,
		//时间匹配问题
		V_3:3,
		//突然不带甩课问题
		V_4:4,
		//无故缺席
		V_5:5,
		//退费
		V_6:6,
		//拒课
		V_7:7,
		//其他
		V_100:100,

		//未设置
		S_0:"0",
		//家长投诉
		S_1:"1",
		//教学问题
		S_2:"2",
		//时间匹配问题
		S_3:"3",
		//突然不带甩课问题
		S_4:"4",
		//无故缺席
		S_5:"5",
		//退费
		S_6:"6",
		//拒课
		S_7:"7",
		//其他
		S_100:"100"


},

check_money_flag : {
	desc_map : {
		'0' : "未确认",
		'1' : "已付款",
		'2' : "未付款"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未确认
		V_0:0,
		//已付款
		V_1:1,
		//未付款
		V_2:2,

		//未确认
		S_0:"0",
		//已付款
		S_1:"1",
		//未付款
		S_2:"2"


},

check_status : {
	desc_map : {
		'0' : "未审核",
		'1' : "已通过",
		'2' : "未通过",
		'3' : "可重审",
		'4' : "无效数据"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//未审核
		V_0:0,
		//已通过
		V_1:1,
		//未通过
		V_2:2,
		//可重审
		V_3:3,
		//无效数据
		V_4:4,

		//未审核
		S_0:"0",
		//已通过
		S_1:"1",
		//未通过
		S_2:"2",
		//可重审
		S_3:"3",
		//无效数据
		S_4:"4"


},

child_class_performance_flag : {
	desc_map : {
		'0' : "未设置",
		'1' : "好",
		'2' : "还行",
		'3' : "不好"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未设置
		V_0:0,
		//好
		V_1:1,
		//还行
		V_2:2,
		//不好
		V_3:3,

		//未设置
		S_0:"0",
		//好
		S_1:"1",
		//还行
		S_2:"2",
		//不好
		S_3:"3"


},

child_class_performance_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "走神",
		'2' : "玩游戏",
		'3' : "不响应老师",
		'4' : "抵触上课",
		'5' : "其他"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//未设置
		V_0:0,
		//走神
		V_1:1,
		//玩游戏
		V_2:2,
		//不响应老师
		V_3:3,
		//抵触上课
		V_4:4,
		//其他
		V_5:5,

		//未设置
		S_0:"0",
		//走神
		S_1:"1",
		//玩游戏
		S_2:"2",
		//不响应老师
		S_3:"3",
		//抵触上课
		S_4:"4",
		//其他
		S_5:"5"


},

class_time : {
	desc_map : {
		'1' : "已设置",
		'2' : "未设置"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//已设置
		V_1:1,
		//未设置
		V_2:2,

		//已设置
		S_1:"1",
		//未设置
		S_2:"2"


},

class_will_sub_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "随时接课",
		'2' : "短期无法接课",
		'3' : "没有手写板",
		'4' : "系统操作不熟练",
		'5' : "近期不接",
		'6' : "对课程挑剔",
		'7' : "没更多时间",
		'8' : "不认可理优",
		'9' : "价格不合适"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9"
	},

		//未设置
		V_0:0,
		//随时接课
		V_1:1,
		//短期无法接课
		V_2:2,
		//没有手写板
		V_3:3,
		//系统操作不熟练
		V_4:4,
		//近期不接
		V_5:5,
		//对课程挑剔
		V_6:6,
		//没更多时间
		V_7:7,
		//不认可理优
		V_8:8,
		//价格不合适
		V_9:9,

		//未设置
		S_0:"0",
		//随时接课
		S_1:"1",
		//短期无法接课
		S_2:"2",
		//没有手写板
		S_3:"3",
		//系统操作不熟练
		S_4:"4",
		//近期不接
		S_5:"5",
		//对课程挑剔
		S_6:"6",
		//没更多时间
		S_7:"7",
		//不认可理优
		S_8:"8",
		//价格不合适
		S_9:"9"


},

class_will_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "高",
		'2' : "一般",
		'3' : "不接"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未设置
		V_0:0,
		//高
		V_1:1,
		//一般
		V_2:2,
		//不接
		V_3:3,

		//未设置
		S_0:"0",
		//高
		S_1:"1",
		//一般
		S_2:"2",
		//不接
		S_3:"3"


},

click_status : {
	desc_map : {
		'1' : "可点击",
		'0' : "不可点击"
	},
	simple_desc_map: {
		'1' : "",
		'0' : ""
	},
	s2v_map:{
		"1" : 1,
		"0" : 0
	},
	v2s_map:{
		 '1':  "1",
		 '0':  "0"
	},

		//可点击
		V_1:1,
		//不可点击
		V_0:0,

		//可点击
		S_1:"1",
		//不可点击
		S_0:"0"


},

company : {
	desc_map : {
		'0' : "未设置",
		'1' : "理优",
		'2' : "博尔捷"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未设置
		V_0:0,
		//理优
		V_1:1,
		//博尔捷
		V_2:2,

		//未设置
		S_0:"0",
		//理优
		S_1:"1",
		//博尔捷
		S_2:"2"


},

competition_flag : {
	desc_map : {
		'0' : "常规课",
		'1' : "奥赛课"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//常规课
		V_0:0,
		//奥赛课
		V_1:1,

		//常规课
		S_0:"0",
		//奥赛课
		S_1:"1"


},

complaint_department : {
	desc_map : {
		'0' : "全部",
		'1' : "教务部",
		'2' : "咨询部",
		'3' : "教学部"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//全部
		V_0:0,
		//教务部
		V_1:1,
		//咨询部
		V_2:2,
		//教学部
		V_3:3,

		//全部
		S_0:"0",
		//教务部
		S_1:"1",
		//咨询部
		S_2:"2",
		//教学部
		S_3:"3"


},

complaint_reject_flag : {
	desc_map : {
		'0' : "接受",
		'1' : "驳回"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//接受
		V_0:0,
		//驳回
		V_1:1,

		//接受
		S_0:"0",
		//驳回
		S_1:"1"


},

complaint_state : {
	desc_map : {
		'0' : "未处理",
		'1' : "已处理"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//未处理
		V_0:0,
		//已处理
		V_1:1,

		//未处理
		S_0:"0",
		//已处理
		S_1:"1"


},

complaint_type : {
	desc_map : {
		'0' : "全部",
		'1' : "常规投诉",
		'2' : "课程投诉",
		'3' : "薪资申诉",
		'4' : "QC投诉"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//全部
		V_0:0,
		//常规投诉
		V_1:1,
		//课程投诉
		V_2:2,
		//薪资申诉
		V_3:3,
		//QC投诉
		V_4:4,

		//全部
		S_0:"0",
		//常规投诉
		S_1:"1",
		//课程投诉
		S_2:"2",
		//薪资申诉
		S_3:"3",
		//QC投诉
		S_4:"4"


},

complaint_user_type : {
	desc_map : {
		'0' : "全部",
		'1' : "家长",
		'2' : "老师",
		'3' : "QC"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//全部
		V_0:0,
		//家长
		V_1:1,
		//老师
		V_2:2,
		//QC
		V_3:3,

		//全部
		S_0:"0",
		//家长
		S_1:"1",
		//老师
		S_2:"2",
		//QC
		S_3:"3"


},

confirm_flag : {
	desc_map : {
		'0' : "未设置",
		'1' : "有效课程",
		'2' : "无效课程-课程取消",
		'3' : "无效课程-需给老师工资-课时照扣",
		'4' : "无效课程-需给老师工资-课时不扣"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//未设置
		V_0:0,
		//有效课程
		V_1:1,
		//无效课程-课程取消
		V_2:2,
		//无效课程-需给老师工资-课时照扣
		V_3:3,
		//无效课程-需给老师工资-课时不扣
		V_4:4,

		//未设置
		S_0:"0",
		//有效课程
		S_1:"1",
		//无效课程-课程取消
		S_2:"2",
		//无效课程-需给老师工资-课时照扣
		S_3:"3",
		//无效课程-需给老师工资-课时不扣
		S_4:"4"


},

contract_from_type : {
	desc_map : {
		'0' : "新签",
		'1' : "转介绍",
		'10' : "常规续费",
		'11' : "扩课续费"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'10' : "",
		'11' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"10" : 10,
		"11" : 11
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '10':  "10",
		 '11':  "11"
	},

		//新签
		V_0:0,
		//转介绍
		V_1:1,
		//常规续费
		V_10:10,
		//扩课续费
		V_11:11,

		//新签
		S_0:"0",
		//转介绍
		S_1:"1",
		//常规续费
		S_10:"10",
		//扩课续费
		S_11:"11"


},

contract_status : {
	desc_map : {
		'0' : "未付款",
		'1' : "执行中",
		'2' : "已结束",
		'3' : "提前终止"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未付款
		V_0:0,
		//执行中
		V_1:1,
		//已结束
		V_2:2,
		//提前终止
		V_3:3,

		//未付款
		S_0:"0",
		//执行中
		S_1:"1",
		//已结束
		S_2:"2",
		//提前终止
		S_3:"3"


},

contract_type_ex : {
	desc_map : {
		'0' : "公开课",
		'1' : "1对1",
		'2' : "小班课",
		'3' : "答疑课"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//公开课
		V_0:0,
		//1对1
		V_1:1,
		//小班课
		V_2:2,
		//答疑课
		V_3:3,

		//公开课
		S_0:"0",
		//1对1
		S_1:"1",
		//小班课
		S_2:"2",
		//答疑课
		S_3:"3"


},

contract_type : {
	desc_map : {
		'0' : "常规",
		'1' : "赠送",
		'2' : "试听",
		'3' : "续费",
		'1001' : "普通公开课(A)",
		'1002' : "普通公开课(B)",
		'1003' : "高级公开课",
		'1100' : "培训课程",
		'2001' : "公开答疑",
		'3001' : "小班课",
		'4001' : "机器人课程"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1100' : "",
		'2001' : "",
		'3001' : "",
		'4001' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"open_class" : 1001,
		"1002" : 1002,
		"1003" : 1003,
		"1100" : 1100,
		"2001" : 2001,
		"small_class" : 3001,
		"copy_open_class" : 4001
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '1001':  "open_class",
		 '1002':  "1002",
		 '1003':  "1003",
		 '1100':  "1100",
		 '2001':  "2001",
		 '3001':  "small_class",
		 '4001':  "copy_open_class"
	},

		//常规
		V_0:0,
		//赠送
		V_1:1,
		//试听
		V_2:2,
		//续费
		V_3:3,
		//普通公开课(A)
		V_OPEN_CLASS:1001,
		//普通公开课(B)
		V_1002:1002,
		//高级公开课
		V_1003:1003,
		//培训课程
		V_1100:1100,
		//公开答疑
		V_2001:2001,
		//小班课
		V_SMALL_CLASS:3001,
		//机器人课程
		V_COPY_OPEN_CLASS:4001,

		//常规
		S_0:"0",
		//赠送
		S_1:"1",
		//试听
		S_2:"2",
		//续费
		S_3:"3",
		//普通公开课(A)
		S_OPEN_CLASS:"open_class",
		//普通公开课(B)
		S_1002:"1002",
		//高级公开课
		S_1003:"1003",
		//培训课程
		S_1100:"1100",
		//公开答疑
		S_2001:"2001",
		//小班课
		S_SMALL_CLASS:"small_class",
		//机器人课程
		S_COPY_OPEN_CLASS:"copy_open_class"


},

course_status : {
	desc_map : {
		'0' : "正常上课",
		'1' : "已结课",
		'2' : "停课"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//正常上课
		V_0:0,
		//已结课
		V_1:1,
		//停课
		V_2:2,

		//正常上课
		S_0:"0",
		//已结课
		S_1:"1",
		//停课
		S_2:"2"


},

date_id_log_type : {
	desc_map : {
		'1001' : "销售手工分配个人",
		'1002' : "销售抢新生个数",
		'1003' : "销售历史抢单数",
		'2001' : "学员人数"
	},
	simple_desc_map: {
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'2001' : ""
	},
	s2v_map:{
		"seller_assigned_count" : 1001,
		"seller_get_new_count" : 1002,
		"seller_get_history_count" : 1003,
		"valid_user_count" : 2001
	},
	v2s_map:{
		 '1001':  "seller_assigned_count",
		 '1002':  "seller_get_new_count",
		 '1003':  "seller_get_history_count",
		 '2001':  "valid_user_count"
	},

		//销售手工分配个人
		V_SELLER_ASSIGNED_COUNT:1001,
		//销售抢新生个数
		V_SELLER_GET_NEW_COUNT:1002,
		//销售历史抢单数
		V_SELLER_GET_HISTORY_COUNT:1003,
		//学员人数
		V_VALID_USER_COUNT:2001,

		//销售手工分配个人
		S_SELLER_ASSIGNED_COUNT:"seller_assigned_count",
		//销售抢新生个数
		S_SELLER_GET_NEW_COUNT:"seller_get_new_count",
		//销售历史抢单数
		S_SELLER_GET_HISTORY_COUNT:"seller_get_history_count",
		//学员人数
		S_VALID_USER_COUNT:"valid_user_count"


},

degree : {
	desc_map : {
		'1' : "普通",
		'2' : "优秀"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//普通
		V_1:1,
		//优秀
		V_2:2,

		//普通
		S_1:"1",
		//优秀
		S_2:"2"


},

department_group : {
	desc_map : {
		'0' : "未设置",
		'1' : "文科组",
		'2' : "数学组",
		'3' : "综合组",
		'4' : "教学质量组",
		'5' : "培训组",
		'6' : "师训组",
		'7' : "老师运营组",
		'8' : "教学组",
		'9' : "产品组",
		'10' : "助教一组",
		'11' : "助教二组",
		'12' : "营销组",
		'13' : "运营组",
		'14' : "质检组",
		'15' : "前端开发组",
		'16' : "后端开发组",
		'17' : "测试组",
		'18' : "运维组",
		'19' : "出纳组",
		'20' : "核算组",
		'21' : "招聘培训组",
		'22' : "薪福绩效组",
		'23' : "员工关系组",
		'24' : "行政组"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'16' : "",
		'17' : "",
		'18' : "",
		'19' : "",
		'20' : "",
		'21' : "",
		'22' : "",
		'23' : "",
		'24' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"15" : 15,
		"16" : 16,
		"17" : 17,
		"18" : 18,
		"19" : 19,
		"20" : 20,
		"21" : 21,
		"22" : 22,
		"23" : 23,
		"24" : 24
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '15':  "15",
		 '16':  "16",
		 '17':  "17",
		 '18':  "18",
		 '19':  "19",
		 '20':  "20",
		 '21':  "21",
		 '22':  "22",
		 '23':  "23",
		 '24':  "24"
	},

		//未设置
		V_0:0,
		//文科组
		V_1:1,
		//数学组
		V_2:2,
		//综合组
		V_3:3,
		//教学质量组
		V_4:4,
		//培训组
		V_5:5,
		//师训组
		V_6:6,
		//老师运营组
		V_7:7,
		//教学组
		V_8:8,
		//产品组
		V_9:9,
		//助教一组
		V_10:10,
		//助教二组
		V_11:11,
		//营销组
		V_12:12,
		//运营组
		V_13:13,
		//质检组
		V_14:14,
		//前端开发组
		V_15:15,
		//后端开发组
		V_16:16,
		//测试组
		V_17:17,
		//运维组
		V_18:18,
		//出纳组
		V_19:19,
		//核算组
		V_20:20,
		//招聘培训组
		V_21:21,
		//薪福绩效组
		V_22:22,
		//员工关系组
		V_23:23,
		//行政组
		V_24:24,

		//未设置
		S_0:"0",
		//文科组
		S_1:"1",
		//数学组
		S_2:"2",
		//综合组
		S_3:"3",
		//教学质量组
		S_4:"4",
		//培训组
		S_5:"5",
		//师训组
		S_6:"6",
		//老师运营组
		S_7:"7",
		//教学组
		S_8:"8",
		//产品组
		S_9:"9",
		//助教一组
		S_10:"10",
		//助教二组
		S_11:"11",
		//营销组
		S_12:"12",
		//运营组
		S_13:"13",
		//质检组
		S_14:"14",
		//前端开发组
		S_15:"15",
		//后端开发组
		S_16:"16",
		//测试组
		S_17:"17",
		//运维组
		S_18:"18",
		//出纳组
		S_19:"19",
		//核算组
		S_20:"20",
		//招聘培训组
		S_21:"21",
		//薪福绩效组
		S_22:"22",
		//员工关系组
		S_23:"23",
		//行政组
		S_24:"24"


},

department : {
	desc_map : {
		'0' : "未设置",
		'1' : "教研部",
		'2' : "教学质量组",
		'3' : "培训部",
		'4' : "师训部",
		'5' : "老师运营组",
		'6' : "教学部",
		'7' : "产品部",
		'8' : "咨询一部",
		'9' : "咨询二部",
		'10' : "咨询三部",
		'11' : "销售运营部",
		'12' : "助教部",
		'13' : "教务部",
		'14' : "客服部",
		'15' : "市场部",
		'16' : "研发部",
		'17' : "财务部",
		'18' : "人事部"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'16' : "",
		'17' : "",
		'18' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"15" : 15,
		"16" : 16,
		"17" : 17,
		"18" : 18
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '15':  "15",
		 '16':  "16",
		 '17':  "17",
		 '18':  "18"
	},

		//未设置
		V_0:0,
		//教研部
		V_1:1,
		//教学质量组
		V_2:2,
		//培训部
		V_3:3,
		//师训部
		V_4:4,
		//老师运营组
		V_5:5,
		//教学部
		V_6:6,
		//产品部
		V_7:7,
		//咨询一部
		V_8:8,
		//咨询二部
		V_9:9,
		//咨询三部
		V_10:10,
		//销售运营部
		V_11:11,
		//助教部
		V_12:12,
		//教务部
		V_13:13,
		//客服部
		V_14:14,
		//市场部
		V_15:15,
		//研发部
		V_16:16,
		//财务部
		V_17:17,
		//人事部
		V_18:18,

		//未设置
		S_0:"0",
		//教研部
		S_1:"1",
		//教学质量组
		S_2:"2",
		//培训部
		S_3:"3",
		//师训部
		S_4:"4",
		//老师运营组
		S_5:"5",
		//教学部
		S_6:"6",
		//产品部
		S_7:"7",
		//咨询一部
		S_8:"8",
		//咨询二部
		S_9:"9",
		//咨询三部
		S_10:"10",
		//销售运营部
		S_11:"11",
		//助教部
		S_12:"12",
		//教务部
		S_13:"13",
		//客服部
		S_14:"14",
		//市场部
		S_15:"15",
		//研发部
		S_16:"16",
		//财务部
		S_17:"17",
		//人事部
		S_18:"18"


},

dialect_type : {
	desc_map : {
		'0' : "无",
		'100' : "河南",
		'200' : "四川",
		'300' : "上海",
		'400' : "北京",
		'500' : "天津",
		'600' : "山西",
		'700' : "内蒙古",
		'800' : "辽宁",
		'900' : "吉林",
		'1000' : "黑龙江",
		'1100' : "江苏",
		'1200' : "浙江",
		'1300' : "安徽",
		'1400' : "福建",
		'1500' : "江西",
		'1600' : "山东",
		'1700' : "湖北",
		'1800' : "湖南",
		'1900' : "广东",
		'2000' : "广西",
		'2100' : "海南",
		'2200' : "重庆",
		'2300' : "贵州",
		'2400' : "云南",
		'2500' : "西藏",
		'2600' : "陕西",
		'2700' : "甘肃",
		'2800' : "青海",
		'2900' : "宁夏",
		'3000' : "河北",
		'3100' : "新疆",
		'3200' : "香港",
		'3300' : "澳门",
		'3400' : "台湾"
	},
	simple_desc_map: {
		'0' : "",
		'100' : "",
		'200' : "",
		'300' : "",
		'400' : "",
		'500' : "",
		'600' : "",
		'700' : "",
		'800' : "",
		'900' : "",
		'1000' : "",
		'1100' : "",
		'1200' : "",
		'1300' : "",
		'1400' : "",
		'1500' : "",
		'1600' : "",
		'1700' : "",
		'1800' : "",
		'1900' : "",
		'2000' : "",
		'2100' : "",
		'2200' : "",
		'2300' : "",
		'2400' : "",
		'2500' : "",
		'2600' : "",
		'2700' : "",
		'2800' : "",
		'2900' : "",
		'3000' : "",
		'3100' : "",
		'3200' : "",
		'3300' : "",
		'3400' : ""
	},
	s2v_map:{
		"0" : 0,
		"100" : 100,
		"200" : 200,
		"300" : 300,
		"400" : 400,
		"500" : 500,
		"600" : 600,
		"700" : 700,
		"800" : 800,
		"900" : 900,
		"1000" : 1000,
		"1100" : 1100,
		"1200" : 1200,
		"1300" : 1300,
		"1400" : 1400,
		"1500" : 1500,
		"1600" : 1600,
		"1700" : 1700,
		"1800" : 1800,
		"1900" : 1900,
		"2000" : 2000,
		"2100" : 2100,
		"2200" : 2200,
		"2300" : 2300,
		"2400" : 2400,
		"2500" : 2500,
		"2600" : 2600,
		"2700" : 2700,
		"2800" : 2800,
		"2900" : 2900,
		"3000" : 3000,
		"3100" : 3100,
		"3200" : 3200,
		"3300" : 3300,
		"3400" : 3400
	},
	v2s_map:{
		 '0':  "0",
		 '100':  "100",
		 '200':  "200",
		 '300':  "300",
		 '400':  "400",
		 '500':  "500",
		 '600':  "600",
		 '700':  "700",
		 '800':  "800",
		 '900':  "900",
		 '1000':  "1000",
		 '1100':  "1100",
		 '1200':  "1200",
		 '1300':  "1300",
		 '1400':  "1400",
		 '1500':  "1500",
		 '1600':  "1600",
		 '1700':  "1700",
		 '1800':  "1800",
		 '1900':  "1900",
		 '2000':  "2000",
		 '2100':  "2100",
		 '2200':  "2200",
		 '2300':  "2300",
		 '2400':  "2400",
		 '2500':  "2500",
		 '2600':  "2600",
		 '2700':  "2700",
		 '2800':  "2800",
		 '2900':  "2900",
		 '3000':  "3000",
		 '3100':  "3100",
		 '3200':  "3200",
		 '3300':  "3300",
		 '3400':  "3400"
	},

		//无
		V_0:0,
		//河南
		V_100:100,
		//四川
		V_200:200,
		//上海
		V_300:300,
		//北京
		V_400:400,
		//天津
		V_500:500,
		//山西
		V_600:600,
		//内蒙古
		V_700:700,
		//辽宁
		V_800:800,
		//吉林
		V_900:900,
		//黑龙江
		V_1000:1000,
		//江苏
		V_1100:1100,
		//浙江
		V_1200:1200,
		//安徽
		V_1300:1300,
		//福建
		V_1400:1400,
		//江西
		V_1500:1500,
		//山东
		V_1600:1600,
		//湖北
		V_1700:1700,
		//湖南
		V_1800:1800,
		//广东
		V_1900:1900,
		//广西
		V_2000:2000,
		//海南
		V_2100:2100,
		//重庆
		V_2200:2200,
		//贵州
		V_2300:2300,
		//云南
		V_2400:2400,
		//西藏
		V_2500:2500,
		//陕西
		V_2600:2600,
		//甘肃
		V_2700:2700,
		//青海
		V_2800:2800,
		//宁夏
		V_2900:2900,
		//河北
		V_3000:3000,
		//新疆
		V_3100:3100,
		//香港
		V_3200:3200,
		//澳门
		V_3300:3300,
		//台湾
		V_3400:3400,

		//无
		S_0:"0",
		//河南
		S_100:"100",
		//四川
		S_200:"200",
		//上海
		S_300:"300",
		//北京
		S_400:"400",
		//天津
		S_500:"500",
		//山西
		S_600:"600",
		//内蒙古
		S_700:"700",
		//辽宁
		S_800:"800",
		//吉林
		S_900:"900",
		//黑龙江
		S_1000:"1000",
		//江苏
		S_1100:"1100",
		//浙江
		S_1200:"1200",
		//安徽
		S_1300:"1300",
		//福建
		S_1400:"1400",
		//江西
		S_1500:"1500",
		//山东
		S_1600:"1600",
		//湖北
		S_1700:"1700",
		//湖南
		S_1800:"1800",
		//广东
		S_1900:"1900",
		//广西
		S_2000:"2000",
		//海南
		S_2100:"2100",
		//重庆
		S_2200:"2200",
		//贵州
		S_2300:"2300",
		//云南
		S_2400:"2400",
		//西藏
		S_2500:"2500",
		//陕西
		S_2600:"2600",
		//甘肃
		S_2700:"2700",
		//青海
		S_2800:"2800",
		//宁夏
		S_2900:"2900",
		//河北
		S_3000:"3000",
		//新疆
		S_3100:"3100",
		//香港
		S_3200:"3200",
		//澳门
		S_3300:"3300",
		//台湾
		S_3400:"3400"


},

education : {
	desc_map : {
		'0' : "未设置",
		'1' : "本科",
		'2' : "硕士",
		'3' : "博士",
		'4' : "大专",
		'5' : "本科在读"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//未设置
		V_0:0,
		//本科
		V_1:1,
		//硕士
		V_2:2,
		//博士
		V_3:3,
		//大专
		V_4:4,
		//本科在读
		V_5:5,

		//未设置
		S_0:"0",
		//本科
		S_1:"1",
		//硕士
		S_2:"2",
		//博士
		S_3:"3",
		//大专
		S_4:"4",
		//本科在读
		S_5:"5"


},

employee_level : {
	desc_map : {
		'0' : "未设置",
		'1' : "员工",
		'2' : "实习生"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未设置
		V_0:0,
		//员工
		V_1:1,
		//实习生
		V_2:2,

		//未设置
		S_0:"0",
		//员工
		S_1:"1",
		//实习生
		S_2:"2"


},

ency_type : {
	desc_map : {
		'1' : "升学百科",
		'2' : "三大杯赛",
		'3' : "小升初流程",
		'4' : "最贵民办学区",
		'5' : "最贵公办学区",
		'6' : "民办初中排名",
		'7' : "公办初中排名",
		'8' : "民办小学排名",
		'9' : "预录取排名",
		'10' : "高考成绩",
		'99' : "编辑百科标签"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'99' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"99" : 99
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '99':  "99"
	},

		//升学百科
		V_1:1,
		//三大杯赛
		V_2:2,
		//小升初流程
		V_3:3,
		//最贵民办学区
		V_4:4,
		//最贵公办学区
		V_5:5,
		//民办初中排名
		V_6:6,
		//公办初中排名
		V_7:7,
		//民办小学排名
		V_8:8,
		//预录取排名
		V_9:9,
		//高考成绩
		V_10:10,
		//编辑百科标签
		V_99:99,

		//升学百科
		S_1:"1",
		//三大杯赛
		S_2:"2",
		//小升初流程
		S_3:"3",
		//最贵民办学区
		S_4:"4",
		//最贵公办学区
		S_5:"5",
		//民办初中排名
		S_6:"6",
		//公办初中排名
		S_7:"7",
		//民办小学排名
		S_8:"8",
		//预录取排名
		S_9:"9",
		//高考成绩
		S_10:"10",
		//编辑百科标签
		S_99:"99"


},

env : {
	desc_map : {
		'1' : "开发",
		'3' : "外网测试",
		'4' : "外网正式",
		'10' : "phpunit 运行时"
	},
	simple_desc_map: {
		'1' : "",
		'3' : "",
		'4' : "",
		'10' : ""
	},
	s2v_map:{
		"local" : 1,
		"test" : 3,
		"release" : 4,
		"testing" : 10
	},
	v2s_map:{
		 '1':  "local",
		 '3':  "test",
		 '4':  "release",
		 '10':  "testing"
	},

		//开发
		V_LOCAL:1,
		//外网测试
		V_TEST:3,
		//外网正式
		V_RELEASE:4,
		//phpunit 运行时
		V_TESTING:10,

		//开发
		S_LOCAL:"local",
		//外网测试
		S_TEST:"test",
		//外网正式
		S_RELEASE:"release",
		//phpunit 运行时
		S_TESTING:"testing"


},

error : {
	desc_map : {
		'0' : "成功",
		'7000' : "系统错误",
		'7001' : "验证码错误",
		'7002' : "用户名密码错误",
		'7003' : "没有权限",
		'7010' : "没有登录",
		'7020' : "用户不操作",
		'7030' : "",
		'7031' : "",
		'7101' : "",
		'7201' : "非法参数",
		'7202' : "",
		'7301' : "",
		'7401' : "",
		'7402' : ""
	},
	simple_desc_map: {
		'0' : "",
		'7000' : "",
		'7001' : "",
		'7002' : "",
		'7003' : "",
		'7010' : "",
		'7020' : "",
		'7030' : "",
		'7031' : "",
		'7101' : "",
		'7201' : "",
		'7202' : "",
		'7301' : "",
		'7401' : "",
		'7402' : ""
	},
	s2v_map:{
		"success" : 0,
		"system_err" : 7000,
		"wrong_verify_code" : 7001,
		"wrong_account_passwd" : 7002,
		"access_denied" : 7003,
		"not_login" : 7010,
		"user_not_exist" : 7020,
		"not_auth" : 7030,
		"not_permit" : 7031,
		"course_not_available" : 7101,
		"illegal_params" : 7201,
		"illegal_grade" : 7202,
		"course_alerted" : 7301,
		"to_late_to_cancel" : 7401,
		"has_a_teacher" : 7402
	},
	v2s_map:{
		 '0':  "success",
		 '7000':  "system_err",
		 '7001':  "wrong_verify_code",
		 '7002':  "wrong_account_passwd",
		 '7003':  "access_denied",
		 '7010':  "not_login",
		 '7020':  "user_not_exist",
		 '7030':  "not_auth",
		 '7031':  "not_permit",
		 '7101':  "course_not_available",
		 '7201':  "illegal_params",
		 '7202':  "illegal_grade",
		 '7301':  "course_alerted",
		 '7401':  "to_late_to_cancel",
		 '7402':  "has_a_teacher"
	},

		//成功
		V_SUCCESS:0,
		//系统错误
		V_SYSTEM_ERR:7000,
		//验证码错误
		V_WRONG_VERIFY_CODE:7001,
		//用户名密码错误
		V_WRONG_ACCOUNT_PASSWD:7002,
		//没有权限
		V_ACCESS_DENIED:7003,
		//没有登录
		V_NOT_LOGIN:7010,
		//用户不操作
		V_USER_NOT_EXIST:7020,
		//
		V_NOT_AUTH:7030,
		//
		V_NOT_PERMIT:7031,
		//
		V_COURSE_NOT_AVAILABLE:7101,
		//非法参数
		V_ILLEGAL_PARAMS:7201,
		//
		V_ILLEGAL_GRADE:7202,
		//
		V_COURSE_ALERTED:7301,
		//
		V_TO_LATE_TO_CANCEL:7401,
		//
		V_HAS_A_TEACHER:7402,

		//成功
		S_SUCCESS:"success",
		//系统错误
		S_SYSTEM_ERR:"system_err",
		//验证码错误
		S_WRONG_VERIFY_CODE:"wrong_verify_code",
		//用户名密码错误
		S_WRONG_ACCOUNT_PASSWD:"wrong_account_passwd",
		//没有权限
		S_ACCESS_DENIED:"access_denied",
		//没有登录
		S_NOT_LOGIN:"not_login",
		//用户不操作
		S_USER_NOT_EXIST:"user_not_exist",
		//
		S_NOT_AUTH:"not_auth",
		//
		S_NOT_PERMIT:"not_permit",
		//
		S_COURSE_NOT_AVAILABLE:"course_not_available",
		//非法参数
		S_ILLEGAL_PARAMS:"illegal_params",
		//
		S_ILLEGAL_GRADE:"illegal_grade",
		//
		S_COURSE_ALERTED:"course_alerted",
		//
		S_TO_LATE_TO_CANCEL:"to_late_to_cancel",
		//
		S_HAS_A_TEACHER:"has_a_teacher"


},

express_name : {
	desc_map : {
		'0' : "EX_START",
		'1' : "顺丰速运",
		'2' : "申通快递",
		'3' : "中通快递",
		'4' : "圆通快递",
		'5' : "韵达快递",
		'6' : "EX_END"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//EX_START
		V_0:0,
		//顺丰速运
		V_1:1,
		//申通快递
		V_2:2,
		//中通快递
		V_3:3,
		//圆通快递
		V_4:4,
		//韵达快递
		V_5:5,
		//EX_END
		V_6:6,

		//EX_START
		S_0:"0",
		//顺丰速运
		S_1:"1",
		//申通快递
		S_2:"2",
		//中通快递
		S_3:"3",
		//圆通快递
		S_4:"4",
		//韵达快递
		S_5:"5",
		//EX_END
		S_6:"6"


},

feedback_type : {
	desc_map : {
		'101' : "基础工资",
		'102' : "课时奖励工资",
		'103' : "全勤奖",
		'104' : "荣誉榜排名奖金",
		'201' : "上课迟到扣款",
		'202' : "规定时间内未评价扣款",
		'203' : "课前未传讲义扣款",
		'204' : "未提前4小时换课",
		'205' : "教学事故"
	},
	simple_desc_map: {
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'204' : "",
		'205' : ""
	},
	s2v_map:{
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"204" : 204,
		"205" : 205
	},
	v2s_map:{
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '204':  "204",
		 '205':  "205"
	},

		//基础工资
		V_101:101,
		//课时奖励工资
		V_102:102,
		//全勤奖
		V_103:103,
		//荣誉榜排名奖金
		V_104:104,
		//上课迟到扣款
		V_201:201,
		//规定时间内未评价扣款
		V_202:202,
		//课前未传讲义扣款
		V_203:203,
		//未提前4小时换课
		V_204:204,
		//教学事故
		V_205:205,

		//基础工资
		S_101:"101",
		//课时奖励工资
		S_102:"102",
		//全勤奖
		S_103:"103",
		//荣誉榜排名奖金
		S_104:"104",
		//上课迟到扣款
		S_201:"201",
		//规定时间内未评价扣款
		S_202:"202",
		//课前未传讲义扣款
		S_203:"203",
		//未提前4小时换课
		S_204:"204",
		//教学事故
		S_205:"205"


},

flow_check_flag : {
	desc_map : {
		'0' : "未审核",
		'1' : "通过",
		'2' : "不通过",
		'3' : "驳回"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"no_check" : 0,
		"pass" : 1,
		"no_pass" : 2,
		"return_back" : 3
	},
	v2s_map:{
		 '0':  "no_check",
		 '1':  "pass",
		 '2':  "no_pass",
		 '3':  "return_back"
	},

		//未审核
		V_NO_CHECK:0,
		//通过
		V_PASS:1,
		//不通过
		V_NO_PASS:2,
		//驳回
		V_RETURN_BACK:3,

		//未审核
		S_NO_CHECK:"no_check",
		//通过
		S_PASS:"pass",
		//不通过
		S_NO_PASS:"no_pass",
		//驳回
		S_RETURN_BACK:"return_back"


},

flow_status : {
	desc_map : {
		'0' : "无",
		'1' : "进行中",
		'2' : "通过",
		'3' : "不通过"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"no_start" : 0,
		"start" : 1,
		"pass" : 2,
		"no_pass" : 3
	},
	v2s_map:{
		 '0':  "no_start",
		 '1':  "start",
		 '2':  "pass",
		 '3':  "no_pass"
	},

		//无
		V_NO_START:0,
		//进行中
		V_START:1,
		//通过
		V_PASS:2,
		//不通过
		V_NO_PASS:3,

		//无
		S_NO_START:"no_start",
		//进行中
		S_START:"start",
		//通过
		S_PASS:"pass",
		//不通过
		S_NO_PASS:"no_pass"


},

flow_type : {
	desc_map : {
		'1' : "请假",
		'1001' : "学生退费",
		'1002' : "助教-学生退费",
		'2001' : "销售提交试听无需试卷",
		'2002' : "特殊折扣申请",
		'2003' : "SELLER课程有效申请",
		'3001' : "助教-无效课程,学生不扣，付老师工资",
		'3002' : "课时转赠",
		'4001' : "老师离职申请确认"
	},
	simple_desc_map: {
		'1' : "",
		'1001' : "",
		'1002' : "",
		'2001' : "",
		'2002' : "",
		'2003' : "",
		'3001' : "",
		'3002' : "",
		'4001' : ""
	},
	s2v_map:{
		"qingjia" : 1,
		"student_refund" : 1001,
		"ass_order_refund" : 1002,
		"seller_post_test_lesson_without_paper" : 2001,
		"seller_order_require" : 2002,
		"seller_recheck_lesson_sucess" : 2003,
		"ass_lesson_confirm_flag_4" : 3001,
		"order_exchange" : 3002,
		"confirm_teacher_quit" : 4001
	},
	v2s_map:{
		 '1':  "qingjia",
		 '1001':  "student_refund",
		 '1002':  "ass_order_refund",
		 '2001':  "seller_post_test_lesson_without_paper",
		 '2002':  "seller_order_require",
		 '2003':  "seller_recheck_lesson_sucess",
		 '3001':  "ass_lesson_confirm_flag_4",
		 '3002':  "order_exchange",
		 '4001':  "confirm_teacher_quit"
	},

		//请假
		V_QINGJIA:1,
		//学生退费
		V_STUDENT_REFUND:1001,
		//助教-学生退费
		V_ASS_ORDER_REFUND:1002,
		//销售提交试听无需试卷
		V_SELLER_POST_TEST_LESSON_WITHOUT_PAPER:2001,
		//特殊折扣申请
		V_SELLER_ORDER_REQUIRE:2002,
		//SELLER课程有效申请
		V_SELLER_RECHECK_LESSON_SUCESS:2003,
		//助教-无效课程,学生不扣，付老师工资
		V_ASS_LESSON_CONFIRM_FLAG_4:3001,
		//课时转赠
		V_ORDER_EXCHANGE:3002,
		//老师离职申请确认
		V_CONFIRM_TEACHER_QUIT:4001,

		//请假
		S_QINGJIA:"qingjia",
		//学生退费
		S_STUDENT_REFUND:"student_refund",
		//助教-学生退费
		S_ASS_ORDER_REFUND:"ass_order_refund",
		//销售提交试听无需试卷
		S_SELLER_POST_TEST_LESSON_WITHOUT_PAPER:"seller_post_test_lesson_without_paper",
		//特殊折扣申请
		S_SELLER_ORDER_REQUIRE:"seller_order_require",
		//SELLER课程有效申请
		S_SELLER_RECHECK_LESSON_SUCESS:"seller_recheck_lesson_sucess",
		//助教-无效课程,学生不扣，付老师工资
		S_ASS_LESSON_CONFIRM_FLAG_4:"ass_lesson_confirm_flag_4",
		//课时转赠
		S_ORDER_EXCHANGE:"order_exchange",
		//老师离职申请确认
		S_CONFIRM_TEACHER_QUIT:"confirm_teacher_quit"


},

freetime : {
	desc_map : {
		'0' : "无空闲",
		'1' : "空闲"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//无空闲
		V_0:0,
		//空闲
		V_1:1,

		//无空闲
		S_0:"0",
		//空闲
		S_1:"1"


},

from_parent_order_type : {
	desc_map : {
		'0' : "课程包赠送",
		'1' : "转介绍赠送",
		'2' : "试听24小时内签单赠送",
		'3' : "特批赠送",
		'4' : "课程包特殊赠送",
		'5' : "转赠"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//课程包赠送
		V_0:0,
		//转介绍赠送
		V_1:1,
		//试听24小时内签单赠送
		V_2:2,
		//特批赠送
		V_3:3,
		//课程包特殊赠送
		V_4:4,
		//转赠
		V_5:5,

		//课程包赠送
		S_0:"0",
		//转介绍赠送
		S_1:"1",
		//试听24小时内签单赠送
		S_2:"2",
		//特批赠送
		S_3:"3",
		//课程包特殊赠送
		S_4:"4",
		//转赠
		S_5:"5"


},

from_type : {
	desc_map : {
		'0' : "课程包",
		'1' : "按课时计费"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//课程包
		V_0:0,
		//按课时计费
		V_1:1,

		//课程包
		S_0:"0",
		//按课时计费
		S_1:"1"


},

gender : {
	desc_map : {
		'0' : "未设置",
		'1' : "男",
		'2' : "女"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未设置
		V_0:0,
		//男
		V_1:1,
		//女
		V_2:2,

		//未设置
		S_0:"0",
		//男
		S_1:"1",
		//女
		S_2:"2"


},

gift_status : {
	desc_map : {
		'0' : "待处理",
		'1' : "已发货",
		'2' : "已收货",
		'3' : "已锁定",
		'4' : "已取消"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//待处理
		V_0:0,
		//已发货
		V_1:1,
		//已收货
		V_2:2,
		//已锁定
		V_3:3,
		//已取消
		V_4:4,

		//待处理
		S_0:"0",
		//已发货
		S_1:"1",
		//已收货
		S_2:"2",
		//已锁定
		S_3:"3",
		//已取消
		S_4:"4"


},

gift_type : {
	desc_map : {
		'0' : "系统礼包",
		'1' : "实物",
		'2' : "虚拟物品(phone)",
		'3' : "虚拟物品(qq)"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//系统礼包
		V_0:0,
		//实物
		V_1:1,
		//虚拟物品(phone)
		V_2:2,
		//虚拟物品(qq)
		V_3:3,

		//系统礼包
		S_0:"0",
		//实物
		S_1:"1",
		//虚拟物品(phone)
		S_2:"2",
		//虚拟物品(qq)
		S_3:"3"


},

grab_status : {
	desc_map : {
		'0' : "未入库",
		'1' : "已入库",
		'2' : "已排课"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未入库
		V_0:0,
		//已入库
		V_1:1,
		//已排课
		V_2:2,

		//未入库
		S_0:"0",
		//已入库
		S_1:"1",
		//已排课
		S_2:"2"


},

grade_part_ex : {
	desc_map : {
		'0' : "未设置",
		'1' : "小学",
		'2' : "初中",
		'3' : "高中",
		'4' : "小学和初中",
		'5' : "初中和高中",
		'6' : "小六和初中",
		'7' : "初三和高中"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//未设置
		V_0:0,
		//小学
		V_1:1,
		//初中
		V_2:2,
		//高中
		V_3:3,
		//小学和初中
		V_4:4,
		//初中和高中
		V_5:5,
		//小六和初中
		V_6:6,
		//初三和高中
		V_7:7,

		//未设置
		S_0:"0",
		//小学
		S_1:"1",
		//初中
		S_2:"2",
		//高中
		S_3:"3",
		//小学和初中
		S_4:"4",
		//初中和高中
		S_5:"5",
		//小六和初中
		S_6:"6",
		//初三和高中
		S_7:"7"


},

grade_part : {
	desc_map : {
		'100' : "小学",
		'200' : "初中",
		'300' : "高中"
	},
	simple_desc_map: {
		'100' : "",
		'200' : "",
		'300' : ""
	},
	s2v_map:{
		"100" : 100,
		"200" : 200,
		"300" : 300
	},
	v2s_map:{
		 '100':  "100",
		 '200':  "200",
		 '300':  "300"
	},

		//小学
		V_100:100,
		//初中
		V_200:200,
		//高中
		V_300:300,

		//小学
		S_100:"100",
		//初中
		S_200:"200",
		//高中
		S_300:"300"


},

grade : {
	desc_map : {
		'100' : "小学",
		'101' : "小一",
		'102' : "小二",
		'103' : "小三",
		'104' : "小四",
		'105' : "小五",
		'106' : "小六",
		'200' : "初中",
		'201' : "初一",
		'202' : "初二",
		'203' : "初三",
		'300' : "高中",
		'301' : "高一",
		'302' : "高二",
		'303' : "高三"
	},
	simple_desc_map: {
		'100' : "",
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'105' : "",
		'106' : "",
		'200' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'300' : "",
		'301' : "",
		'302' : "",
		'303' : ""
	},
	s2v_map:{
		"100" : 100,
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"105" : 105,
		"106" : 106,
		"200" : 200,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"300" : 300,
		"301" : 301,
		"302" : 302,
		"303" : 303
	},
	v2s_map:{
		 '100':  "100",
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '105':  "105",
		 '106':  "106",
		 '200':  "200",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '300':  "300",
		 '301':  "301",
		 '302':  "302",
		 '303':  "303"
	},

		//小学
		V_100:100,
		//小一
		V_101:101,
		//小二
		V_102:102,
		//小三
		V_103:103,
		//小四
		V_104:104,
		//小五
		V_105:105,
		//小六
		V_106:106,
		//初中
		V_200:200,
		//初一
		V_201:201,
		//初二
		V_202:202,
		//初三
		V_203:203,
		//高中
		V_300:300,
		//高一
		V_301:301,
		//高二
		V_302:302,
		//高三
		V_303:303,

		//小学
		S_100:"100",
		//小一
		S_101:"101",
		//小二
		S_102:"102",
		//小三
		S_103:"103",
		//小四
		S_104:"104",
		//小五
		S_105:"105",
		//小六
		S_106:"106",
		//初中
		S_200:"200",
		//初一
		S_201:"201",
		//初二
		S_202:"202",
		//初三
		S_203:"203",
		//高中
		S_300:"300",
		//高一
		S_301:"301",
		//高二
		S_302:"302",
		//高三
		S_303:"303"


},

grade_range : {
	desc_map : {
		'0' : "未设置",
		'1' : "小低",
		'2' : "小高",
		'3' : "初一初二",
		'4' : "初三",
		'5' : "高一高二",
		'6' : "高三"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//未设置
		V_0:0,
		//小低
		V_1:1,
		//小高
		V_2:2,
		//初一初二
		V_3:3,
		//初三
		V_4:4,
		//高一高二
		V_5:5,
		//高三
		V_6:6,

		//未设置
		S_0:"0",
		//小低
		S_1:"1",
		//小高
		S_2:"2",
		//初一初二
		S_3:"3",
		//初三
		S_4:"4",
		//高一高二
		S_5:"5",
		//高三
		S_6:"6"


},

grade_type : {
	desc_map : {
		'0' : "公开课",
		'1' : "1对1",
		'2' : "小班课"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//公开课
		V_0:0,
		//1对1
		V_1:1,
		//小班课
		V_2:2,

		//公开课
		S_0:"0",
		//1对1
		S_1:"1",
		//小班课
		S_2:"2"


},

groupid : {
	desc_map : {
		'66' : "01 后台管理员",
		'52' : "02 非金钱管理账户",
		'37' : "10 助教组长",
		'59' : "11 助教一般",
		'39' : "20 教研组长",
		'70' : "21 教研-一般",
		'67' : "23 教研-排课",
		'68' : "30 市场助长",
		'69' : "31 市场一般",
		'72' : "32 市场分配资源",
		'73' : "33 市场-一般-初级",
		'57' : "40 顾问组长",
		'38' : "41 顾问-一般",
		'74' : "42 顾问-统计",
		'77' : "43 顾问-小组长",
		'76' : "44 顾问-其他",
		'58' : "50 财务",
		'75' : "51 人事",
		'71' : "61 产品",
		'42' : "91 题库-编辑",
		'49' : "92 题库-审核",
		'43' : "93 题库-编辑-统计",
		'78' : "99 角色",
		'48' : "工具箱 学校编辑",
		'60' : "统计",
		'61' : "统计金额",
		'54' : "预约+工具",
		'51' : "预约管理",
		'36' : "超级管理员",
		'55' : "查看合同金额",
		'47' : "查看用户"
	},
	simple_desc_map: {
		'66' : "",
		'52' : "",
		'37' : "",
		'59' : "",
		'39' : "",
		'70' : "",
		'67' : "",
		'68' : "",
		'69' : "",
		'72' : "",
		'73' : "",
		'57' : "",
		'38' : "",
		'74' : "",
		'77' : "",
		'76' : "",
		'58' : "",
		'75' : "",
		'71' : "",
		'42' : "",
		'49' : "",
		'43' : "",
		'78' : "",
		'48' : "",
		'60' : "",
		'61' : "",
		'54' : "",
		'51' : "",
		'36' : "",
		'55' : "",
		'47' : ""
	},
	s2v_map:{
		"66" : 66,
		"52" : 52,
		"37" : 37,
		"59" : 59,
		"39" : 39,
		"70" : 70,
		"67" : 67,
		"68" : 68,
		"69" : 69,
		"72" : 72,
		"73" : 73,
		"57" : 57,
		"38" : 38,
		"74" : 74,
		"77" : 77,
		"76" : 76,
		"58" : 58,
		"75" : 75,
		"71" : 71,
		"42" : 42,
		"49" : 49,
		"43" : 43,
		"78" : 78,
		"48" : 48,
		"60" : 60,
		"61" : 61,
		"54" : 54,
		"51" : 51,
		"36" : 36,
		"55" : 55,
		"47" : 47
	},
	v2s_map:{
		 '66':  "66",
		 '52':  "52",
		 '37':  "37",
		 '59':  "59",
		 '39':  "39",
		 '70':  "70",
		 '67':  "67",
		 '68':  "68",
		 '69':  "69",
		 '72':  "72",
		 '73':  "73",
		 '57':  "57",
		 '38':  "38",
		 '74':  "74",
		 '77':  "77",
		 '76':  "76",
		 '58':  "58",
		 '75':  "75",
		 '71':  "71",
		 '42':  "42",
		 '49':  "49",
		 '43':  "43",
		 '78':  "78",
		 '48':  "48",
		 '60':  "60",
		 '61':  "61",
		 '54':  "54",
		 '51':  "51",
		 '36':  "36",
		 '55':  "55",
		 '47':  "47"
	},

		//01 后台管理员
		V_66:66,
		//02 非金钱管理账户
		V_52:52,
		//10 助教组长
		V_37:37,
		//11 助教一般
		V_59:59,
		//20 教研组长
		V_39:39,
		//21 教研-一般
		V_70:70,
		//23 教研-排课
		V_67:67,
		//30 市场助长
		V_68:68,
		//31 市场一般
		V_69:69,
		//32 市场分配资源
		V_72:72,
		//33 市场-一般-初级
		V_73:73,
		//40 顾问组长
		V_57:57,
		//41 顾问-一般
		V_38:38,
		//42 顾问-统计
		V_74:74,
		//43 顾问-小组长
		V_77:77,
		//44 顾问-其他
		V_76:76,
		//50 财务
		V_58:58,
		//51 人事
		V_75:75,
		//61 产品
		V_71:71,
		//91 题库-编辑
		V_42:42,
		//92 题库-审核
		V_49:49,
		//93 题库-编辑-统计
		V_43:43,
		//99 角色
		V_78:78,
		//工具箱 学校编辑
		V_48:48,
		//统计
		V_60:60,
		//统计金额
		V_61:61,
		//预约+工具
		V_54:54,
		//预约管理
		V_51:51,
		//超级管理员
		V_36:36,
		//查看合同金额
		V_55:55,
		//查看用户
		V_47:47,

		//01 后台管理员
		S_66:"66",
		//02 非金钱管理账户
		S_52:"52",
		//10 助教组长
		S_37:"37",
		//11 助教一般
		S_59:"59",
		//20 教研组长
		S_39:"39",
		//21 教研-一般
		S_70:"70",
		//23 教研-排课
		S_67:"67",
		//30 市场助长
		S_68:"68",
		//31 市场一般
		S_69:"69",
		//32 市场分配资源
		S_72:"72",
		//33 市场-一般-初级
		S_73:"73",
		//40 顾问组长
		S_57:"57",
		//41 顾问-一般
		S_38:"38",
		//42 顾问-统计
		S_74:"74",
		//43 顾问-小组长
		S_77:"77",
		//44 顾问-其他
		S_76:"76",
		//50 财务
		S_58:"58",
		//51 人事
		S_75:"75",
		//61 产品
		S_71:"71",
		//91 题库-编辑
		S_42:"42",
		//92 题库-审核
		S_49:"49",
		//93 题库-编辑-统计
		S_43:"43",
		//99 角色
		S_78:"78",
		//工具箱 学校编辑
		S_48:"48",
		//统计
		S_60:"60",
		//统计金额
		S_61:"61",
		//预约+工具
		S_54:"54",
		//预约管理
		S_51:"51",
		//超级管理员
		S_36:"36",
		//查看合同金额
		S_55:"55",
		//查看用户
		S_47:"47"


},

group_seller_student_status : {
	desc_map : {
		'1' : "所有例子",
		'2' : "优先跟进",
		'3' : "待排课",
		'4' : "待通知",
		'5' : "待监课",
		'6' : "待催费",
		'7' : "正式学员"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//所有例子
		V_1:1,
		//优先跟进
		V_2:2,
		//待排课
		V_3:3,
		//待通知
		V_4:4,
		//待监课
		V_5:5,
		//待催费
		V_6:6,
		//正式学员
		V_7:7,

		//所有例子
		S_1:"1",
		//优先跟进
		S_2:"2",
		//待排课
		S_3:"3",
		//待通知
		S_4:"4",
		//待监课
		S_5:"5",
		//待催费
		S_6:"6",
		//正式学员
		S_7:"7"


},

honor_list : {
	desc_map : {
		'1' : "10000",
		'2' : "8000",
		'3' : "6000",
		'4' : "5000",
		'5' : "2500"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//10000
		V_1:1,
		//8000
		V_2:2,
		//6000
		V_3:3,
		//5000
		V_4:4,
		//2500
		V_5:5,

		//10000
		S_1:"1",
		//8000
		S_2:"2",
		//6000
		S_3:"3",
		//5000
		S_4:"4",
		//2500
		S_5:"5"


},

hour : {
	desc_map : {
		'0' : "00:00:00-01:00:00",
		'1' : "01:00:00-02:00:00",
		'2' : "02:00:00-03:00:00",
		'3' : "03:00:00-04:00:00",
		'4' : "04:00:00-05:00:00",
		'5' : "05:00:00-06:00:00",
		'6' : "06:00:00-07:00:00",
		'7' : "07:00:00-08:00:00",
		'8' : "08:00:00-09:00:00",
		'9' : "09:00:00-10:00:00",
		'10' : "10:00:00-11:00:00",
		'11' : "11:00:00-12:00:00",
		'12' : "12:00:00-13:00:00",
		'13' : "13:00:00-14:00:00",
		'14' : "14:00:00-15:00:00",
		'15' : "15:00:00-16:00:00",
		'16' : "16:00:00-17:00:00",
		'17' : "17:00:00-18:00:00",
		'18' : "18:00:00-19:00:00",
		'19' : "19:00:00-20:00:00",
		'20' : "20:00:00-21:00:00",
		'21' : "21:00:00-22:00:00",
		'22' : "22:00:00-23:00:00",
		'23' : "23:00:00-00:00:00"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'16' : "",
		'17' : "",
		'18' : "",
		'19' : "",
		'20' : "",
		'21' : "",
		'22' : "",
		'23' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"15" : 15,
		"16" : 16,
		"17" : 17,
		"18" : 18,
		"19" : 19,
		"20" : 20,
		"21" : 21,
		"22" : 22,
		"23" : 23
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '15':  "15",
		 '16':  "16",
		 '17':  "17",
		 '18':  "18",
		 '19':  "19",
		 '20':  "20",
		 '21':  "21",
		 '22':  "22",
		 '23':  "23"
	},

		//00:00:00-01:00:00
		V_0:0,
		//01:00:00-02:00:00
		V_1:1,
		//02:00:00-03:00:00
		V_2:2,
		//03:00:00-04:00:00
		V_3:3,
		//04:00:00-05:00:00
		V_4:4,
		//05:00:00-06:00:00
		V_5:5,
		//06:00:00-07:00:00
		V_6:6,
		//07:00:00-08:00:00
		V_7:7,
		//08:00:00-09:00:00
		V_8:8,
		//09:00:00-10:00:00
		V_9:9,
		//10:00:00-11:00:00
		V_10:10,
		//11:00:00-12:00:00
		V_11:11,
		//12:00:00-13:00:00
		V_12:12,
		//13:00:00-14:00:00
		V_13:13,
		//14:00:00-15:00:00
		V_14:14,
		//15:00:00-16:00:00
		V_15:15,
		//16:00:00-17:00:00
		V_16:16,
		//17:00:00-18:00:00
		V_17:17,
		//18:00:00-19:00:00
		V_18:18,
		//19:00:00-20:00:00
		V_19:19,
		//20:00:00-21:00:00
		V_20:20,
		//21:00:00-22:00:00
		V_21:21,
		//22:00:00-23:00:00
		V_22:22,
		//23:00:00-00:00:00
		V_23:23,

		//00:00:00-01:00:00
		S_0:"0",
		//01:00:00-02:00:00
		S_1:"1",
		//02:00:00-03:00:00
		S_2:"2",
		//03:00:00-04:00:00
		S_3:"3",
		//04:00:00-05:00:00
		S_4:"4",
		//05:00:00-06:00:00
		S_5:"5",
		//06:00:00-07:00:00
		S_6:"6",
		//07:00:00-08:00:00
		S_7:"7",
		//08:00:00-09:00:00
		S_8:"8",
		//09:00:00-10:00:00
		S_9:"9",
		//10:00:00-11:00:00
		S_10:"10",
		//11:00:00-12:00:00
		S_11:"11",
		//12:00:00-13:00:00
		S_12:"12",
		//13:00:00-14:00:00
		S_13:"13",
		//14:00:00-15:00:00
		S_14:"14",
		//15:00:00-16:00:00
		S_15:"15",
		//16:00:00-17:00:00
		S_16:"16",
		//17:00:00-18:00:00
		S_17:"17",
		//18:00:00-19:00:00
		S_18:"18",
		//19:00:00-20:00:00
		S_19:"19",
		//20:00:00-21:00:00
		S_20:"20",
		//21:00:00-22:00:00
		S_21:"21",
		//22:00:00-23:00:00
		S_22:"22",
		//23:00:00-00:00:00
		S_23:"23"


},

identity : {
	desc_map : {
		'0' : "未设置",
		'1' : "高校生",
		'2' : "在职老师",
		'3' : "外聘",
		'4' : "固定工资",
		'5' : "机构老师",
		'6' : "公校老师",
		'7' : "其他在职人士",
		'8' : "在校学生"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8"
	},

		//未设置
		V_0:0,
		//高校生
		V_1:1,
		//在职老师
		V_2:2,
		//外聘
		V_3:3,
		//固定工资
		V_4:4,
		//机构老师
		V_5:5,
		//公校老师
		V_6:6,
		//其他在职人士
		V_7:7,
		//在校学生
		V_8:8,

		//未设置
		S_0:"0",
		//高校生
		S_1:"1",
		//在职老师
		S_2:"2",
		//外聘
		S_3:"3",
		//固定工资
		S_4:"4",
		//机构老师
		S_5:"5",
		//公校老师
		S_6:"6",
		//其他在职人士
		S_7:"7",
		//在校学生
		S_8:"8"


},

is_auto_set_type_flag : {
	desc_map : {
		'0' : "系统自动更新",
		'1' : "手动修改"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//系统自动更新
		V_0:0,
		//手动修改
		V_1:1,

		//系统自动更新
		S_0:"0",
		//手动修改
		S_1:"1"


},

is_freeze : {
	desc_map : {
		'0' : "未设置",
		'1' : "冻结",
		'2' : "解冻"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未设置
		V_0:0,
		//冻结
		V_1:1,
		//解冻
		V_2:2,

		//未设置
		S_0:"0",
		//冻结
		S_1:"1",
		//解冻
		S_2:"2"


},

is_invoice : {
	desc_map : {
		'0' : "不需要",
		'2' : "需要"
	},
	simple_desc_map: {
		'0' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '2':  "2"
	},

		//不需要
		V_0:0,
		//需要
		V_2:2,

		//不需要
		S_0:"0",
		//需要
		S_2:"2"


},

is_test : {
	desc_map : {
		'0' : "不是",
		'1' : "是"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//不是
		V_0:0,
		//是
		V_1:1,

		//不是
		S_0:"0",
		//是
		S_1:"1"


},

is_top : {
	desc_map : {
		'1' : "1",
		'2' : "2",
		'3' : "3",
		'4' : "4",
		'5' : "5",
		'6' : "6"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//1
		V_1:1,
		//2
		V_2:2,
		//3
		V_3:3,
		//4
		V_4:4,
		//5
		V_5:5,
		//6
		V_6:6,

		//1
		S_1:"1",
		//2
		S_2:"2",
		//3
		S_3:"3",
		//4
		S_4:"4",
		//5
		S_5:"5",
		//6
		S_6:"6"


},

is_warning_flag : {
	desc_map : {
		'0' : "无",
		'1' : "预警中",
		'2' : "已解决"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//无
		V_0:0,
		//预警中
		V_1:1,
		//已解决
		V_2:2,

		//无
		S_0:"0",
		//预警中
		S_1:"1",
		//已解决
		S_2:"2"


},

jw_test_lesson_status : {
	desc_map : {
		'0' : "未设置",
		'1' : "完成",
		'2' : "挂起",
		'3' : "退回"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未设置
		V_0:0,
		//完成
		V_1:1,
		//挂起
		V_2:2,
		//退回
		V_3:3,

		//未设置
		S_0:"0",
		//完成
		S_1:"1",
		//挂起
		S_2:"2",
		//退回
		S_3:"3"


},

lecture_appointment_origin : {
	desc_map : {
		'0' : "未设置",
		'1' : "自有渠道",
		'2' : "孔春莉",
		'3' : "杜琼",
		'4' : "周钦钦",
		'5' : "韩嘉亮",
		'6' : "黄汉玺",
		'7' : "段盛娟",
		'8' : "王海逻",
		'9' : "赵力红",
		'10' : "张现松",
		'11' : "张杰",
		'12' : "田香月",
		'13' : "孟令鑫",
		'14' : "任辉辉",
		'15' : "万里",
		'16' : "吴满",
		'17' : "李稹",
		'18' : "付悦",
		'19' : "卓媛容",
		'20' : "刘佳钰",
		'21' : "廖祝佳",
		'22' : "张敏",
		'23' : "韩希智",
		'24' : "华理专区"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'16' : "",
		'17' : "",
		'18' : "",
		'19' : "",
		'20' : "",
		'21' : "",
		'22' : "",
		'23' : "",
		'24' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"74750" : 2,
		"59163" : 3,
		"58775" : 4,
		"59281" : 5,
		"6" : 6,
		"100671" : 7,
		"107326" : 8,
		"71729" : 9,
		"64086" : 10,
		"109445" : 11,
		"69318" : 12,
		"100655" : 13,
		"102588" : 14,
		"77093" : 15,
		"133751" : 16,
		"75565" : 17,
		"74223" : 18,
		"75277" : 19,
		"102777" : 20,
		"134254" : 21,
		"64501" : 22,
		"134257" : 23,
		"24" : 24
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "74750",
		 '3':  "59163",
		 '4':  "58775",
		 '5':  "59281",
		 '6':  "6",
		 '7':  "100671",
		 '8':  "107326",
		 '9':  "71729",
		 '10':  "64086",
		 '11':  "109445",
		 '12':  "69318",
		 '13':  "100655",
		 '14':  "102588",
		 '15':  "77093",
		 '16':  "133751",
		 '17':  "75565",
		 '18':  "74223",
		 '19':  "75277",
		 '20':  "102777",
		 '21':  "134254",
		 '22':  "64501",
		 '23':  "134257",
		 '24':  "24"
	},

		//未设置
		V_0:0,
		//自有渠道
		V_1:1,
		//孔春莉
		V_74750:2,
		//杜琼
		V_59163:3,
		//周钦钦
		V_58775:4,
		//韩嘉亮
		V_59281:5,
		//黄汉玺
		V_6:6,
		//段盛娟
		V_100671:7,
		//王海逻
		V_107326:8,
		//赵力红
		V_71729:9,
		//张现松
		V_64086:10,
		//张杰
		V_109445:11,
		//田香月
		V_69318:12,
		//孟令鑫
		V_100655:13,
		//任辉辉
		V_102588:14,
		//万里
		V_77093:15,
		//吴满
		V_133751:16,
		//李稹
		V_75565:17,
		//付悦
		V_74223:18,
		//卓媛容
		V_75277:19,
		//刘佳钰
		V_102777:20,
		//廖祝佳
		V_134254:21,
		//张敏
		V_64501:22,
		//韩希智
		V_134257:23,
		//华理专区
		V_24:24,

		//未设置
		S_0:"0",
		//自有渠道
		S_1:"1",
		//孔春莉
		S_74750:"74750",
		//杜琼
		S_59163:"59163",
		//周钦钦
		S_58775:"58775",
		//韩嘉亮
		S_59281:"59281",
		//黄汉玺
		S_6:"6",
		//段盛娟
		S_100671:"100671",
		//王海逻
		S_107326:"107326",
		//赵力红
		S_71729:"71729",
		//张现松
		S_64086:"64086",
		//张杰
		S_109445:"109445",
		//田香月
		S_69318:"69318",
		//孟令鑫
		S_100655:"100655",
		//任辉辉
		S_102588:"102588",
		//万里
		S_77093:"77093",
		//吴满
		S_133751:"133751",
		//李稹
		S_75565:"75565",
		//付悦
		S_74223:"74223",
		//卓媛容
		S_75277:"75277",
		//刘佳钰
		S_102777:"102777",
		//廖祝佳
		S_134254:"134254",
		//张敏
		S_64501:"64501",
		//韩希智
		S_134257:"134257",
		//华理专区
		S_24:"24"


},

lecture_appointment_status : {
	desc_map : {
		'0' : "未设置",
		'1' : "电话已通知",
		'2' : "短信已通知"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未设置
		V_0:0,
		//电话已通知
		V_1:1,
		//短信已通知
		V_2:2,

		//未设置
		S_0:"0",
		//电话已通知
		S_1:"1",
		//短信已通知
		S_2:"2"


},

lecture_revisit_type : {
	desc_map : {
		'0' : "未联系",
		'1' : "未接通",
		'2' : "待跟进",
		'3' : "无意向",
		'4' : "已预约"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//未联系
		V_0:0,
		//未接通
		V_1:1,
		//待跟进
		V_2:2,
		//无意向
		V_3:3,
		//已预约
		V_4:4,

		//未联系
		S_0:"0",
		//未接通
		S_1:"1",
		//待跟进
		S_2:"2",
		//无意向
		S_3:"3",
		//已预约
		S_4:"4"


},

lesson_cancel_reason_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "调课-家长调课",
		'2' : "调课-老师调课",
		'3' : "调课-设备原因",
		'4' : "调课-网络原因",
		'11' : "请假-学生请假",
		'12' : "请假-老师请假",
		'13' : "请假-设备原因",
		'14' : "请假-网络原因",
		'20' : "学生旷课",
		'21' : "老师旷课",
		'22' : "教学事故"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'20' : "",
		'21' : "",
		'22' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"20" : 20,
		"21" : 21,
		"22" : 22
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '20':  "20",
		 '21':  "21",
		 '22':  "22"
	},

		//未设置
		V_0:0,
		//调课-家长调课
		V_1:1,
		//调课-老师调课
		V_2:2,
		//调课-设备原因
		V_3:3,
		//调课-网络原因
		V_4:4,
		//请假-学生请假
		V_11:11,
		//请假-老师请假
		V_12:12,
		//请假-设备原因
		V_13:13,
		//请假-网络原因
		V_14:14,
		//学生旷课
		V_20:20,
		//老师旷课
		V_21:21,
		//教学事故
		V_22:22,

		//未设置
		S_0:"0",
		//调课-家长调课
		S_1:"1",
		//调课-老师调课
		S_2:"2",
		//调课-设备原因
		S_3:"3",
		//调课-网络原因
		S_4:"4",
		//请假-学生请假
		S_11:"11",
		//请假-老师请假
		S_12:"12",
		//请假-设备原因
		S_13:"13",
		//请假-网络原因
		S_14:"14",
		//学生旷课
		S_20:"20",
		//老师旷课
		S_21:"21",
		//教学事故
		S_22:"22"


},

lesson_cancel_time_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "4小时内",
		'2' : "4小时外"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未设置
		V_0:0,
		//4小时内
		V_1:1,
		//4小时外
		V_2:2,

		//未设置
		S_0:"0",
		//4小时内
		S_1:"1",
		//4小时外
		S_2:"2"


},

lesson_count_level : {
	desc_map : {
		'1' : "0-9",
		'2' : "10-29",
		'3' : "30-49",
		'4' : "50-69",
		'5' : "70-99",
		'6' : "100-119",
		'7' : ">=120"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//0-9
		V_1:1,
		//10-29
		V_2:2,
		//30-49
		V_3:3,
		//50-69
		V_4:4,
		//70-99
		V_5:5,
		//100-119
		V_6:6,
		//>=120
		V_7:7,

		//0-9
		S_1:"1",
		//10-29
		S_2:"2",
		//30-49
		S_3:"3",
		//50-69
		S_4:"4",
		//70-99
		S_5:"5",
		//100-119
		S_6:"6",
		//>=120
		S_7:"7"


},

lesson_deduct : {
	desc_map : {
		'1' : "老师上课迟到",
		'2' : "学生提交作业超时未评价",
		'3' : "老师未提前4小时更换上课时间",
		'4' : "老师超时评价学生",
		'5' : "老师课前未上传学生讲义"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"deduct_come_late" : 1,
		"deduct_check_homework" : 2,
		"deduct_change_class" : 3,
		"deduct_rate_student" : 4,
		"deduct_upload_cw" : 5
	},
	v2s_map:{
		 '1':  "deduct_come_late",
		 '2':  "deduct_check_homework",
		 '3':  "deduct_change_class",
		 '4':  "deduct_rate_student",
		 '5':  "deduct_upload_cw"
	},

		//老师上课迟到
		V_DEDUCT_COME_LATE:1,
		//学生提交作业超时未评价
		V_DEDUCT_CHECK_HOMEWORK:2,
		//老师未提前4小时更换上课时间
		V_DEDUCT_CHANGE_CLASS:3,
		//老师超时评价学生
		V_DEDUCT_RATE_STUDENT:4,
		//老师课前未上传学生讲义
		V_DEDUCT_UPLOAD_CW:5,

		//老师上课迟到
		S_DEDUCT_COME_LATE:"deduct_come_late",
		//学生提交作业超时未评价
		S_DEDUCT_CHECK_HOMEWORK:"deduct_check_homework",
		//老师未提前4小时更换上课时间
		S_DEDUCT_CHANGE_CLASS:"deduct_change_class",
		//老师超时评价学生
		S_DEDUCT_RATE_STUDENT:"deduct_rate_student",
		//老师课前未上传学生讲义
		S_DEDUCT_UPLOAD_CW:"deduct_upload_cw"


},

lesson_error : {
	desc_map : {
		'1' : "学生听不到老师声音",
		'2' : "老师听不到学生声音",
		'3' : "学生卡在加载语音服务",
		'4' : "老师卡在加载语音服务",
		'5' : "学生卡在加载白板",
		'6' : "老师卡在加载白板",
		'7' : "学生白板中图片无法显示",
		'8' : "老师白板中图片无法显示",
		'9' : "进出白板次数过多",
		'10' : "网络错误1001",
		'11' : "声音卡顿",
		'12' : "老师无法加载讲义",
		'13' : "学生无法加载讲义",
		'14' : "白板中出现遗留或莫名图片划线"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14"
	},

		//学生听不到老师声音
		V_1:1,
		//老师听不到学生声音
		V_2:2,
		//学生卡在加载语音服务
		V_3:3,
		//老师卡在加载语音服务
		V_4:4,
		//学生卡在加载白板
		V_5:5,
		//老师卡在加载白板
		V_6:6,
		//学生白板中图片无法显示
		V_7:7,
		//老师白板中图片无法显示
		V_8:8,
		//进出白板次数过多
		V_9:9,
		//网络错误1001
		V_10:10,
		//声音卡顿
		V_11:11,
		//老师无法加载讲义
		V_12:12,
		//学生无法加载讲义
		V_13:13,
		//白板中出现遗留或莫名图片划线
		V_14:14,

		//学生听不到老师声音
		S_1:"1",
		//老师听不到学生声音
		S_2:"2",
		//学生卡在加载语音服务
		S_3:"3",
		//老师卡在加载语音服务
		S_4:"4",
		//学生卡在加载白板
		S_5:"5",
		//老师卡在加载白板
		S_6:"6",
		//学生白板中图片无法显示
		S_7:"7",
		//老师白板中图片无法显示
		S_8:"8",
		//进出白板次数过多
		S_9:"9",
		//网络错误1001
		S_10:"10",
		//声音卡顿
		S_11:"11",
		//老师无法加载讲义
		S_12:"12",
		//学生无法加载讲义
		S_13:"13",
		//白板中出现遗留或莫名图片划线
		S_14:"14"


},

lesson_grade_type : {
	desc_map : {
		'0' : "学生年级",
		'1' : "课程包年级"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//学生年级
		V_0:0,
		//课程包年级
		V_1:1,

		//学生年级
		S_0:"0",
		//课程包年级
		S_1:"1"


},

lesson_status : {
	desc_map : {
		'0' : "未开始",
		'1' : "进行中",
		'2' : "已结束",
		'3' : "课程终结或取消"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"no_start" : 0,
		"start" : 1,
		"end" : 2,
		"course_finish" : 3
	},
	v2s_map:{
		 '0':  "no_start",
		 '1':  "start",
		 '2':  "end",
		 '3':  "course_finish"
	},

		//未开始
		V_NO_START:0,
		//进行中
		V_START:1,
		//已结束
		V_END:2,
		//课程终结或取消
		V_COURSE_FINISH:3,

		//未开始
		S_NO_START:"no_start",
		//进行中
		S_START:"start",
		//已结束
		S_END:"end",
		//课程终结或取消
		S_COURSE_FINISH:"course_finish"


},

lesson_sub_type : {
	desc_map : {
		'0' : "默认培训类型",
		'1' : "1对1常规课",
		'1001' : "普通公开课",
		'1002' : "普通公开课",
		'3001' : "小班课",
		'4001' : "机器人课程"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'1001' : "",
		'1002' : "",
		'3001' : "",
		'4001' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"1001" : 1001,
		"1002" : 1002,
		"3001" : 3001,
		"4001" : 4001
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '1001':  "1001",
		 '1002':  "1002",
		 '3001':  "3001",
		 '4001':  "4001"
	},

		//默认培训类型
		V_0:0,
		//1对1常规课
		V_1:1,
		//普通公开课
		V_1001:1001,
		//普通公开课
		V_1002:1002,
		//小班课
		V_3001:3001,
		//机器人课程
		V_4001:4001,

		//默认培训类型
		S_0:"0",
		//1对1常规课
		S_1:"1",
		//普通公开课
		S_1001:"1001",
		//普通公开课
		S_1002:"1002",
		//小班课
		S_3001:"3001",
		//机器人课程
		S_4001:"4001"


},

lesson_work_status : {
	desc_map : {
		'0' : "老师未上传",
		'1' : "学生未上传",
		'2' : "未批改",
		'3' : "已批改",
		'4' : "教研已评价",
		'5' : "助教已评价"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//老师未上传
		V_0:0,
		//学生未上传
		V_1:1,
		//未批改
		V_2:2,
		//已批改
		V_3:3,
		//教研已评价
		V_4:4,
		//助教已评价
		V_5:5,

		//老师未上传
		S_0:"0",
		//学生未上传
		S_1:"1",
		//未批改
		S_2:"2",
		//已批改
		S_3:"3",
		//教研已评价
		S_4:"4",
		//助教已评价
		S_5:"5"


},

level : {
	desc_map : {
		'0' : "C",
		'1' : "B",
		'2' : "A",
		'3' : "A+",
		'4' : "S"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"初级" : 0,
		"中级" : 1,
		"高级" : 2,
		"金牌" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "初级",
		 '1':  "中级",
		 '2':  "高级",
		 '3':  "金牌",
		 '4':  "4"
	},

		//C
		V_初级:0,
		//B
		V_中级:1,
		//A
		V_高级:2,
		//A+
		V_金牌:3,
		//S
		V_4:4,

		//C
		S_初级:"初级",
		//B
		S_中级:"中级",
		//A
		S_高级:"高级",
		//A+
		S_金牌:"金牌",
		//S
		S_4:"4"


},

limit_plan_lesson_type : {
	desc_map : {
		'0' : "未限制",
		'1' : "一周限排1节",
		'3' : "一周限排3节",
		'5' : "一周限排5节"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'3' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"3" : 3,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '3':  "3",
		 '5':  "5"
	},

		//未限制
		V_0:0,
		//一周限排1节
		V_1:1,
		//一周限排3节
		V_3:3,
		//一周限排5节
		V_5:5,

		//未限制
		S_0:"0",
		//一周限排1节
		S_1:"1",
		//一周限排3节
		S_3:"3",
		//一周限排5节
		S_5:"5"


},

main_department : {
	desc_map : {
		'0' : "未设置",
		'1' : "TSR事业部",
		'2' : "教学管理事业部",
		'3' : "SC",
		'4' : "市场部",
		'5' : "研发部",
		'6' : "财务部",
		'7' : "人事部"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//未设置
		V_0:0,
		//TSR事业部
		V_1:1,
		//教学管理事业部
		V_2:2,
		//SC
		V_3:3,
		//市场部
		V_4:4,
		//研发部
		V_5:5,
		//财务部
		V_6:6,
		//人事部
		V_7:7,

		//未设置
		S_0:"0",
		//TSR事业部
		S_1:"1",
		//教学管理事业部
		S_2:"2",
		//SC
		S_3:"3",
		//市场部
		S_4:"4",
		//研发部
		S_5:"5",
		//财务部
		S_6:"6",
		//人事部
		S_7:"7"


},

main_type : {
	desc_map : {
		'1' : "助教",
		'2' : "销售",
		'3' : "教务",
		'4' : "教研",
		'5' : "全职老师",
		'6' : "薪资运营"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//助教
		V_1:1,
		//销售
		V_2:2,
		//教务
		V_3:3,
		//教研
		V_4:4,
		//全职老师
		V_5:5,
		//薪资运营
		V_6:6,

		//助教
		S_1:"1",
		//销售
		S_2:"2",
		//教务
		S_3:"3",
		//教研
		S_4:"4",
		//全职老师
		S_5:"5",
		//薪资运营
		S_6:"6"


},

message_type : {
	desc_map : {
		'1001' : "提醒学生上课",
		'1002' : "订单支付",
		'1003' : "即将上课",
		'1004' : "今日测评",
		'1005' : "作业已批",
		'1006' : "测评已批",
		'1007' : "系统消息",
		'1008' : "收到消息",
		'1009' : "新增作业",
		'1010' : "礼品状态",
		'1011' : "测评开始",
		'1012' : "作业未完成",
		'1013' : "讲课视频完成",
		'1014' : "测评已批阅",
		'1015' : "视频生成",
		'1016' : "反馈报告",
		'2001' : "有课要上",
		'2002' : "批改pdf作业",
		'2003' : "批改测评",
		'2004' : "即将上课",
		'2005' : "上传讲义",
		'2006' : "上传作业",
		'2007' : "批改题库作业",
		'2008' : "上传试卷",
		'2009' : "批改试卷",
		'2010' : "系统消息",
		'2011' : "课堂反馈报告",
		'2012' : "1对1反馈报告未填写",
		'2013' : "1对1重新评价",
		'3001' : "学生未写作业",
		'3002' : "老师未批作业",
		'3003' : "到点未做测评",
		'3004' : "测评未批改",
		'3005' : "测评未tongguo",
		'4001' : "即将上课",
		'4002' : "已经下课",
		'4003' : "作业批改完成",
		'4004' : "测评批改完成",
		'4005' : "收到消息",
		'4006' : "生成订单",
		'4007' : "测评开始",
		'4008' : "作业未完成",
		'4009' : "讲课视频录制完成",
		'4010' : "测评已评价",
		'4011' : "升学头条",
		'4012' : "政策百科",
		'4013' : "视频生成",
		'4014' : "系统消息",
		'4015' : "新增作业"
	},
	simple_desc_map: {
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1004' : "",
		'1005' : "",
		'1006' : "",
		'1007' : "",
		'1008' : "",
		'1009' : "",
		'1010' : "",
		'1011' : "",
		'1012' : "",
		'1013' : "",
		'1014' : "",
		'1015' : "",
		'1016' : "",
		'2001' : "",
		'2002' : "",
		'2003' : "",
		'2004' : "",
		'2005' : "",
		'2006' : "",
		'2007' : "",
		'2008' : "",
		'2009' : "",
		'2010' : "",
		'2011' : "",
		'2012' : "",
		'2013' : "",
		'3001' : "",
		'3002' : "",
		'3003' : "",
		'3004' : "",
		'3005' : "",
		'4001' : "",
		'4002' : "",
		'4003' : "",
		'4004' : "",
		'4005' : "",
		'4006' : "",
		'4007' : "",
		'4008' : "",
		'4009' : "",
		'4010' : "",
		'4011' : "",
		'4012' : "",
		'4013' : "",
		'4014' : "",
		'4015' : ""
	},
	s2v_map:{
		"1001" : 1001,
		"1002" : 1002,
		"1003" : 1003,
		"1004" : 1004,
		"1005" : 1005,
		"1006" : 1006,
		"1007" : 1007,
		"1008" : 1008,
		"1009" : 1009,
		"1010" : 1010,
		"1011" : 1011,
		"1012" : 1012,
		"1013" : 1013,
		"1014" : 1014,
		"1015" : 1015,
		"1016" : 1016,
		"2001" : 2001,
		"2002" : 2002,
		"2003" : 2003,
		"2004" : 2004,
		"2005" : 2005,
		"2006" : 2006,
		"2007" : 2007,
		"2008" : 2008,
		"2009" : 2009,
		"2010" : 2010,
		"2011" : 2011,
		"2012" : 2012,
		"2013" : 2013,
		"3001" : 3001,
		"3002" : 3002,
		"3003" : 3003,
		"3004" : 3004,
		"3005" : 3005,
		"4001" : 4001,
		"4002" : 4002,
		"4003" : 4003,
		"4004" : 4004,
		"4005" : 4005,
		"4006" : 4006,
		"4007" : 4007,
		"4008" : 4008,
		"4009" : 4009,
		"4010" : 4010,
		"4011" : 4011,
		"4012" : 4012,
		"4013" : 4013,
		"4014" : 4014,
		"4015" : 4015
	},
	v2s_map:{
		 '1001':  "1001",
		 '1002':  "1002",
		 '1003':  "1003",
		 '1004':  "1004",
		 '1005':  "1005",
		 '1006':  "1006",
		 '1007':  "1007",
		 '1008':  "1008",
		 '1009':  "1009",
		 '1010':  "1010",
		 '1011':  "1011",
		 '1012':  "1012",
		 '1013':  "1013",
		 '1014':  "1014",
		 '1015':  "1015",
		 '1016':  "1016",
		 '2001':  "2001",
		 '2002':  "2002",
		 '2003':  "2003",
		 '2004':  "2004",
		 '2005':  "2005",
		 '2006':  "2006",
		 '2007':  "2007",
		 '2008':  "2008",
		 '2009':  "2009",
		 '2010':  "2010",
		 '2011':  "2011",
		 '2012':  "2012",
		 '2013':  "2013",
		 '3001':  "3001",
		 '3002':  "3002",
		 '3003':  "3003",
		 '3004':  "3004",
		 '3005':  "3005",
		 '4001':  "4001",
		 '4002':  "4002",
		 '4003':  "4003",
		 '4004':  "4004",
		 '4005':  "4005",
		 '4006':  "4006",
		 '4007':  "4007",
		 '4008':  "4008",
		 '4009':  "4009",
		 '4010':  "4010",
		 '4011':  "4011",
		 '4012':  "4012",
		 '4013':  "4013",
		 '4014':  "4014",
		 '4015':  "4015"
	},

		//提醒学生上课
		V_1001:1001,
		//订单支付
		V_1002:1002,
		//即将上课
		V_1003:1003,
		//今日测评
		V_1004:1004,
		//作业已批
		V_1005:1005,
		//测评已批
		V_1006:1006,
		//系统消息
		V_1007:1007,
		//收到消息
		V_1008:1008,
		//新增作业
		V_1009:1009,
		//礼品状态
		V_1010:1010,
		//测评开始
		V_1011:1011,
		//作业未完成
		V_1012:1012,
		//讲课视频完成
		V_1013:1013,
		//测评已批阅
		V_1014:1014,
		//视频生成
		V_1015:1015,
		//反馈报告
		V_1016:1016,
		//有课要上
		V_2001:2001,
		//批改pdf作业
		V_2002:2002,
		//批改测评
		V_2003:2003,
		//即将上课
		V_2004:2004,
		//上传讲义
		V_2005:2005,
		//上传作业
		V_2006:2006,
		//批改题库作业
		V_2007:2007,
		//上传试卷
		V_2008:2008,
		//批改试卷
		V_2009:2009,
		//系统消息
		V_2010:2010,
		//课堂反馈报告
		V_2011:2011,
		//1对1反馈报告未填写
		V_2012:2012,
		//1对1重新评价
		V_2013:2013,
		//学生未写作业
		V_3001:3001,
		//老师未批作业
		V_3002:3002,
		//到点未做测评
		V_3003:3003,
		//测评未批改
		V_3004:3004,
		//测评未tongguo
		V_3005:3005,
		//即将上课
		V_4001:4001,
		//已经下课
		V_4002:4002,
		//作业批改完成
		V_4003:4003,
		//测评批改完成
		V_4004:4004,
		//收到消息
		V_4005:4005,
		//生成订单
		V_4006:4006,
		//测评开始
		V_4007:4007,
		//作业未完成
		V_4008:4008,
		//讲课视频录制完成
		V_4009:4009,
		//测评已评价
		V_4010:4010,
		//升学头条
		V_4011:4011,
		//政策百科
		V_4012:4012,
		//视频生成
		V_4013:4013,
		//系统消息
		V_4014:4014,
		//新增作业
		V_4015:4015,

		//提醒学生上课
		S_1001:"1001",
		//订单支付
		S_1002:"1002",
		//即将上课
		S_1003:"1003",
		//今日测评
		S_1004:"1004",
		//作业已批
		S_1005:"1005",
		//测评已批
		S_1006:"1006",
		//系统消息
		S_1007:"1007",
		//收到消息
		S_1008:"1008",
		//新增作业
		S_1009:"1009",
		//礼品状态
		S_1010:"1010",
		//测评开始
		S_1011:"1011",
		//作业未完成
		S_1012:"1012",
		//讲课视频完成
		S_1013:"1013",
		//测评已批阅
		S_1014:"1014",
		//视频生成
		S_1015:"1015",
		//反馈报告
		S_1016:"1016",
		//有课要上
		S_2001:"2001",
		//批改pdf作业
		S_2002:"2002",
		//批改测评
		S_2003:"2003",
		//即将上课
		S_2004:"2004",
		//上传讲义
		S_2005:"2005",
		//上传作业
		S_2006:"2006",
		//批改题库作业
		S_2007:"2007",
		//上传试卷
		S_2008:"2008",
		//批改试卷
		S_2009:"2009",
		//系统消息
		S_2010:"2010",
		//课堂反馈报告
		S_2011:"2011",
		//1对1反馈报告未填写
		S_2012:"2012",
		//1对1重新评价
		S_2013:"2013",
		//学生未写作业
		S_3001:"3001",
		//老师未批作业
		S_3002:"3002",
		//到点未做测评
		S_3003:"3003",
		//测评未批改
		S_3004:"3004",
		//测评未tongguo
		S_3005:"3005",
		//即将上课
		S_4001:"4001",
		//已经下课
		S_4002:"4002",
		//作业批改完成
		S_4003:"4003",
		//测评批改完成
		S_4004:"4004",
		//收到消息
		S_4005:"4005",
		//生成订单
		S_4006:"4006",
		//测评开始
		S_4007:"4007",
		//作业未完成
		S_4008:"4008",
		//讲课视频录制完成
		S_4009:"4009",
		//测评已评价
		S_4010:"4010",
		//升学头条
		S_4011:"4011",
		//政策百科
		S_4012:"4012",
		//视频生成
		S_4013:"4013",
		//系统消息
		S_4014:"4014",
		//新增作业
		S_4015:"4015"


},

operation_satisfy_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "经常断线",
		'2' : "不清晰/无声",
		'3' : "课后回看问题",
		'4' : "白板书写贴图问题",
		'5' : "完成作业操作问题",
		'6' : "其他"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//未设置
		V_0:0,
		//经常断线
		V_1:1,
		//不清晰/无声
		V_2:2,
		//课后回看问题
		V_3:3,
		//白板书写贴图问题
		V_4:4,
		//完成作业操作问题
		V_5:5,
		//其他
		V_6:6,

		//未设置
		S_0:"0",
		//经常断线
		S_1:"1",
		//不清晰/无声
		S_2:"2",
		//课后回看问题
		S_3:"3",
		//白板书写贴图问题
		S_4:"4",
		//完成作业操作问题
		S_5:"5",
		//其他
		S_6:"6"


},

opt_type : {
	desc_map : {
		'0' : "get",
		'1' : "sel",
		'2' : "del",
		'3' : "add"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"get" : 0,
		"set" : 1,
		"del" : 2,
		"add" : 3
	},
	v2s_map:{
		 '0':  "get",
		 '1':  "set",
		 '2':  "del",
		 '3':  "add"
	},

		//get
		V_GET:0,
		//sel
		V_SET:1,
		//del
		V_DEL:2,
		//add
		V_ADD:3,

		//get
		S_GET:"get",
		//sel
		S_SET:"set",
		//del
		S_DEL:"del",
		//add
		S_ADD:"add"


},

order_price_type : {
	desc_map : {
		'20170101' : "17年1月调价",
		'20170701' : "17年7月调价"
	},
	simple_desc_map: {
		'20170101' : "",
		'20170701' : ""
	},
	s2v_map:{
		"20170101" : 20170101,
		"20170701" : 20170701
	},
	v2s_map:{
		 '20170101':  "20170101",
		 '20170701':  "20170701"
	},

		//17年1月调价
		V_20170101:20170101,
		//17年7月调价
		V_20170701:20170701,

		//17年1月调价
		S_20170101:"20170101",
		//17年7月调价
		S_20170701:"20170701"


},

order_promotion_type : {
	desc_map : {
		'0' : "无",
		'1' : "赠送课时",
		'2' : "打折"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//无
		V_0:0,
		//赠送课时
		V_1:1,
		//打折
		V_2:2,

		//无
		S_0:"0",
		//赠送课时
		S_1:"1",
		//打折
		S_2:"2"


},

origin_level : {
	desc_map : {
		'0' : "未设置",
		'1' : "S类",
		'2' : "A类",
		'3' : "B类",
		'4' : "C类",
		'90' : "T类",
		'100' : "Z类"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'90' : "",
		'100' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"90" : 90,
		"100" : 100
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '90':  "90",
		 '100':  "100"
	},

		//未设置
		V_0:0,
		//S类
		V_1:1,
		//A类
		V_2:2,
		//B类
		V_3:3,
		//C类
		V_4:4,
		//T类
		V_90:90,
		//Z类
		V_100:100,

		//未设置
		S_0:"0",
		//S类
		S_1:"1",
		//A类
		S_2:"2",
		//B类
		S_3:"3",
		//C类
		S_4:"4",
		//T类
		S_90:"90",
		//Z类
		S_100:"100"


},

package_type : {
	desc_map : {
		'1' : "1v1试听课",
		'2' : "1v1定制课",
		'3' : "1v1自选课",
		'1001' : "普通公开课",
		'2001' : "普通答疑课",
		'3001' : "普通小班课"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'1001' : "",
		'2001' : "",
		'3001' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"1001" : 1001,
		"2001" : 2001,
		"3001" : 3001
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '1001':  "1001",
		 '2001':  "2001",
		 '3001':  "3001"
	},

		//1v1试听课
		V_1:1,
		//1v1定制课
		V_2:2,
		//1v1自选课
		V_3:3,
		//普通公开课
		V_1001:1001,
		//普通答疑课
		V_2001:2001,
		//普通小班课
		V_3001:3001,

		//1v1试听课
		S_1:"1",
		//1v1定制课
		S_2:"2",
		//1v1自选课
		S_3:"3",
		//普通公开课
		S_1001:"1001",
		//普通答疑课
		S_2001:"2001",
		//普通小班课
		S_3001:"3001"


},

pad_type : {
	desc_map : {
		'0' : "电脑",
		'1' : "ipad",
		'2' : "安卓平板",
		'3' : "其它pad",
		'4' : "ipad+PC",
		'5' : "安卓+PC",
		'10' : "无设备"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'10' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"10" : 10
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '10':  "10"
	},

		//电脑
		V_0:0,
		//ipad
		V_1:1,
		//安卓平板
		V_2:2,
		//其它pad
		V_3:3,
		//ipad+PC
		V_4:4,
		//安卓+PC
		V_5:5,
		//无设备
		V_10:10,

		//电脑
		S_0:"0",
		//ipad
		S_1:"1",
		//安卓平板
		S_2:"2",
		//其它pad
		S_3:"3",
		//ipad+PC
		S_4:"4",
		//安卓+PC
		S_5:"5",
		//无设备
		S_10:"10"


},

performance : {
	desc_map : {
		'1' : "差",
		'2' : "较差",
		'3' : "一般",
		'4' : "较好",
		'5' : "优秀"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//差
		V_1:1,
		//较差
		V_2:2,
		//一般
		V_3:3,
		//较好
		V_4:4,
		//优秀
		V_5:5,

		//差
		S_1:"1",
		//较差
		S_2:"2",
		//一般
		S_3:"3",
		//较好
		S_4:"4",
		//优秀
		S_5:"5"


},

permission : {
	desc_map : {
		'0' : "无权限",
		'1' : "有权限"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//无权限
		V_0:0,
		//有权限
		V_1:1,

		//无权限
		S_0:"0",
		//有权限
		S_1:"1"


},

pic_time_type : {
	desc_map : {
		'1' : "永久",
		'2' : "一个月",
		'3' : "三个月",
		'4' : "半年",
		'5' : "一年"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//永久
		V_1:1,
		//一个月
		V_2:2,
		//三个月
		V_3:3,
		//半年
		V_4:4,
		//一年
		V_5:5,

		//永久
		S_1:"1",
		//一个月
		S_2:"2",
		//三个月
		S_3:"3",
		//半年
		S_4:"4",
		//一年
		S_5:"5"


},

pic_type : {
	desc_map : {
		'1' : "家长端图片",
		'2' : "学生端图片",
		'3' : "网页图片",
		'99' : "其他图片"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'99' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"99" : 99
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '99':  "99"
	},

		//家长端图片
		V_1:1,
		//学生端图片
		V_2:2,
		//网页图片
		V_3:3,
		//其他图片
		V_99:99,

		//家长端图片
		S_1:"1",
		//学生端图片
		S_2:"2",
		//网页图片
		S_3:"3",
		//其他图片
		S_99:"99"


},

pic_usage_type : {
	desc_map : {
		'101' : "小学图标",
		'102' : "初中图标",
		'103' : "广告闪图",
		'104' : "家长端轮播图",
		'201' : "学生端主页图标",
		'202' : "学生服饰",
		'203' : "学生头饰",
		'204' : "男老师服饰",
		'205' : "女老师服饰",
		'206' : "活动背景",
		'207' : "1v1课程图片",
		'208' : "主页轮播图",
		'209' : "推送消息图标",
		'210' : "商城轮播图",
		'211' : "公开课课程图片",
		'212' : "小班课课程图片",
		'301' : "网页轮播图",
		'9901' : "老师帮二维码",
		'9999' : "其他"
	},
	simple_desc_map: {
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'204' : "",
		'205' : "",
		'206' : "",
		'207' : "",
		'208' : "",
		'209' : "",
		'210' : "",
		'211' : "",
		'212' : "",
		'301' : "",
		'9901' : "",
		'9999' : ""
	},
	s2v_map:{
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"204" : 204,
		"205" : 205,
		"206" : 206,
		"207" : 207,
		"208" : 208,
		"209" : 209,
		"210" : 210,
		"211" : 211,
		"212" : 212,
		"301" : 301,
		"9901" : 9901,
		"9999" : 9999
	},
	v2s_map:{
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '204':  "204",
		 '205':  "205",
		 '206':  "206",
		 '207':  "207",
		 '208':  "208",
		 '209':  "209",
		 '210':  "210",
		 '211':  "211",
		 '212':  "212",
		 '301':  "301",
		 '9901':  "9901",
		 '9999':  "9999"
	},

		//小学图标
		V_101:101,
		//初中图标
		V_102:102,
		//广告闪图
		V_103:103,
		//家长端轮播图
		V_104:104,
		//学生端主页图标
		V_201:201,
		//学生服饰
		V_202:202,
		//学生头饰
		V_203:203,
		//男老师服饰
		V_204:204,
		//女老师服饰
		V_205:205,
		//活动背景
		V_206:206,
		//1v1课程图片
		V_207:207,
		//主页轮播图
		V_208:208,
		//推送消息图标
		V_209:209,
		//商城轮播图
		V_210:210,
		//公开课课程图片
		V_211:211,
		//小班课课程图片
		V_212:212,
		//网页轮播图
		V_301:301,
		//老师帮二维码
		V_9901:9901,
		//其他
		V_9999:9999,

		//小学图标
		S_101:"101",
		//初中图标
		S_102:"102",
		//广告闪图
		S_103:"103",
		//家长端轮播图
		S_104:"104",
		//学生端主页图标
		S_201:"201",
		//学生服饰
		S_202:"202",
		//学生头饰
		S_203:"203",
		//男老师服饰
		S_204:"204",
		//女老师服饰
		S_205:"205",
		//活动背景
		S_206:"206",
		//1v1课程图片
		S_207:"207",
		//主页轮播图
		S_208:"208",
		//推送消息图标
		S_209:"209",
		//商城轮播图
		S_210:"210",
		//公开课课程图片
		S_211:"211",
		//小班课课程图片
		S_212:"212",
		//网页轮播图
		S_301:"301",
		//老师帮二维码
		S_9901:"9901",
		//其他
		S_9999:"9999"


},

positive_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "正常转正",
		'2' : "提前转正",
		'3' : "申请延迟一个月",
		'4' : "延迟一个月"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//未设置
		V_0:0,
		//正常转正
		V_1:1,
		//提前转正
		V_2:2,
		//申请延迟一个月
		V_3:3,
		//延迟一个月
		V_4:4,

		//未设置
		S_0:"0",
		//正常转正
		S_1:"1",
		//提前转正
		S_2:"2",
		//申请延迟一个月
		S_3:"3",
		//延迟一个月
		S_4:"4"


},

post : {
	desc_map : {
		'0' : "未设置",
		'1' : "产品经理",
		'2' : "培训师",
		'3' : "设计师",
		'4' : "产品运营",
		'5' : "质检员",
		'6' : "教研老师",
		'7' : "全职老师",
		'8' : "专职老师"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8"
	},

		//未设置
		V_0:0,
		//产品经理
		V_1:1,
		//培训师
		V_2:2,
		//设计师
		V_3:3,
		//产品运营
		V_4:4,
		//质检员
		V_5:5,
		//教研老师
		V_6:6,
		//全职老师
		V_7:7,
		//专职老师
		V_8:8,

		//未设置
		S_0:"0",
		//产品经理
		S_1:"1",
		//培训师
		S_2:"2",
		//设计师
		S_3:"3",
		//产品运营
		S_4:"4",
		//质检员
		S_5:"5",
		//教研老师
		S_6:"6",
		//全职老师
		S_7:"7",
		//专职老师
		S_8:"8"


},

power : {
	desc_map : {
		'1' : "录入回访",
		'2' : "分配老师",
		'3' : "分配助教",
		'4' : "学员排课",
		'5' : "更改礼品状态",
		'6' : "新增合同",
		'7' : "合同退费",
		'8' : "更改合同状态",
		'9' : "更改退费状态",
		'10' : "录入备注信息",
		'11' : "提交分析报告",
		'12' : "修改学生信息",
		'13' : "设置课程内容",
		'14' : "试听排课",
		'15' : "测评分析",
		'16' : "强制更改金额",
		'20' : "查看合同金额",
		'21' : "查看统计金额",
		'201' : "教师管理",
		'202' : "助教管理",
		'203' : "查看员工绩效",
		'204' : "xx",
		'205' : "助教统计",
		'301' : "课堂监控",
		'401' : "预约管理",
		'402' : "约课管理",
		'410' : "预约管理-分配用户给指定销售",
		'501' : "用户管理",
		'502' : "角色管理",
		'503' : "权限管理",
		'504' : "商城管理",
		'505' : "工具箱－查学校",
		'506' : "消息发送统计",
		'601' : "题库编辑",
		'602' : "题库审核",
		'603' : "题库统计",
		'604' : "再审",
		'801' : "预约统计",
		'1021' : "财务审核",
		'999' : "测试功能",
		'1000' : "增加试听课",
		'1001' : "提交交接单",
		'1002' : "常规课表编辑",
		'1003' : "销售-赠送新例子配额",
		'1004' : "增加转介绍例子"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'16' : "",
		'20' : "",
		'21' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'204' : "",
		'205' : "",
		'301' : "",
		'401' : "",
		'402' : "",
		'410' : "",
		'501' : "",
		'502' : "",
		'503' : "",
		'504' : "",
		'505' : "",
		'506' : "",
		'601' : "",
		'602' : "",
		'603' : "",
		'604' : "",
		'801' : "",
		'1021' : "",
		'999' : "",
		'1000' : "",
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1004' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"add_contract" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"15" : 15,
		"16" : 16,
		"show_money" : 20,
		"tongji_show_money" : 21,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"204" : 204,
		"205" : 205,
		"lesson_monitor" : 301,
		"401" : 401,
		"402" : 402,
		"user_book_assign" : 410,
		"501" : 501,
		"502" : 502,
		"503" : 503,
		"504" : 504,
		"505" : 505,
		"506" : 506,
		"question_edit" : 601,
		"question_check" : 602,
		"question_tongji" : 603,
		"question_check2" : 604,
		"yuyue_tongji" : 801,
		"money_check" : 1021,
		"test" : 999,
		"add_test_lesson" : 1000,
		"post_stu_init_info" : 1001,
		"otp_common_config_new" : 1002,
		"seller_add_new_student" : 1003,
		"1004" : 1004
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "add_contract",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '15':  "15",
		 '16':  "16",
		 '20':  "show_money",
		 '21':  "tongji_show_money",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '204':  "204",
		 '205':  "205",
		 '301':  "lesson_monitor",
		 '401':  "401",
		 '402':  "402",
		 '410':  "user_book_assign",
		 '501':  "501",
		 '502':  "502",
		 '503':  "503",
		 '504':  "504",
		 '505':  "505",
		 '506':  "506",
		 '601':  "question_edit",
		 '602':  "question_check",
		 '603':  "question_tongji",
		 '604':  "question_check2",
		 '801':  "yuyue_tongji",
		 '1021':  "money_check",
		 '999':  "test",
		 '1000':  "add_test_lesson",
		 '1001':  "post_stu_init_info",
		 '1002':  "otp_common_config_new",
		 '1003':  "seller_add_new_student",
		 '1004':  "1004"
	},

		//录入回访
		V_1:1,
		//分配老师
		V_2:2,
		//分配助教
		V_3:3,
		//学员排课
		V_4:4,
		//更改礼品状态
		V_5:5,
		//新增合同
		V_ADD_CONTRACT:6,
		//合同退费
		V_7:7,
		//更改合同状态
		V_8:8,
		//更改退费状态
		V_9:9,
		//录入备注信息
		V_10:10,
		//提交分析报告
		V_11:11,
		//修改学生信息
		V_12:12,
		//设置课程内容
		V_13:13,
		//试听排课
		V_14:14,
		//测评分析
		V_15:15,
		//强制更改金额
		V_16:16,
		//查看合同金额
		V_SHOW_MONEY:20,
		//查看统计金额
		V_TONGJI_SHOW_MONEY:21,
		//教师管理
		V_201:201,
		//助教管理
		V_202:202,
		//查看员工绩效
		V_203:203,
		//xx
		V_204:204,
		//助教统计
		V_205:205,
		//课堂监控
		V_LESSON_MONITOR:301,
		//预约管理
		V_401:401,
		//约课管理
		V_402:402,
		//预约管理-分配用户给指定销售
		V_USER_BOOK_ASSIGN:410,
		//用户管理
		V_501:501,
		//角色管理
		V_502:502,
		//权限管理
		V_503:503,
		//商城管理
		V_504:504,
		//工具箱－查学校
		V_505:505,
		//消息发送统计
		V_506:506,
		//题库编辑
		V_QUESTION_EDIT:601,
		//题库审核
		V_QUESTION_CHECK:602,
		//题库统计
		V_QUESTION_TONGJI:603,
		//再审
		V_QUESTION_CHECK2:604,
		//预约统计
		V_YUYUE_TONGJI:801,
		//财务审核
		V_MONEY_CHECK:1021,
		//测试功能
		V_TEST:999,
		//增加试听课
		V_ADD_TEST_LESSON:1000,
		//提交交接单
		V_POST_STU_INIT_INFO:1001,
		//常规课表编辑
		V_OTP_COMMON_CONFIG_NEW:1002,
		//销售-赠送新例子配额
		V_SELLER_ADD_NEW_STUDENT:1003,
		//增加转介绍例子
		V_1004:1004,

		//录入回访
		S_1:"1",
		//分配老师
		S_2:"2",
		//分配助教
		S_3:"3",
		//学员排课
		S_4:"4",
		//更改礼品状态
		S_5:"5",
		//新增合同
		S_ADD_CONTRACT:"add_contract",
		//合同退费
		S_7:"7",
		//更改合同状态
		S_8:"8",
		//更改退费状态
		S_9:"9",
		//录入备注信息
		S_10:"10",
		//提交分析报告
		S_11:"11",
		//修改学生信息
		S_12:"12",
		//设置课程内容
		S_13:"13",
		//试听排课
		S_14:"14",
		//测评分析
		S_15:"15",
		//强制更改金额
		S_16:"16",
		//查看合同金额
		S_SHOW_MONEY:"show_money",
		//查看统计金额
		S_TONGJI_SHOW_MONEY:"tongji_show_money",
		//教师管理
		S_201:"201",
		//助教管理
		S_202:"202",
		//查看员工绩效
		S_203:"203",
		//xx
		S_204:"204",
		//助教统计
		S_205:"205",
		//课堂监控
		S_LESSON_MONITOR:"lesson_monitor",
		//预约管理
		S_401:"401",
		//约课管理
		S_402:"402",
		//预约管理-分配用户给指定销售
		S_USER_BOOK_ASSIGN:"user_book_assign",
		//用户管理
		S_501:"501",
		//角色管理
		S_502:"502",
		//权限管理
		S_503:"503",
		//商城管理
		S_504:"504",
		//工具箱－查学校
		S_505:"505",
		//消息发送统计
		S_506:"506",
		//题库编辑
		S_QUESTION_EDIT:"question_edit",
		//题库审核
		S_QUESTION_CHECK:"question_check",
		//题库统计
		S_QUESTION_TONGJI:"question_tongji",
		//再审
		S_QUESTION_CHECK2:"question_check2",
		//预约统计
		S_YUYUE_TONGJI:"yuyue_tongji",
		//财务审核
		S_MONEY_CHECK:"money_check",
		//测试功能
		S_TEST:"test",
		//增加试听课
		S_ADD_TEST_LESSON:"add_test_lesson",
		//提交交接单
		S_POST_STU_INIT_INFO:"post_stu_init_info",
		//常规课表编辑
		S_OTP_COMMON_CONFIG_NEW:"otp_common_config_new",
		//销售-赠送新例子配额
		S_SELLER_ADD_NEW_STUDENT:"seller_add_new_student",
		//增加转介绍例子
		S_1004:"1004"


},

praise : {
	desc_map : {
		'1001' : "准时上课",
		'1002' : "课堂表现",
		'1003' : "作业得A",
		'1004' : "作业得B",
		'1005' : "测试95-100",
		'1006' : "测试85-94",
		'1007' : "进入测评",
		'1008' : "取消兑换",
		'1009' : "上传头像",
		'1010' : "邀请好友注册",
		'1011' : "邀请好友买课",
		'1012' : "更新到新版本",
		'1013' : "查看讲义",
		'1014' : "查看视频",
		'1015' : "课前测试",
		'1016' : "评价老师",
		'1017' : "完成阶段小测",
		'1018' : "购课满10次",
		'1019' : "购课满30次",
		'1020' : "购课满50次",
		'1021' : "购课满70次",
		'1022' : "生日",
		'1023' : "淘米一日游",
		'1024' : "系统发放得普通题",
		'1025' : "系统发放得抢答题",
		'1026' : "系统发放得抽查题",
		'1027' : "老师每次给予的赞数",
		'1028' : "",
		'1029' : "购课赠送",
		'1030' : "家长绑定公众号赠送",
		'1099' : "后台添加",
		'2000' : "",
		'2001' : "兑换礼品",
		'2002' : "",
		'2003' : "退费扣赞"
	},
	simple_desc_map: {
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1004' : "",
		'1005' : "",
		'1006' : "",
		'1007' : "",
		'1008' : "",
		'1009' : "",
		'1010' : "",
		'1011' : "",
		'1012' : "",
		'1013' : "",
		'1014' : "",
		'1015' : "",
		'1016' : "",
		'1017' : "",
		'1018' : "",
		'1019' : "",
		'1020' : "",
		'1021' : "",
		'1022' : "",
		'1023' : "",
		'1024' : "",
		'1025' : "",
		'1026' : "",
		'1027' : "",
		'1028' : "",
		'1029' : "",
		'1030' : "",
		'1099' : "",
		'2000' : "",
		'2001' : "",
		'2002' : "",
		'2003' : ""
	},
	s2v_map:{
		"1001" : 1001,
		"1002" : 1002,
		"1003" : 1003,
		"1004" : 1004,
		"1005" : 1005,
		"1006" : 1006,
		"1007" : 1007,
		"1008" : 1008,
		"1009" : 1009,
		"1010" : 1010,
		"1011" : 1011,
		"1012" : 1012,
		"1013" : 1013,
		"1014" : 1014,
		"1015" : 1015,
		"1016" : 1016,
		"1017" : 1017,
		"1018" : 1018,
		"1019" : 1019,
		"1020" : 1020,
		"1021" : 1021,
		"1022" : 1022,
		"1023" : 1023,
		"1024" : 1024,
		"1025" : 1025,
		"1026" : 1026,
		"1027" : 1027,
		"1028" : 1028,
		"1029" : 1029,
		"1030" : 1030,
		"1099" : 1099,
		"2000" : 2000,
		"2001" : 2001,
		"2002" : 2002,
		"2003" : 2003
	},
	v2s_map:{
		 '1001':  "1001",
		 '1002':  "1002",
		 '1003':  "1003",
		 '1004':  "1004",
		 '1005':  "1005",
		 '1006':  "1006",
		 '1007':  "1007",
		 '1008':  "1008",
		 '1009':  "1009",
		 '1010':  "1010",
		 '1011':  "1011",
		 '1012':  "1012",
		 '1013':  "1013",
		 '1014':  "1014",
		 '1015':  "1015",
		 '1016':  "1016",
		 '1017':  "1017",
		 '1018':  "1018",
		 '1019':  "1019",
		 '1020':  "1020",
		 '1021':  "1021",
		 '1022':  "1022",
		 '1023':  "1023",
		 '1024':  "1024",
		 '1025':  "1025",
		 '1026':  "1026",
		 '1027':  "1027",
		 '1028':  "1028",
		 '1029':  "1029",
		 '1030':  "1030",
		 '1099':  "1099",
		 '2000':  "2000",
		 '2001':  "2001",
		 '2002':  "2002",
		 '2003':  "2003"
	},

		//准时上课
		V_1001:1001,
		//课堂表现
		V_1002:1002,
		//作业得A
		V_1003:1003,
		//作业得B
		V_1004:1004,
		//测试95-100
		V_1005:1005,
		//测试85-94
		V_1006:1006,
		//进入测评
		V_1007:1007,
		//取消兑换
		V_1008:1008,
		//上传头像
		V_1009:1009,
		//邀请好友注册
		V_1010:1010,
		//邀请好友买课
		V_1011:1011,
		//更新到新版本
		V_1012:1012,
		//查看讲义
		V_1013:1013,
		//查看视频
		V_1014:1014,
		//课前测试
		V_1015:1015,
		//评价老师
		V_1016:1016,
		//完成阶段小测
		V_1017:1017,
		//购课满10次
		V_1018:1018,
		//购课满30次
		V_1019:1019,
		//购课满50次
		V_1020:1020,
		//购课满70次
		V_1021:1021,
		//生日
		V_1022:1022,
		//淘米一日游
		V_1023:1023,
		//系统发放得普通题
		V_1024:1024,
		//系统发放得抢答题
		V_1025:1025,
		//系统发放得抽查题
		V_1026:1026,
		//老师每次给予的赞数
		V_1027:1027,
		//
		V_1028:1028,
		//购课赠送
		V_1029:1029,
		//家长绑定公众号赠送
		V_1030:1030,
		//后台添加
		V_1099:1099,
		//
		V_2000:2000,
		//兑换礼品
		V_2001:2001,
		//
		V_2002:2002,
		//退费扣赞
		V_2003:2003,

		//准时上课
		S_1001:"1001",
		//课堂表现
		S_1002:"1002",
		//作业得A
		S_1003:"1003",
		//作业得B
		S_1004:"1004",
		//测试95-100
		S_1005:"1005",
		//测试85-94
		S_1006:"1006",
		//进入测评
		S_1007:"1007",
		//取消兑换
		S_1008:"1008",
		//上传头像
		S_1009:"1009",
		//邀请好友注册
		S_1010:"1010",
		//邀请好友买课
		S_1011:"1011",
		//更新到新版本
		S_1012:"1012",
		//查看讲义
		S_1013:"1013",
		//查看视频
		S_1014:"1014",
		//课前测试
		S_1015:"1015",
		//评价老师
		S_1016:"1016",
		//完成阶段小测
		S_1017:"1017",
		//购课满10次
		S_1018:"1018",
		//购课满30次
		S_1019:"1019",
		//购课满50次
		S_1020:"1020",
		//购课满70次
		S_1021:"1021",
		//生日
		S_1022:"1022",
		//淘米一日游
		S_1023:"1023",
		//系统发放得普通题
		S_1024:"1024",
		//系统发放得抢答题
		S_1025:"1025",
		//系统发放得抽查题
		S_1026:"1026",
		//老师每次给予的赞数
		S_1027:"1027",
		//
		S_1028:"1028",
		//购课赠送
		S_1029:"1029",
		//家长绑定公众号赠送
		S_1030:"1030",
		//后台添加
		S_1099:"1099",
		//
		S_2000:"2000",
		//兑换礼品
		S_2001:"2001",
		//
		S_2002:"2002",
		//退费扣赞
		S_2003:"2003"


},

process_status : {
	desc_map : {
		'0' : "a,b",
		'1' : "a,b",
		'2' : "a,c,d",
		'3' : "a,f,g",
		'4' : "a,b,g",
		'5' : "a,e",
		'6' : "a,b"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//a,b
		V_0:0,
		//a,b
		V_1:1,
		//a,c,d
		V_2:2,
		//a,f,g
		V_3:3,
		//a,b,g
		V_4:4,
		//a,e
		V_5:5,
		//a,b
		V_6:6,

		//a,b
		S_0:"0",
		//a,b
		S_1:"1",
		//a,c,d
		S_2:"2",
		//a,f,g
		S_3:"3",
		//a,b,g
		S_4:"4",
		//a,e
		S_5:"5",
		//a,b
		S_6:"6"


},

push_num : {
	desc_map : {
		'0' : "普通推送",
		'1' : "上课推送",
		'2' : "pdf作业",
		'3' : "题库作业",
		'4' : "视频推送",
		'5' : "师批改作业",
		'6' : "订单支付",
		'7' : "反馈报告"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//普通推送
		V_0:0,
		//上课推送
		V_1:1,
		//pdf作业
		V_2:2,
		//题库作业
		V_3:3,
		//视频推送
		V_4:4,
		//师批改作业
		V_5:5,
		//订单支付
		V_6:6,
		//反馈报告
		V_7:7,

		//普通推送
		S_0:"0",
		//上课推送
		S_1:"1",
		//pdf作业
		S_2:"2",
		//题库作业
		S_3:"3",
		//视频推送
		S_4:"4",
		//师批改作业
		S_5:"5",
		//订单支付
		S_6:"6",
		//反馈报告
		S_7:"7"


},

push_status : {
	desc_map : {
		'0' : "未推送",
		'1' : "已推送"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//未推送
		V_0:0,
		//已推送
		V_1:1,

		//未推送
		S_0:"0",
		//已推送
		S_1:"1"


},

push_type : {
	desc_map : {
		'1001' : "PUSH_STUDENT_DAILY_LESSON",
		'1002' : "PUSH_STUDENT_NEW_ORDER",
		'1003' : "PUSH_STUDENT_LESSON_NOTICE",
		'1004' : "PUSH_STUDENT_DAILY_QUIZ",
		'1005' : "PUSH_STUDENT_HOMEWORK_CHECKED",
		'1006' : "PUSH_STUDENT_QUIZ_CHECKED",
		'1007' : "PUSH_STUDENT_SYSTEM_NOTICE",
		'1008' : "PUSH_STUDENT_NORMAL_NOTICE",
		'1009' : "PUSH_STUDENT_NEW_HOMEWORK",
		'1010' : "PUSH_STUDENT_GIFT_SENT",
		'2010' : "PUSH_TEACHER_SYSTEM_NOTICE"
	},
	simple_desc_map: {
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1004' : "",
		'1005' : "",
		'1006' : "",
		'1007' : "",
		'1008' : "",
		'1009' : "",
		'1010' : "",
		'2010' : ""
	},
	s2v_map:{
		"1001" : 1001,
		"1002" : 1002,
		"1003" : 1003,
		"1004" : 1004,
		"1005" : 1005,
		"1006" : 1006,
		"1007" : 1007,
		"1008" : 1008,
		"1009" : 1009,
		"1010" : 1010,
		"2010" : 2010
	},
	v2s_map:{
		 '1001':  "1001",
		 '1002':  "1002",
		 '1003':  "1003",
		 '1004':  "1004",
		 '1005':  "1005",
		 '1006':  "1006",
		 '1007':  "1007",
		 '1008':  "1008",
		 '1009':  "1009",
		 '1010':  "1010",
		 '2010':  "2010"
	},

		//PUSH_STUDENT_DAILY_LESSON
		V_1001:1001,
		//PUSH_STUDENT_NEW_ORDER
		V_1002:1002,
		//PUSH_STUDENT_LESSON_NOTICE
		V_1003:1003,
		//PUSH_STUDENT_DAILY_QUIZ
		V_1004:1004,
		//PUSH_STUDENT_HOMEWORK_CHECKED
		V_1005:1005,
		//PUSH_STUDENT_QUIZ_CHECKED
		V_1006:1006,
		//PUSH_STUDENT_SYSTEM_NOTICE
		V_1007:1007,
		//PUSH_STUDENT_NORMAL_NOTICE
		V_1008:1008,
		//PUSH_STUDENT_NEW_HOMEWORK
		V_1009:1009,
		//PUSH_STUDENT_GIFT_SENT
		V_1010:1010,
		//PUSH_TEACHER_SYSTEM_NOTICE
		V_2010:2010,

		//PUSH_STUDENT_DAILY_LESSON
		S_1001:"1001",
		//PUSH_STUDENT_NEW_ORDER
		S_1002:"1002",
		//PUSH_STUDENT_LESSON_NOTICE
		S_1003:"1003",
		//PUSH_STUDENT_DAILY_QUIZ
		S_1004:"1004",
		//PUSH_STUDENT_HOMEWORK_CHECKED
		S_1005:"1005",
		//PUSH_STUDENT_QUIZ_CHECKED
		S_1006:"1006",
		//PUSH_STUDENT_SYSTEM_NOTICE
		S_1007:"1007",
		//PUSH_STUDENT_NORMAL_NOTICE
		S_1008:"1008",
		//PUSH_STUDENT_NEW_HOMEWORK
		S_1009:"1009",
		//PUSH_STUDENT_GIFT_SENT
		S_1010:"1010",
		//PUSH_TEACHER_SYSTEM_NOTICE
		S_2010:"2010"


},

putonghua_is_correctly : {
	desc_map : {
		'0' : "未设置",
		'1' : "是",
		'2' : "否"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未设置
		V_0:0,
		//是
		V_1:1,
		//否
		V_2:2,

		//未设置
		S_0:"0",
		//是
		S_1:"1",
		//否
		S_2:"2"


},

qingjia : {
	desc_map : {
		'1' : "年假",
		'2' : "病假",
		'3' : "事假"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"year" : 1,
		"sick" : 2,
		"absence" : 3
	},
	v2s_map:{
		 '1':  "year",
		 '2':  "sick",
		 '3':  "absence"
	},

		//年假
		V_YEAR:1,
		//病假
		V_SICK:2,
		//事假
		V_ABSENCE:3,

		//年假
		S_YEAR:"year",
		//病假
		S_SICK:"sick",
		//事假
		S_ABSENCE:"absence"


},

qingjia_type : {
	desc_map : {
		'1' : "年假",
		'2' : "病假",
		'3' : "事假"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"year" : 1,
		"sick" : 2,
		"absence" : 3
	},
	v2s_map:{
		 '1':  "year",
		 '2':  "sick",
		 '3':  "absence"
	},

		//年假
		V_YEAR:1,
		//病假
		V_SICK:2,
		//事假
		V_ABSENCE:3,

		//年假
		S_YEAR:"year",
		//病假
		S_SICK:"sick",
		//事假
		S_ABSENCE:"absence"


},

question_check_flag : {
	desc_map : {
		'0' : "无",
		'1' : "提交审核",
		'2' : "一审通过",
		'3' : "一审不通过 扣10%",
		'4' : "一审不通过 扣50%",
		'5' : "一审不通过 扣100%",
		'6' : "一审不通过 不入库",
		'12' : "再审通过",
		'13' : "再审不通过 扣10%",
		'14' : "再审不通过 扣50%",
		'15' : "再审不通过 扣100%",
		'16' : "再审不通过 不入库"
	},
	simple_desc_map: {
		'0' : "无",
		'1' : "提交",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'16' : ""
	},
	s2v_map:{
		"nopost" : 0,
		"post" : 1,
		"pass" : 2,
		"nopass_10" : 3,
		"nopass_50" : 4,
		"nopass_100" : 5,
		"nopass_del" : 6,
		"pass2" : 12,
		"nopass2_10" : 13,
		"nopass2_50" : 14,
		"nopass2_100" : 15,
		"nopass2_del" : 16
	},
	v2s_map:{
		 '0':  "nopost",
		 '1':  "post",
		 '2':  "pass",
		 '3':  "nopass_10",
		 '4':  "nopass_50",
		 '5':  "nopass_100",
		 '6':  "nopass_del",
		 '12':  "pass2",
		 '13':  "nopass2_10",
		 '14':  "nopass2_50",
		 '15':  "nopass2_100",
		 '16':  "nopass2_del"
	},

		//无
		V_NOPOST:0,
		//提交审核
		V_POST:1,
		//一审通过
		V_PASS:2,
		//一审不通过 扣10%
		V_NOPASS_10:3,
		//一审不通过 扣50%
		V_NOPASS_50:4,
		//一审不通过 扣100%
		V_NOPASS_100:5,
		//一审不通过 不入库
		V_NOPASS_DEL:6,
		//再审通过
		V_PASS2:12,
		//再审不通过 扣10%
		V_NOPASS2_10:13,
		//再审不通过 扣50%
		V_NOPASS2_50:14,
		//再审不通过 扣100%
		V_NOPASS2_100:15,
		//再审不通过 不入库
		V_NOPASS2_DEL:16,

		//无
		S_NOPOST:"nopost",
		//提交审核
		S_POST:"post",
		//一审通过
		S_PASS:"pass",
		//一审不通过 扣10%
		S_NOPASS_10:"nopass_10",
		//一审不通过 扣50%
		S_NOPASS_50:"nopass_50",
		//一审不通过 扣100%
		S_NOPASS_100:"nopass_100",
		//一审不通过 不入库
		S_NOPASS_DEL:"nopass_del",
		//再审通过
		S_PASS2:"pass2",
		//再审不通过 扣10%
		S_NOPASS2_10:"nopass2_10",
		//再审不通过 扣50%
		S_NOPASS2_50:"nopass2_50",
		//再审不通过 扣100%
		S_NOPASS2_100:"nopass2_100",
		//再审不通过 不入库
		S_NOPASS2_DEL:"nopass2_del"


},

question_difficulty : {
	desc_map : {
		'1' : "基础",
		'2' : "中档",
		'3' : "困难"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//基础
		V_1:1,
		//中档
		V_2:2,
		//困难
		V_3:3,

		//基础
		S_1:"1",
		//中档
		S_2:"2",
		//困难
		S_3:"3"


},

question_grade : {
	desc_map : {
		'100' : "小学",
		'200' : "初中",
		'300' : "高中",
		'101' : "小一",
		'102' : "小二",
		'103' : "小三",
		'104' : "小四",
		'105' : "小五",
		'106' : "小六",
		'201' : "初一",
		'202' : "初二",
		'203' : "初三",
		'301' : "高一",
		'302' : "高二",
		'303' : "高三"
	},
	simple_desc_map: {
		'100' : "",
		'200' : "",
		'300' : "",
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'105' : "",
		'106' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'301' : "",
		'302' : "",
		'303' : ""
	},
	s2v_map:{
		"100" : 100,
		"200" : 200,
		"300" : 300,
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"105" : 105,
		"106" : 106,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"301" : 301,
		"302" : 302,
		"303" : 303
	},
	v2s_map:{
		 '100':  "100",
		 '200':  "200",
		 '300':  "300",
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '105':  "105",
		 '106':  "106",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '301':  "301",
		 '302':  "302",
		 '303':  "303"
	},

		//小学
		V_100:100,
		//初中
		V_200:200,
		//高中
		V_300:300,
		//小一
		V_101:101,
		//小二
		V_102:102,
		//小三
		V_103:103,
		//小四
		V_104:104,
		//小五
		V_105:105,
		//小六
		V_106:106,
		//初一
		V_201:201,
		//初二
		V_202:202,
		//初三
		V_203:203,
		//高一
		V_301:301,
		//高二
		V_302:302,
		//高三
		V_303:303,

		//小学
		S_100:"100",
		//初中
		S_200:"200",
		//高中
		S_300:"300",
		//小一
		S_101:"101",
		//小二
		S_102:"102",
		//小三
		S_103:"103",
		//小四
		S_104:"104",
		//小五
		S_105:"105",
		//小六
		S_106:"106",
		//初一
		S_201:"201",
		//初二
		S_202:"202",
		//初三
		S_203:"203",
		//高一
		S_301:"301",
		//高二
		S_302:"302",
		//高三
		S_303:"303"


},

question_type : {
	desc_map : {
		'1' : "选择",
		'2' : "填空",
		'3' : "问答",
		'4' : "知识点"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"select" : 1,
		"line" : 2,
		"text" : 3,
		"without_a" : 4
	},
	v2s_map:{
		 '1':  "select",
		 '2':  "line",
		 '3':  "text",
		 '4':  "without_a"
	},

		//选择
		V_SELECT:1,
		//填空
		V_LINE:2,
		//问答
		V_TEXT:3,
		//知识点
		V_WITHOUT_A:4,

		//选择
		S_SELECT:"select",
		//填空
		S_LINE:"line",
		//问答
		S_TEXT:"text",
		//知识点
		S_WITHOUT_A:"without_a"


},

record_type : {
	desc_map : {
		'1' : "反馈记录",
		'2' : "拒接学生记录",
		'3' : "排课限制记录",
		'4' : "冻结排课记录",
		'5' : "分配教务老师教务回访记录",
		'6' : "信息变更记录",
		'7' : "一周排课数变更记录",
		'8' : "试听课未正常上课之反馈",
		'9' : "模拟试听审核",
		'10' : "老师面试评价"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10"
	},

		//反馈记录
		V_1:1,
		//拒接学生记录
		V_2:2,
		//排课限制记录
		V_3:3,
		//冻结排课记录
		V_4:4,
		//分配教务老师教务回访记录
		V_5:5,
		//信息变更记录
		V_6:6,
		//一周排课数变更记录
		V_7:7,
		//试听课未正常上课之反馈
		V_8:8,
		//模拟试听审核
		V_9:9,
		//老师面试评价
		V_10:10,

		//反馈记录
		S_1:"1",
		//拒接学生记录
		S_2:"2",
		//排课限制记录
		S_3:"3",
		//冻结排课记录
		S_4:"4",
		//分配教务老师教务回访记录
		S_5:"5",
		//信息变更记录
		S_6:"6",
		//一周排课数变更记录
		S_7:"7",
		//试听课未正常上课之反馈
		S_8:"8",
		//模拟试听审核
		S_9:"9",
		//老师面试评价
		S_10:"10"


},

region_version : {
	desc_map : {
		'0' : "未设置",
		'1' : "人教五四新版",
		'2' : "人教五四版",
		'3' : "人教新版",
		'4' : "人教版",
		'5' : "冀教新版",
		'6' : "冀教版",
		'7' : "北京课改新版",
		'8' : "北京课改版",
		'9' : "北师大版",
		'10' : "华师大新版",
		'11' : "华师大版",
		'12' : "沪教版",
		'13' : "沪科新版",
		'14' : "沪科版",
		'15' : "浙教新版",
		'16' : "浙教版",
		'17' : "湘教新版",
		'18' : "湘教版",
		'19' : "苏科新版",
		'20' : "苏科版",
		'21' : "青岛版",
		'22' : "鲁教新版",
		'23' : "鲁教版",
		'24' : "外研版（江苏凤凰出版社）",
		'25' : "外研版（外语教学与研究出版社）",
		'26' : "语文出版社A版",
		'27' : "语文出版社S版",
		'28' : "粤教版",
		'29' : "苏教版",
		'30' : "山东版",
		'31' : "浙科版",
		'32' : "地理-中国版",
		'30001' : "英语-上海牛津",
		'30002' : "英语-译林牛津",
		'30003' : "英语-新世纪",
		'30004' : "英语-苏教版",
		'30005' : "英语-人教新版（精通版）",
		'30006' : "英语-灵通少儿英语",
		'30007' : "英语-人教新起点（一起）",
		'30008' : "英语-人教PEP（三起）",
		'30009' : "英语-PEP新起点（一起）",
		'30010' : "英语-外研新标准 （一起）",
		'30011' : "英语-外研新标准 （三起）",
		'30012' : "英语-闽教（三起）",
		'30013' : "英语-北师大（一起）",
		'30014' : "英语-北师大（三起）",
		'30015' : "英语-仁爱版",
		'30016' : "英语-鲁教版",
		'30017' : "英语-湘鲁版",
		'30018' : "英语-冀教版",
		'30019' : "英语-广州教科版",
		'30020' : "英语-闽教（三起）",
		'30021' : "英语-北京版",
		'30022' : "英语-清华大学版",
		'30023' : "英语-福建教育出版社",
		'30024' : "英语-青岛出版社",
		'30025' : "英语-科普版",
		'30026' : "英语-四川教育出版社",
		'30027' : "英语-重庆大学出版社",
		'30028' : "英语-青少年新概念",
		'30029' : "英语-成人版新概念",
		'30030' : "英语-3E",
		'30031' : "英语-全能五星",
		'30032' : "英语-剑桥小学英语",
		'30033' : "英语-香港朗文"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'16' : "",
		'17' : "",
		'18' : "",
		'19' : "",
		'20' : "",
		'21' : "",
		'22' : "",
		'23' : "",
		'24' : "",
		'25' : "",
		'26' : "",
		'27' : "",
		'28' : "",
		'29' : "",
		'30' : "",
		'31' : "",
		'32' : "",
		'30001' : "",
		'30002' : "",
		'30003' : "",
		'30004' : "",
		'30005' : "",
		'30006' : "",
		'30007' : "",
		'30008' : "",
		'30009' : "",
		'30010' : "",
		'30011' : "",
		'30012' : "",
		'30013' : "",
		'30014' : "",
		'30015' : "",
		'30016' : "",
		'30017' : "",
		'30018' : "",
		'30019' : "",
		'30020' : "",
		'30021' : "",
		'30022' : "",
		'30023' : "",
		'30024' : "",
		'30025' : "",
		'30026' : "",
		'30027' : "",
		'30028' : "",
		'30029' : "",
		'30030' : "",
		'30031' : "",
		'30032' : "",
		'30033' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"15" : 15,
		"16" : 16,
		"17" : 17,
		"18" : 18,
		"19" : 19,
		"20" : 20,
		"21" : 21,
		"22" : 22,
		"23" : 23,
		"24" : 24,
		"25" : 25,
		"26" : 26,
		"27" : 27,
		"28" : 28,
		"29" : 29,
		"30" : 30,
		"31" : 31,
		"32" : 32,
		"30001" : 30001,
		"30002" : 30002,
		"30003" : 30003,
		"30004" : 30004,
		"30005" : 30005,
		"30006" : 30006,
		"30007" : 30007,
		"30008" : 30008,
		"30009" : 30009,
		"30010" : 30010,
		"30011" : 30011,
		"30012" : 30012,
		"30013" : 30013,
		"30014" : 30014,
		"30015" : 30015,
		"30016" : 30016,
		"30017" : 30017,
		"30018" : 30018,
		"30019" : 30019,
		"30020" : 30020,
		"30021" : 30021,
		"30022" : 30022,
		"30023" : 30023,
		"30024" : 30024,
		"30025" : 30025,
		"30026" : 30026,
		"30027" : 30027,
		"30028" : 30028,
		"30029" : 30029,
		"30030" : 30030,
		"30031" : 30031,
		"30032" : 30032,
		"30033" : 30033
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '15':  "15",
		 '16':  "16",
		 '17':  "17",
		 '18':  "18",
		 '19':  "19",
		 '20':  "20",
		 '21':  "21",
		 '22':  "22",
		 '23':  "23",
		 '24':  "24",
		 '25':  "25",
		 '26':  "26",
		 '27':  "27",
		 '28':  "28",
		 '29':  "29",
		 '30':  "30",
		 '31':  "31",
		 '32':  "32",
		 '30001':  "30001",
		 '30002':  "30002",
		 '30003':  "30003",
		 '30004':  "30004",
		 '30005':  "30005",
		 '30006':  "30006",
		 '30007':  "30007",
		 '30008':  "30008",
		 '30009':  "30009",
		 '30010':  "30010",
		 '30011':  "30011",
		 '30012':  "30012",
		 '30013':  "30013",
		 '30014':  "30014",
		 '30015':  "30015",
		 '30016':  "30016",
		 '30017':  "30017",
		 '30018':  "30018",
		 '30019':  "30019",
		 '30020':  "30020",
		 '30021':  "30021",
		 '30022':  "30022",
		 '30023':  "30023",
		 '30024':  "30024",
		 '30025':  "30025",
		 '30026':  "30026",
		 '30027':  "30027",
		 '30028':  "30028",
		 '30029':  "30029",
		 '30030':  "30030",
		 '30031':  "30031",
		 '30032':  "30032",
		 '30033':  "30033"
	},

		//未设置
		V_0:0,
		//人教五四新版
		V_1:1,
		//人教五四版
		V_2:2,
		//人教新版
		V_3:3,
		//人教版
		V_4:4,
		//冀教新版
		V_5:5,
		//冀教版
		V_6:6,
		//北京课改新版
		V_7:7,
		//北京课改版
		V_8:8,
		//北师大版
		V_9:9,
		//华师大新版
		V_10:10,
		//华师大版
		V_11:11,
		//沪教版
		V_12:12,
		//沪科新版
		V_13:13,
		//沪科版
		V_14:14,
		//浙教新版
		V_15:15,
		//浙教版
		V_16:16,
		//湘教新版
		V_17:17,
		//湘教版
		V_18:18,
		//苏科新版
		V_19:19,
		//苏科版
		V_20:20,
		//青岛版
		V_21:21,
		//鲁教新版
		V_22:22,
		//鲁教版
		V_23:23,
		//外研版（江苏凤凰出版社）
		V_24:24,
		//外研版（外语教学与研究出版社）
		V_25:25,
		//语文出版社A版
		V_26:26,
		//语文出版社S版
		V_27:27,
		//粤教版
		V_28:28,
		//苏教版
		V_29:29,
		//山东版
		V_30:30,
		//浙科版
		V_31:31,
		//地理-中国版
		V_32:32,
		//英语-上海牛津
		V_30001:30001,
		//英语-译林牛津
		V_30002:30002,
		//英语-新世纪
		V_30003:30003,
		//英语-苏教版
		V_30004:30004,
		//英语-人教新版（精通版）
		V_30005:30005,
		//英语-灵通少儿英语
		V_30006:30006,
		//英语-人教新起点（一起）
		V_30007:30007,
		//英语-人教PEP（三起）
		V_30008:30008,
		//英语-PEP新起点（一起）
		V_30009:30009,
		//英语-外研新标准 （一起）
		V_30010:30010,
		//英语-外研新标准 （三起）
		V_30011:30011,
		//英语-闽教（三起）
		V_30012:30012,
		//英语-北师大（一起）
		V_30013:30013,
		//英语-北师大（三起）
		V_30014:30014,
		//英语-仁爱版
		V_30015:30015,
		//英语-鲁教版
		V_30016:30016,
		//英语-湘鲁版
		V_30017:30017,
		//英语-冀教版
		V_30018:30018,
		//英语-广州教科版
		V_30019:30019,
		//英语-闽教（三起）
		V_30020:30020,
		//英语-北京版
		V_30021:30021,
		//英语-清华大学版
		V_30022:30022,
		//英语-福建教育出版社
		V_30023:30023,
		//英语-青岛出版社
		V_30024:30024,
		//英语-科普版
		V_30025:30025,
		//英语-四川教育出版社
		V_30026:30026,
		//英语-重庆大学出版社
		V_30027:30027,
		//英语-青少年新概念
		V_30028:30028,
		//英语-成人版新概念
		V_30029:30029,
		//英语-3E
		V_30030:30030,
		//英语-全能五星
		V_30031:30031,
		//英语-剑桥小学英语
		V_30032:30032,
		//英语-香港朗文
		V_30033:30033,

		//未设置
		S_0:"0",
		//人教五四新版
		S_1:"1",
		//人教五四版
		S_2:"2",
		//人教新版
		S_3:"3",
		//人教版
		S_4:"4",
		//冀教新版
		S_5:"5",
		//冀教版
		S_6:"6",
		//北京课改新版
		S_7:"7",
		//北京课改版
		S_8:"8",
		//北师大版
		S_9:"9",
		//华师大新版
		S_10:"10",
		//华师大版
		S_11:"11",
		//沪教版
		S_12:"12",
		//沪科新版
		S_13:"13",
		//沪科版
		S_14:"14",
		//浙教新版
		S_15:"15",
		//浙教版
		S_16:"16",
		//湘教新版
		S_17:"17",
		//湘教版
		S_18:"18",
		//苏科新版
		S_19:"19",
		//苏科版
		S_20:"20",
		//青岛版
		S_21:"21",
		//鲁教新版
		S_22:"22",
		//鲁教版
		S_23:"23",
		//外研版（江苏凤凰出版社）
		S_24:"24",
		//外研版（外语教学与研究出版社）
		S_25:"25",
		//语文出版社A版
		S_26:"26",
		//语文出版社S版
		S_27:"27",
		//粤教版
		S_28:"28",
		//苏教版
		S_29:"29",
		//山东版
		S_30:"30",
		//浙科版
		S_31:"31",
		//地理-中国版
		S_32:"32",
		//英语-上海牛津
		S_30001:"30001",
		//英语-译林牛津
		S_30002:"30002",
		//英语-新世纪
		S_30003:"30003",
		//英语-苏教版
		S_30004:"30004",
		//英语-人教新版（精通版）
		S_30005:"30005",
		//英语-灵通少儿英语
		S_30006:"30006",
		//英语-人教新起点（一起）
		S_30007:"30007",
		//英语-人教PEP（三起）
		S_30008:"30008",
		//英语-PEP新起点（一起）
		S_30009:"30009",
		//英语-外研新标准 （一起）
		S_30010:"30010",
		//英语-外研新标准 （三起）
		S_30011:"30011",
		//英语-闽教（三起）
		S_30012:"30012",
		//英语-北师大（一起）
		S_30013:"30013",
		//英语-北师大（三起）
		S_30014:"30014",
		//英语-仁爱版
		S_30015:"30015",
		//英语-鲁教版
		S_30016:"30016",
		//英语-湘鲁版
		S_30017:"30017",
		//英语-冀教版
		S_30018:"30018",
		//英语-广州教科版
		S_30019:"30019",
		//英语-闽教（三起）
		S_30020:"30020",
		//英语-北京版
		S_30021:"30021",
		//英语-清华大学版
		S_30022:"30022",
		//英语-福建教育出版社
		S_30023:"30023",
		//英语-青岛出版社
		S_30024:"30024",
		//英语-科普版
		S_30025:"30025",
		//英语-四川教育出版社
		S_30026:"30026",
		//英语-重庆大学出版社
		S_30027:"30027",
		//英语-青少年新概念
		S_30028:"30028",
		//英语-成人版新概念
		S_30029:"30029",
		//英语-3E
		S_30030:"30030",
		//英语-全能五星
		S_30031:"30031",
		//英语-剑桥小学英语
		S_30032:"30032",
		//英语-香港朗文
		S_30033:"30033"


},

relation_ship : {
	desc_map : {
		'1' : "父亲",
		'2' : "母亲",
		'3' : "爷爷",
		'4' : "奶奶",
		'5' : "外公",
		'6' : "外婆",
		'7' : "其他"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//父亲
		V_1:1,
		//母亲
		V_2:2,
		//爷爷
		V_3:3,
		//奶奶
		V_4:4,
		//外公
		V_5:5,
		//外婆
		V_6:6,
		//其他
		V_7:7,

		//父亲
		S_1:"1",
		//母亲
		S_2:"2",
		//爷爷
		S_3:"3",
		//奶奶
		S_4:"4",
		//外公
		S_5:"5",
		//外婆
		S_6:"6",
		//其他
		S_7:"7"


},

renw_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "续费",
		'2' : "不续费",
		'3' : "联络或考虑"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未设置
		V_0:0,
		//续费
		V_1:1,
		//不续费
		V_2:2,
		//联络或考虑
		V_3:3,

		//未设置
		S_0:"0",
		//续费
		S_1:"1",
		//不续费
		S_2:"2",
		//联络或考虑
		S_3:"3"


},

residual : {
	desc_map : {
		'0' : "常规资源",
		'1' : "历史资源",
		'2' : "历史试听"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//常规资源
		V_0:0,
		//历史资源
		V_1:1,
		//历史试听
		V_2:2,

		//常规资源
		S_0:"0",
		//历史资源
		S_1:"1",
		//历史试听
		S_2:"2"


},

retrial : {
	desc_map : {
		'1' : "授课环境不佳",
		'2' : "授课内容错误",
		'3' : "知识点错误率高",
		'4' : "语言表达能力不佳",
		'5' : "课堂氛围低沉枯燥",
		'6' : "未通过多次提交",
		'7' : "无自我介绍(英语科目)",
		'8' : "解题错误",
		'9' : "普通话发音不标准",
		'10' : "英文发音不标准"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10"
	},

		//授课环境不佳
		V_1:1,
		//授课内容错误
		V_2:2,
		//知识点错误率高
		V_3:3,
		//语言表达能力不佳
		V_4:4,
		//课堂氛围低沉枯燥
		V_5:5,
		//未通过多次提交
		V_6:6,
		//无自我介绍(英语科目)
		V_7:7,
		//解题错误
		V_8:8,
		//普通话发音不标准
		V_9:9,
		//英文发音不标准
		V_10:10,

		//授课环境不佳
		S_1:"1",
		//授课内容错误
		S_2:"2",
		//知识点错误率高
		S_3:"3",
		//语言表达能力不佳
		S_4:"4",
		//课堂氛围低沉枯燥
		S_5:"5",
		//未通过多次提交
		S_6:"6",
		//无自我介绍(英语科目)
		S_7:"7",
		//解题错误
		S_8:"8",
		//普通话发音不标准
		S_9:"9",
		//英文发音不标准
		S_10:"10"


},

revisit_origin : {
	desc_map : {
		'1' : "微信",
		'2' : "电话",
		'3' : "其他"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//微信
		V_1:1,
		//电话
		V_2:2,
		//其他
		V_3:3,

		//微信
		S_1:"1",
		//电话
		S_2:"2",
		//其他
		S_3:"3"


},

revisit_person : {
	desc_map : {
		'0' : "爸爸",
		'1' : "妈妈",
		'2' : "孩子",
		'3' : "其他"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//爸爸
		V_0:0,
		//妈妈
		V_1:1,
		//孩子
		V_2:2,
		//其他
		V_3:3,

		//爸爸
		S_0:"0",
		//妈妈
		S_1:"1",
		//孩子
		S_2:"2",
		//其他
		S_3:"3"


},

revisit_type : {
	desc_map : {
		'0' : "学情回访",
		'1' : "首次回访",
		'2' : "月度回访",
		'3' : "其他回访",
		'10' : "系统"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'10' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"10" : 10
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '10':  "10"
	},

		//学情回访
		V_0:0,
		//首次回访
		V_1:1,
		//月度回访
		V_2:2,
		//其他回访
		V_3:3,
		//系统
		V_10:10,

		//学情回访
		S_0:"0",
		//首次回访
		S_1:"1",
		//月度回访
		S_2:"2",
		//其他回访
		S_3:"3",
		//系统
		S_10:"10"


},

reward_type : {
	desc_map : {
		'1' : "荣誉榜奖金",
		'2' : "试听课奖金",
		'3' : "90分钟课程补偿",
		'4' : "工资补偿",
		'5' : "试听培训奖金",
		'6' : "伯乐奖"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//荣誉榜奖金
		V_1:1,
		//试听课奖金
		V_2:2,
		//90分钟课程补偿
		V_3:3,
		//工资补偿
		V_4:4,
		//试听培训奖金
		V_5:5,
		//伯乐奖
		V_6:6,

		//荣誉榜奖金
		S_1:"1",
		//试听课奖金
		S_2:"2",
		//90分钟课程补偿
		S_3:"3",
		//工资补偿
		S_4:"4",
		//试听培训奖金
		S_5:"5",
		//伯乐奖
		S_6:"6"


},

role : {
	desc_map : {
		'1' : "学生",
		'2' : "老师",
		'3' : "助教",
		'4' : "家长"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"student" : 1,
		"teacher" : 2,
		"assistent" : 3,
		"parent" : 4
	},
	v2s_map:{
		 '1':  "student",
		 '2':  "teacher",
		 '3':  "assistent",
		 '4':  "parent"
	},

		//学生
		V_STUDENT:1,
		//老师
		V_TEACHER:2,
		//助教
		V_ASSISTENT:3,
		//家长
		V_PARENT:4,

		//学生
		S_STUDENT:"student",
		//老师
		S_TEACHER:"teacher",
		//助教
		S_ASSISTENT:"assistent",
		//家长
		S_PARENT:"parent"


},

school_score_change_flag : {
	desc_map : {
		'0' : "未设置",
		'1' : "提升",
		'2' : "不明显",
		'3' : "成绩倒退",
		'4' : "家长无法确定"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//未设置
		V_0:0,
		//提升
		V_1:1,
		//不明显
		V_2:2,
		//成绩倒退
		V_3:3,
		//家长无法确定
		V_4:4,

		//未设置
		S_0:"0",
		//提升
		S_1:"1",
		//不明显
		S_2:"2",
		//成绩倒退
		S_3:"3",
		//家长无法确定
		S_4:"4"


},

school_scores_type : {
	desc_map : {
		'1' : "零志愿",
		'2' : "名额分配",
		'3' : "普通高中",
		'4' : "中本贯通",
		'5' : "中职贯通",
		'6' : "最低投档线"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//零志愿
		V_1:1,
		//名额分配
		V_2:2,
		//普通高中
		V_3:3,
		//中本贯通
		V_4:4,
		//中职贯通
		V_5:5,
		//最低投档线
		V_6:6,

		//零志愿
		S_1:"1",
		//名额分配
		S_2:"2",
		//普通高中
		S_3:"3",
		//中本贯通
		S_4:"4",
		//中职贯通
		S_5:"5",
		//最低投档线
		S_6:"6"


},

school_work_change_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "学校课后补习",
		'2' : "转考艺校、艺考",
		'3' : "准备出国",
		'4' : "放假休息,旅游",
		'5' : "其他"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//未设置
		V_0:0,
		//学校课后补习
		V_1:1,
		//转考艺校、艺考
		V_2:2,
		//准备出国
		V_3:3,
		//放假休息,旅游
		V_4:4,
		//其他
		V_5:5,

		//未设置
		S_0:"0",
		//学校课后补习
		S_1:"1",
		//转考艺校、艺考
		S_2:"2",
		//准备出国
		S_3:"3",
		//放假休息,旅游
		S_4:"4",
		//其他
		S_5:"5"


},

seller_book_status : {
	desc_map : {
		'0' : "未回访",
		'1' : "无效资源",
		'2' : "未接通",
		'3' : "有效-意向A档",
		'4' : "有效-意向B档",
		'5' : "有效-意向C档"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//未回访
		V_0:0,
		//无效资源
		V_1:1,
		//未接通
		V_2:2,
		//有效-意向A档
		V_3:3,
		//有效-意向B档
		V_4:4,
		//有效-意向C档
		V_5:5,

		//未回访
		S_0:"0",
		//无效资源
		S_1:"1",
		//未接通
		S_2:"2",
		//有效-意向A档
		S_3:"3",
		//有效-意向B档
		S_4:"4",
		//有效-意向C档
		S_5:"5"


},

seller_level : {
	desc_map : {
		'0' : "未设置",
		'100' : "S1",
		'101' : "S2",
		'102' : "S3",
		'200' : "A1",
		'201' : "A2",
		'202' : "A3",
		'300' : "B1",
		'301' : "B2",
		'400' : "C1",
		'401' : "C2",
		'500' : "D1",
		'600' : "E1",
		'1000' : "test",
		'9000' : "TMK"
	},
	simple_desc_map: {
		'0' : "",
		'100' : "",
		'101' : "",
		'102' : "",
		'200' : "",
		'201' : "",
		'202' : "",
		'300' : "",
		'301' : "",
		'400' : "",
		'401' : "",
		'500' : "",
		'600' : "",
		'1000' : "",
		'9000' : ""
	},
	s2v_map:{
		"0" : 0,
		"100" : 100,
		"101" : 101,
		"102" : 102,
		"200" : 200,
		"201" : 201,
		"202" : 202,
		"300" : 300,
		"301" : 301,
		"400" : 400,
		"401" : 401,
		"500" : 500,
		"600" : 600,
		"1000" : 1000,
		"9000" : 9000
	},
	v2s_map:{
		 '0':  "0",
		 '100':  "100",
		 '101':  "101",
		 '102':  "102",
		 '200':  "200",
		 '201':  "201",
		 '202':  "202",
		 '300':  "300",
		 '301':  "301",
		 '400':  "400",
		 '401':  "401",
		 '500':  "500",
		 '600':  "600",
		 '1000':  "1000",
		 '9000':  "9000"
	},

		//未设置
		V_0:0,
		//S1
		V_100:100,
		//S2
		V_101:101,
		//S3
		V_102:102,
		//A1
		V_200:200,
		//A2
		V_201:201,
		//A3
		V_202:202,
		//B1
		V_300:300,
		//B2
		V_301:301,
		//C1
		V_400:400,
		//C2
		V_401:401,
		//D1
		V_500:500,
		//E1
		V_600:600,
		//test
		V_1000:1000,
		//TMK
		V_9000:9000,

		//未设置
		S_0:"0",
		//S1
		S_100:"100",
		//S2
		S_101:"101",
		//S3
		S_102:"102",
		//A1
		S_200:"200",
		//A2
		S_201:"201",
		//A3
		S_202:"202",
		//B1
		S_300:"300",
		//B2
		S_301:"301",
		//C1
		S_400:"400",
		//C2
		S_401:"401",
		//D1
		S_500:"500",
		//E1
		S_600:"600",
		//test
		S_1000:"1000",
		//TMK
		S_9000:"9000"


},

seller_new_count_type : {
	desc_map : {
		'1' : "后台管理员赠送",
		'2' : "每日赠送",
		'3' : "预约红榜",
		'4' : "电话时长红榜",
		'5' : "合同赠送"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"admin" : 1,
		"day" : 2,
		"top_require" : 3,
		"top_phone_time" : 4,
		"order_add" : 5
	},
	v2s_map:{
		 '1':  "admin",
		 '2':  "day",
		 '3':  "top_require",
		 '4':  "top_phone_time",
		 '5':  "order_add"
	},

		//后台管理员赠送
		V_ADMIN:1,
		//每日赠送
		V_DAY:2,
		//预约红榜
		V_TOP_REQUIRE:3,
		//电话时长红榜
		V_TOP_PHONE_TIME:4,
		//合同赠送
		V_ORDER_ADD:5,

		//后台管理员赠送
		S_ADMIN:"admin",
		//每日赠送
		S_DAY:"day",
		//预约红榜
		S_TOP_REQUIRE:"top_require",
		//电话时长红榜
		S_TOP_PHONE_TIME:"top_phone_time",
		//合同赠送
		S_ORDER_ADD:"order_add"


},

seller_order_money : {
	desc_map : {
		'201702' : "201702方案",
		'201703' : "201703方案",
		'201705' : "201705方案"
	},
	simple_desc_map: {
		'201702' : "",
		'201703' : "",
		'201705' : ""
	},
	s2v_map:{
		"201702" : 201702,
		"201703" : 201703,
		"201705" : 201705
	},
	v2s_map:{
		 '201702':  "201702",
		 '201703':  "201703",
		 '201705':  "201705"
	},

		//201702方案
		V_201702:201702,
		//201703方案
		V_201703:201703,
		//201705方案
		V_201705:201705,

		//201702方案
		S_201702:"201702",
		//201703方案
		S_201703:"201703",
		//201705方案
		S_201705:"201705"


},

seller_require_change_flag : {
	desc_map : {
		'0' : "正常",
		'1' : "请求中",
		'2' : "已处理",
		'3' : "已驳回"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//正常
		V_0:0,
		//请求中
		V_1:1,
		//已处理
		V_2:2,
		//已驳回
		V_3:3,

		//正常
		S_0:"0",
		//请求中
		S_1:"1",
		//已处理
		S_2:"2",
		//已驳回
		S_3:"3"


},

seller_require_change_type : {
	desc_map : {
		'0' : "未请求",
		'1' : "申请更换时间",
		'2' : "申请更换老师"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未请求
		V_0:0,
		//申请更换时间
		V_1:1,
		//申请更换老师
		V_2:2,

		//未请求
		S_0:"0",
		//申请更换时间
		S_1:"1",
		//申请更换老师
		S_2:"2"


},

seller_resource_type : {
	desc_map : {
		'0' : "常规资源",
		'1' : "历史资源",
		'2' : "历史试听"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//常规资源
		V_0:0,
		//历史资源
		V_1:1,
		//历史试听
		V_2:2,

		//常规资源
		S_0:"0",
		//历史资源
		S_1:"1",
		//历史试听
		S_2:"2"


},

seller_student_status : {
	desc_map : {
		'0' : "未回访",
		'1' : "无效资源",
		'2' : "未接通",
		'50' : "无效-公海/试听未签不出现",
		'60' : "结课无意向",
		'61' : "结课待跟进",
		'100' : "有效-意向A档",
		'101' : "有效-意向B档",
		'102' : "有效-意向C档",
		'103' : "有效-上课时间待定",
		'110' : "有效-预约驳回",
		'120' : "有效-课程取消",
		'200' : "预约-未排课",
		'210' : "已排课-未通知家长",
		'220' : "待开课-已通知家长",
		'290' : "已试听-待跟进",
		'300' : "已试听-未签-A档",
		'301' : "已试听-未签-B档",
		'302' : "已试听-未签-C档",
		'303' : "未试听-未签-A档",
		'304' : "未试听-未签-B档",
		'305' : "未试听-未签-C档",
		'420' : "签约-完成"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'50' : "",
		'60' : "",
		'61' : "",
		'100' : "",
		'101' : "",
		'102' : "",
		'103' : "",
		'110' : "",
		'120' : "",
		'200' : "",
		'210' : "",
		'220' : "",
		'290' : "",
		'300' : "",
		'301' : "",
		'302' : "",
		'303' : "",
		'304' : "",
		'305' : "",
		'420' : ""
	},
	s2v_map:{
		"NO_CALL" : 0,
		"1" : 1,
		"NO_CALL_PASS" : 2,
		"NO_PUBLISH" : 50,
		"60" : 60,
		"61" : 61,
		"100" : 100,
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"110" : 110,
		"120" : 120,
		"200" : 200,
		"210" : 210,
		"220" : 220,
		"290" : 290,
		"300" : 300,
		"301" : 301,
		"302" : 302,
		"303" : 303,
		"304" : 304,
		"305" : 305,
		"420" : 420
	},
	v2s_map:{
		 '0':  "NO_CALL",
		 '1':  "1",
		 '2':  "NO_CALL_PASS",
		 '50':  "NO_PUBLISH",
		 '60':  "60",
		 '61':  "61",
		 '100':  "100",
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '110':  "110",
		 '120':  "120",
		 '200':  "200",
		 '210':  "210",
		 '220':  "220",
		 '290':  "290",
		 '300':  "300",
		 '301':  "301",
		 '302':  "302",
		 '303':  "303",
		 '304':  "304",
		 '305':  "305",
		 '420':  "420"
	},

		//未回访
		V_NO_CALL:0,
		//无效资源
		V_1:1,
		//未接通
		V_NO_CALL_PASS:2,
		//无效-公海/试听未签不出现
		V_NO_PUBLISH:50,
		//结课无意向
		V_60:60,
		//结课待跟进
		V_61:61,
		//有效-意向A档
		V_100:100,
		//有效-意向B档
		V_101:101,
		//有效-意向C档
		V_102:102,
		//有效-上课时间待定
		V_103:103,
		//有效-预约驳回
		V_110:110,
		//有效-课程取消
		V_120:120,
		//预约-未排课
		V_200:200,
		//已排课-未通知家长
		V_210:210,
		//待开课-已通知家长
		V_220:220,
		//已试听-待跟进
		V_290:290,
		//已试听-未签-A档
		V_300:300,
		//已试听-未签-B档
		V_301:301,
		//已试听-未签-C档
		V_302:302,
		//未试听-未签-A档
		V_303:303,
		//未试听-未签-B档
		V_304:304,
		//未试听-未签-C档
		V_305:305,
		//签约-完成
		V_420:420,

		//未回访
		S_NO_CALL:"NO_CALL",
		//无效资源
		S_1:"1",
		//未接通
		S_NO_CALL_PASS:"NO_CALL_PASS",
		//无效-公海/试听未签不出现
		S_NO_PUBLISH:"NO_PUBLISH",
		//结课无意向
		S_60:"60",
		//结课待跟进
		S_61:"61",
		//有效-意向A档
		S_100:"100",
		//有效-意向B档
		S_101:"101",
		//有效-意向C档
		S_102:"102",
		//有效-上课时间待定
		S_103:"103",
		//有效-预约驳回
		S_110:"110",
		//有效-课程取消
		S_120:"120",
		//预约-未排课
		S_200:"200",
		//已排课-未通知家长
		S_210:"210",
		//待开课-已通知家长
		S_220:"220",
		//已试听-待跟进
		S_290:"290",
		//已试听-未签-A档
		S_300:"300",
		//已试听-未签-B档
		S_301:"301",
		//已试听-未签-C档
		S_302:"302",
		//未试听-未签-A档
		S_303:"303",
		//未试听-未签-B档
		S_304:"304",
		//未试听-未签-C档
		S_305:"305",
		//签约-完成
		S_420:"420"


},

seller_student_sub_status : {
	desc_map : {
		'0' : "无",
		'1001' : "无效-空号",
		'1002' : "无效-停机",
		'1003' : "无效-号码错误",
		'1004' : "无效-不接电话",
		'1005' : "无效-秒挂",
		'1006' : "无效-无意向",
		'1007' : "无效-没时间",
		'1008' : "无效-价格贵",
		'1009' : "无效-设备问题",
		'1010' : "无效-网络问题",
		'1011' : "无效-其他"
	},
	simple_desc_map: {
		'0' : "",
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1004' : "",
		'1005' : "",
		'1006' : "",
		'1007' : "",
		'1008' : "",
		'1009' : "",
		'1010' : "",
		'1011' : ""
	},
	s2v_map:{
		"0" : 0,
		"1001" : 1001,
		"1002" : 1002,
		"1003" : 1003,
		"1004" : 1004,
		"1005" : 1005,
		"1006" : 1006,
		"1007" : 1007,
		"1008" : 1008,
		"1009" : 1009,
		"1010" : 1010,
		"1011" : 1011
	},
	v2s_map:{
		 '0':  "0",
		 '1001':  "1001",
		 '1002':  "1002",
		 '1003':  "1003",
		 '1004':  "1004",
		 '1005':  "1005",
		 '1006':  "1006",
		 '1007':  "1007",
		 '1008':  "1008",
		 '1009':  "1009",
		 '1010':  "1010",
		 '1011':  "1011"
	},

		//无
		V_0:0,
		//无效-空号
		V_1001:1001,
		//无效-停机
		V_1002:1002,
		//无效-号码错误
		V_1003:1003,
		//无效-不接电话
		V_1004:1004,
		//无效-秒挂
		V_1005:1005,
		//无效-无意向
		V_1006:1006,
		//无效-没时间
		V_1007:1007,
		//无效-价格贵
		V_1008:1008,
		//无效-设备问题
		V_1009:1009,
		//无效-网络问题
		V_1010:1010,
		//无效-其他
		V_1011:1011,

		//无
		S_0:"0",
		//无效-空号
		S_1001:"1001",
		//无效-停机
		S_1002:"1002",
		//无效-号码错误
		S_1003:"1003",
		//无效-不接电话
		S_1004:"1004",
		//无效-秒挂
		S_1005:"1005",
		//无效-无意向
		S_1006:"1006",
		//无效-没时间
		S_1007:"1007",
		//无效-价格贵
		S_1008:"1008",
		//无效-设备问题
		S_1009:"1009",
		//无效-网络问题
		S_1010:"1010",
		//无效-其他
		S_1011:"1011"


},

seller_work_status : {
	desc_map : {
		'0' : "休息",
		'1' : "上班",
		'2' : "请假",
		'3' : "加班"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//休息
		V_0:0,
		//上班
		V_1:1,
		//请假
		V_2:2,
		//加班
		V_3:3,

		//休息
		S_0:"0",
		//上班
		S_1:"1",
		//请假
		S_2:"2",
		//加班
		S_3:"3"


},

send_gift : {
	desc_map : {
		'0' : "未兑换",
		'1' : "已兑换"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//未兑换
		V_0:0,
		//已兑换
		V_1:1,

		//未兑换
		S_0:"0",
		//已兑换
		S_1:"1"


},

set_boolean : {
	desc_map : {
		'0' : "未设置",
		'1' : "是",
		'2' : "否"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未设置
		V_0:0,
		//是
		V_1:1,
		//否
		V_2:2,

		//未设置
		S_0:"0",
		//是
		S_1:"1",
		//否
		S_2:"2"


},

sh_area : {
	desc_map : {
		'101' : "黄浦",
		'102' : "徐汇",
		'103' : "长宁",
		'104' : "静安",
		'105' : "普陀",
		'106' : "虹口",
		'107' : "杨浦",
		'108' : "闵行",
		'109' : "宝山",
		'111' : "嘉定",
		'112' : "浦东新区",
		'113' : "金山",
		'114' : "松江",
		'115' : "青浦",
		'116' : "奉贤",
		'117' : "崇明县",
		'118' : "闸北区"
	},
	simple_desc_map: {
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'105' : "",
		'106' : "",
		'107' : "",
		'108' : "",
		'109' : "",
		'111' : "",
		'112' : "",
		'113' : "",
		'114' : "",
		'115' : "",
		'116' : "",
		'117' : "",
		'118' : ""
	},
	s2v_map:{
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"105" : 105,
		"106" : 106,
		"107" : 107,
		"108" : 108,
		"109" : 109,
		"111" : 111,
		"112" : 112,
		"113" : 113,
		"114" : 114,
		"115" : 115,
		"116" : 116,
		"117" : 117,
		"118" : 118
	},
	v2s_map:{
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '105':  "105",
		 '106':  "106",
		 '107':  "107",
		 '108':  "108",
		 '109':  "109",
		 '111':  "111",
		 '112':  "112",
		 '113':  "113",
		 '114':  "114",
		 '115':  "115",
		 '116':  "116",
		 '117':  "117",
		 '118':  "118"
	},

		//黄浦
		V_101:101,
		//徐汇
		V_102:102,
		//长宁
		V_103:103,
		//静安
		V_104:104,
		//普陀
		V_105:105,
		//虹口
		V_106:106,
		//杨浦
		V_107:107,
		//闵行
		V_108:108,
		//宝山
		V_109:109,
		//嘉定
		V_111:111,
		//浦东新区
		V_112:112,
		//金山
		V_113:113,
		//松江
		V_114:114,
		//青浦
		V_115:115,
		//奉贤
		V_116:116,
		//崇明县
		V_117:117,
		//闸北区
		V_118:118,

		//黄浦
		S_101:"101",
		//徐汇
		S_102:"102",
		//长宁
		S_103:"103",
		//静安
		S_104:"104",
		//普陀
		S_105:"105",
		//虹口
		S_106:"106",
		//杨浦
		S_107:"107",
		//闵行
		S_108:"108",
		//宝山
		S_109:"109",
		//嘉定
		S_111:"111",
		//浦东新区
		S_112:"112",
		//金山
		S_113:"113",
		//松江
		S_114:"114",
		//青浦
		S_115:"115",
		//奉贤
		S_116:"116",
		//崇明县
		S_117:"117",
		//闸北区
		S_118:"118"


},

sh_page_grade : {
	desc_map : {
		'1' : "小升初",
		'2' : "中考"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//小升初
		V_1:1,
		//中考
		V_2:2,

		//小升初
		S_1:"1",
		//中考
		S_2:"2"


},

sms_type : {
	desc_map : {
		'7795923' : "用户注册验证码-old",
		'7771547' : "通用验证-old",
		'72765026' : "短信通知（价格调整）",
		'66515139' : "家长预约5-9",
		'63750218' : "预约完成4-28",
		'55565027' : "老师注册通知3-15",
		'51615035' : "老师注册通知",
		'51410003' : "老师签单奖励通知",
		'46725145' : "解除排课限制通知2-14",
		'46835164' : "限制老师排课通知2-14",
		'46785153' : "试听取消-不付工资2-14",
		'46880148' : "第一次支付成功2-14",
		'46800132' : "第二次支付成功2-14",
		'46675251' : "注册老师账号通知2-14",
		'46805178' : "晚8点 通知老师明天上课",
		'46750146' : "老师反馈通知2-14",
		'46670149' : "老师试讲可重申2-14",
		'46705122' : "老师视频不完整 2",
		'46375041' : "老师视频不完整",
		'46745131' : "老师试讲未通过2-14",
		'46790219' : "通知老师上传试讲2-14",
		'46660108' : "老师冻结通知2-14",
		'46720087' : "老师解冻通知2-14",
		'46865086' : "老师试讲通过2-14",
		'46680138' : "通知老师课程取消-付工资2-14",
		'46690154' : "通知明天上课2-14",
		'34775122' : "价格调整",
		'33865292' : "通知老师试听课程取消-不付工资",
		'34015213' : "老师试讲通过",
		'30110108' : "通知老师课程取消",
		'27725043' : "报名免费课程",
		'27315033' : "预约完成3",
		'18345084' : "通知明天上课",
		'11051022' : "合同确认，重置家长密码",
		'10671030' : "注册验证码",
		'10671029' : "通用验证",
		'10615821' : "早7点 通知家长1v1&小班上课",
		'11035096' : "早7点 通知家长试听上课",
		'10642098' : "晚8点 通知老师明天上课",
		'12755231' : "注册老师账号通知",
		'12040030' : "课件上传提醒",
		'11865003' : "第二次支付成功",
		'11275039' : "试听排课完成 ",
		'11295014' : "预约完成 ",
		'11565037' : "通知家长预约成功",
		'15960017' : "销售回访后通知家长",
		'16785465' : "通知家长预约成功2"
	},
	simple_desc_map: {
		'7795923' : "",
		'7771547' : "",
		'72765026' : "",
		'66515139' : "",
		'63750218' : "",
		'55565027' : "",
		'51615035' : "",
		'51410003' : "",
		'46725145' : "",
		'46835164' : "",
		'46785153' : "",
		'46880148' : "",
		'46800132' : "",
		'46675251' : "",
		'46805178' : "",
		'46750146' : "",
		'46670149' : "",
		'46705122' : "",
		'46375041' : "",
		'46745131' : "",
		'46790219' : "",
		'46660108' : "",
		'46720087' : "",
		'46865086' : "",
		'46680138' : "",
		'46690154' : "",
		'34775122' : "",
		'33865292' : "",
		'34015213' : "",
		'30110108' : "",
		'27725043' : "",
		'27315033' : "",
		'18345084' : "",
		'11051022' : "",
		'10671030' : "",
		'10671029' : "",
		'10615821' : "",
		'11035096' : "",
		'10642098' : "",
		'12755231' : "",
		'12040030' : "",
		'11865003' : "",
		'11275039' : "",
		'11295014' : "",
		'11565037' : "",
		'15960017' : "",
		'16785465' : ""
	},
	s2v_map:{
		"register" : 7795923,
		"7771547" : 7771547,
		"72765026" : 72765026,
		"66515139" : 66515139,
		"63750218" : 63750218,
		"55565027" : 55565027,
		"51615035" : 51615035,
		"51410003" : 51410003,
		"46725145" : 46725145,
		"46835164" : 46835164,
		"46785153" : 46785153,
		"46880148" : 46880148,
		"46800132" : 46800132,
		"46675251" : 46675251,
		"46805178" : 46805178,
		"46750146" : 46750146,
		"46670149" : 46670149,
		"46705122" : 46705122,
		"46375041" : 46375041,
		"46745131" : 46745131,
		"46790219" : 46790219,
		"46660108" : 46660108,
		"46720087" : 46720087,
		"46865086" : 46865086,
		"46680138" : 46680138,
		"46690154" : 46690154,
		"34775122" : 34775122,
		"33865292" : 33865292,
		"34015213" : 34015213,
		"30110108" : 30110108,
		"27725043" : 27725043,
		"27315033" : 27315033,
		"18345084" : 18345084,
		"11051022" : 11051022,
		"10671030" : 10671030,
		"10671029" : 10671029,
		"10615821" : 10615821,
		"11035096" : 11035096,
		"10642098" : 10642098,
		"12755231" : 12755231,
		"12040030" : 12040030,
		"11865003" : 11865003,
		"11275039" : 11275039,
		"11295014" : 11295014,
		"11565037" : 11565037,
		"15960017" : 15960017,
		"16785465" : 16785465
	},
	v2s_map:{
		 '7795923':  "register",
		 '7771547':  "7771547",
		 '72765026':  "72765026",
		 '66515139':  "66515139",
		 '63750218':  "63750218",
		 '55565027':  "55565027",
		 '51615035':  "51615035",
		 '51410003':  "51410003",
		 '46725145':  "46725145",
		 '46835164':  "46835164",
		 '46785153':  "46785153",
		 '46880148':  "46880148",
		 '46800132':  "46800132",
		 '46675251':  "46675251",
		 '46805178':  "46805178",
		 '46750146':  "46750146",
		 '46670149':  "46670149",
		 '46705122':  "46705122",
		 '46375041':  "46375041",
		 '46745131':  "46745131",
		 '46790219':  "46790219",
		 '46660108':  "46660108",
		 '46720087':  "46720087",
		 '46865086':  "46865086",
		 '46680138':  "46680138",
		 '46690154':  "46690154",
		 '34775122':  "34775122",
		 '33865292':  "33865292",
		 '34015213':  "34015213",
		 '30110108':  "30110108",
		 '27725043':  "27725043",
		 '27315033':  "27315033",
		 '18345084':  "18345084",
		 '11051022':  "11051022",
		 '10671030':  "10671030",
		 '10671029':  "10671029",
		 '10615821':  "10615821",
		 '11035096':  "11035096",
		 '10642098':  "10642098",
		 '12755231':  "12755231",
		 '12040030':  "12040030",
		 '11865003':  "11865003",
		 '11275039':  "11275039",
		 '11295014':  "11295014",
		 '11565037':  "11565037",
		 '15960017':  "15960017",
		 '16785465':  "16785465"
	},

		//用户注册验证码-old
		V_REGISTER:7795923,
		//通用验证-old
		V_7771547:7771547,
		//短信通知（价格调整）
		V_72765026:72765026,
		//家长预约5-9
		V_66515139:66515139,
		//预约完成4-28
		V_63750218:63750218,
		//老师注册通知3-15
		V_55565027:55565027,
		//老师注册通知
		V_51615035:51615035,
		//老师签单奖励通知
		V_51410003:51410003,
		//解除排课限制通知2-14
		V_46725145:46725145,
		//限制老师排课通知2-14
		V_46835164:46835164,
		//试听取消-不付工资2-14
		V_46785153:46785153,
		//第一次支付成功2-14
		V_46880148:46880148,
		//第二次支付成功2-14
		V_46800132:46800132,
		//注册老师账号通知2-14
		V_46675251:46675251,
		//晚8点 通知老师明天上课
		V_46805178:46805178,
		//老师反馈通知2-14
		V_46750146:46750146,
		//老师试讲可重申2-14
		V_46670149:46670149,
		//老师视频不完整 2
		V_46705122:46705122,
		//老师视频不完整
		V_46375041:46375041,
		//老师试讲未通过2-14
		V_46745131:46745131,
		//通知老师上传试讲2-14
		V_46790219:46790219,
		//老师冻结通知2-14
		V_46660108:46660108,
		//老师解冻通知2-14
		V_46720087:46720087,
		//老师试讲通过2-14
		V_46865086:46865086,
		//通知老师课程取消-付工资2-14
		V_46680138:46680138,
		//通知明天上课2-14
		V_46690154:46690154,
		//价格调整
		V_34775122:34775122,
		//通知老师试听课程取消-不付工资
		V_33865292:33865292,
		//老师试讲通过
		V_34015213:34015213,
		//通知老师课程取消
		V_30110108:30110108,
		//报名免费课程
		V_27725043:27725043,
		//预约完成3
		V_27315033:27315033,
		//通知明天上课
		V_18345084:18345084,
		//合同确认，重置家长密码
		V_11051022:11051022,
		//注册验证码
		V_10671030:10671030,
		//通用验证
		V_10671029:10671029,
		//早7点 通知家长1v1&小班上课
		V_10615821:10615821,
		//早7点 通知家长试听上课
		V_11035096:11035096,
		//晚8点 通知老师明天上课
		V_10642098:10642098,
		//注册老师账号通知
		V_12755231:12755231,
		//课件上传提醒
		V_12040030:12040030,
		//第二次支付成功
		V_11865003:11865003,
		//试听排课完成 
		V_11275039:11275039,
		//预约完成 
		V_11295014:11295014,
		//通知家长预约成功
		V_11565037:11565037,
		//销售回访后通知家长
		V_15960017:15960017,
		//通知家长预约成功2
		V_16785465:16785465,

		//用户注册验证码-old
		S_REGISTER:"register",
		//通用验证-old
		S_7771547:"7771547",
		//短信通知（价格调整）
		S_72765026:"72765026",
		//家长预约5-9
		S_66515139:"66515139",
		//预约完成4-28
		S_63750218:"63750218",
		//老师注册通知3-15
		S_55565027:"55565027",
		//老师注册通知
		S_51615035:"51615035",
		//老师签单奖励通知
		S_51410003:"51410003",
		//解除排课限制通知2-14
		S_46725145:"46725145",
		//限制老师排课通知2-14
		S_46835164:"46835164",
		//试听取消-不付工资2-14
		S_46785153:"46785153",
		//第一次支付成功2-14
		S_46880148:"46880148",
		//第二次支付成功2-14
		S_46800132:"46800132",
		//注册老师账号通知2-14
		S_46675251:"46675251",
		//晚8点 通知老师明天上课
		S_46805178:"46805178",
		//老师反馈通知2-14
		S_46750146:"46750146",
		//老师试讲可重申2-14
		S_46670149:"46670149",
		//老师视频不完整 2
		S_46705122:"46705122",
		//老师视频不完整
		S_46375041:"46375041",
		//老师试讲未通过2-14
		S_46745131:"46745131",
		//通知老师上传试讲2-14
		S_46790219:"46790219",
		//老师冻结通知2-14
		S_46660108:"46660108",
		//老师解冻通知2-14
		S_46720087:"46720087",
		//老师试讲通过2-14
		S_46865086:"46865086",
		//通知老师课程取消-付工资2-14
		S_46680138:"46680138",
		//通知明天上课2-14
		S_46690154:"46690154",
		//价格调整
		S_34775122:"34775122",
		//通知老师试听课程取消-不付工资
		S_33865292:"33865292",
		//老师试讲通过
		S_34015213:"34015213",
		//通知老师课程取消
		S_30110108:"30110108",
		//报名免费课程
		S_27725043:"27725043",
		//预约完成3
		S_27315033:"27315033",
		//通知明天上课
		S_18345084:"18345084",
		//合同确认，重置家长密码
		S_11051022:"11051022",
		//注册验证码
		S_10671030:"10671030",
		//通用验证
		S_10671029:"10671029",
		//早7点 通知家长1v1&小班上课
		S_10615821:"10615821",
		//早7点 通知家长试听上课
		S_11035096:"11035096",
		//晚8点 通知老师明天上课
		S_10642098:"10642098",
		//注册老师账号通知
		S_12755231:"12755231",
		//课件上传提醒
		S_12040030:"12040030",
		//第二次支付成功
		S_11865003:"11865003",
		//试听排课完成 
		S_11275039:"11275039",
		//预约完成 
		S_11295014:"11295014",
		//通知家长预约成功
		S_11565037:"11565037",
		//销售回访后通知家长
		S_15960017:"15960017",
		//通知家长预约成功2
		S_16785465:"16785465"


},

star_level : {
	desc_map : {
		'1' : "一星",
		'2' : "二星",
		'3' : "三星",
		'4' : "四星",
		'5' : "五星"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//一星
		V_1:1,
		//二星
		V_2:2,
		//三星
		V_3:3,
		//四星
		V_4:4,
		//五星
		V_5:5,

		//一星
		S_1:"1",
		//二星
		S_2:"2",
		//三星
		S_3:"3",
		//四星
		S_4:"4",
		//五星
		S_5:"5"


},

student_type : {
	desc_map : {
		'0' : "在读学员",
		'1' : "已结课学员",
		'2' : "停课学员",
		'3' : "休学学员",
		'4' : "寒暑假停课"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//在读学员
		V_0:0,
		//已结课学员
		V_1:1,
		//停课学员
		V_2:2,
		//休学学员
		V_3:3,
		//寒暑假停课
		V_4:4,

		//在读学员
		S_0:"0",
		//已结课学员
		S_1:"1",
		//停课学员
		S_2:"2",
		//休学学员
		S_3:"3",
		//寒暑假停课
		S_4:"4"


},

stu_origin : {
	desc_map : {
		'0' : "注册",
		'1' : "转介绍"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//注册
		V_0:0,
		//转介绍
		V_1:1,

		//注册
		S_0:"0",
		//转介绍
		S_1:"1"


},

stu_score_type : {
	desc_map : {
		'1' : "平时",
		'2' : "月考",
		'3' : "期中考",
		'4' : "期末考"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"common" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '1':  "common",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//平时
		V_COMMON:1,
		//月考
		V_2:2,
		//期中考
		V_3:3,
		//期末考
		V_4:4,

		//平时
		S_COMMON:"common",
		//月考
		S_2:"2",
		//期中考
		S_3:"3",
		//期末考
		S_4:"4"


},

subject : {
	desc_map : {
		'0' : "未设置",
		'1' : "语文",
		'2' : "数学",
		'3' : "英语",
		'4' : "化学",
		'5' : "物理",
		'6' : "生物",
		'7' : "政治",
		'8' : "历史",
		'9' : "地理",
		'10' : "科学",
		'11' : "教育学"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : ""
	},
	s2v_map:{
		"未设置" : 0,
		"语文" : 1,
		"数学" : 2,
		"英语" : 3,
		"化学" : 4,
		"物理" : 5,
		"生物" : 6,
		"政治" : 7,
		"历史" : 8,
		"地理" : 9,
		"科学" : 10,
		"教育学" : 11
	},
	v2s_map:{
		 '0':  "未设置",
		 '1':  "语文",
		 '2':  "数学",
		 '3':  "英语",
		 '4':  "化学",
		 '5':  "物理",
		 '6':  "生物",
		 '7':  "政治",
		 '8':  "历史",
		 '9':  "地理",
		 '10':  "科学",
		 '11':  "教育学"
	},

		//未设置
		V_未设置:0,
		//语文
		V_语文:1,
		//数学
		V_数学:2,
		//英语
		V_英语:3,
		//化学
		V_化学:4,
		//物理
		V_物理:5,
		//生物
		V_生物:6,
		//政治
		V_政治:7,
		//历史
		V_历史:8,
		//地理
		V_地理:9,
		//科学
		V_科学:10,
		//教育学
		V_教育学:11,

		//未设置
		S_未设置:"未设置",
		//语文
		S_语文:"语文",
		//数学
		S_数学:"数学",
		//英语
		S_英语:"英语",
		//化学
		S_化学:"化学",
		//物理
		S_物理:"物理",
		//生物
		S_生物:"生物",
		//政治
		S_政治:"政治",
		//历史
		S_历史:"历史",
		//地理
		S_地理:"地理",
		//科学
		S_科学:"科学",
		//教育学
		S_教育学:"教育学"


},

teacher_is_good : {
	desc_map : {
		'0' : "普通",
		'1' : "优秀"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//普通
		V_0:0,
		//优秀
		V_1:1,

		//普通
		S_0:"0",
		//优秀
		S_1:"1"


},

teacher_join_info : {
	desc_map : {
		'0' : "出席",
		'1' : "请假",
		'2' : "缺席"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//出席
		V_0:0,
		//请假
		V_1:1,
		//缺席
		V_2:2,

		//出席
		S_0:"0",
		//请假
		S_1:"1",
		//缺席
		S_2:"2"


},

teacher_label_type : {
	desc_map : {
		'1' : "师生互动",
		'2' : "课堂氛围",
		'3' : "授课规范",
		'4' : "教师风格"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//师生互动
		V_1:1,
		//课堂氛围
		V_2:2,
		//授课规范
		V_3:3,
		//教师风格
		V_4:4,

		//师生互动
		S_1:"1",
		//课堂氛围
		S_2:"2",
		//授课规范
		S_3:"3",
		//教师风格
		S_4:"4"


},

teacher_lecture_score : {
	desc_map : {
		'0' : "0",
		'1' : "1",
		'2' : "2",
		'3' : "3",
		'4' : "4",
		'5' : "5",
		'6' : "6",
		'7' : "7",
		'8' : "8",
		'9' : "9",
		'10' : "10"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10"
	},

		//0
		V_0:0,
		//1
		V_1:1,
		//2
		V_2:2,
		//3
		V_3:3,
		//4
		V_4:4,
		//5
		V_5:5,
		//6
		V_6:6,
		//7
		V_7:7,
		//8
		V_8:8,
		//9
		V_9:9,
		//10
		V_10:10,

		//0
		S_0:"0",
		//1
		S_1:"1",
		//2
		S_2:"2",
		//3
		S_3:"3",
		//4
		S_4:"4",
		//5
		S_5:"5",
		//6
		S_6:"6",
		//7
		S_7:"7",
		//8
		S_8:"8",
		//9
		S_9:"9",
		//10
		S_10:"10"


},

teacher_money_type : {
	desc_map : {
		'0' : "在职教师",
		'1' : "高校生",
		'2' : "外聘",
		'3' : "固定工资",
		'4' : "第三版规则",
		'5' : "平台合作"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//在职教师
		V_0:0,
		//高校生
		V_1:1,
		//外聘
		V_2:2,
		//固定工资
		V_3:3,
		//第三版规则
		V_4:4,
		//平台合作
		V_5:5,

		//在职教师
		S_0:"0",
		//高校生
		S_1:"1",
		//外聘
		S_2:"2",
		//固定工资
		S_3:"3",
		//第三版规则
		S_4:"4",
		//平台合作
		S_5:"5"


},

teacher_ref_type : {
	desc_map : {
		'0' : "非渠道推荐",
		'1' : "廖老师工作室",
		'2' : "王老师工作室",
		'3' : "明日之星",
		'4' : "方超工作室",
		'5' : "王磊工作室",
		'6' : "勋厚工作室",
		'31' : "公众号推荐",
		'32' : "微信代理老师",
		'41' : "公司内部推荐"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'31' : "",
		'32' : "",
		'41' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"31" : 31,
		"32" : 32,
		"41" : 41
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '31':  "31",
		 '32':  "32",
		 '41':  "41"
	},

		//非渠道推荐
		V_0:0,
		//廖老师工作室
		V_1:1,
		//王老师工作室
		V_2:2,
		//明日之星
		V_3:3,
		//方超工作室
		V_4:4,
		//王磊工作室
		V_5:5,
		//勋厚工作室
		V_6:6,
		//公众号推荐
		V_31:31,
		//微信代理老师
		V_32:32,
		//公司内部推荐
		V_41:41,

		//非渠道推荐
		S_0:"0",
		//廖老师工作室
		S_1:"1",
		//王老师工作室
		S_2:"2",
		//明日之星
		S_3:"3",
		//方超工作室
		S_4:"4",
		//王磊工作室
		S_5:"5",
		//勋厚工作室
		S_6:"6",
		//公众号推荐
		S_31:"31",
		//微信代理老师
		S_32:"32",
		//公司内部推荐
		S_41:"41"


},

teacher_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "全职老师",
		'2' : "兼职老师",
		'3' : "公司全职老师",
		'4' : "公司教研老师",
		'21' : "平台总代理",
		'22' : "平台助理",
		'31' : "公众号渠道",
		'32' : "微信号代理老师"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'21' : "",
		'22' : "",
		'31' : "",
		'32' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"21" : 21,
		"22" : 22,
		"31" : 31,
		"32" : 32
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '21':  "21",
		 '22':  "22",
		 '31':  "31",
		 '32':  "32"
	},

		//未设置
		V_0:0,
		//全职老师
		V_1:1,
		//兼职老师
		V_2:2,
		//公司全职老师
		V_3:3,
		//公司教研老师
		V_4:4,
		//平台总代理
		V_21:21,
		//平台助理
		V_22:22,
		//公众号渠道
		V_31:31,
		//微信号代理老师
		V_32:32,

		//未设置
		S_0:"0",
		//全职老师
		S_1:"1",
		//兼职老师
		S_2:"2",
		//公司全职老师
		S_3:"3",
		//公司教研老师
		S_4:"4",
		//平台总代理
		S_21:"21",
		//平台助理
		S_22:"22",
		//公众号渠道
		S_31:"31",
		//微信号代理老师
		S_32:"32"


},

tea_content_satisfy_flag : {
	desc_map : {
		'0' : "未设置",
		'1' : "满意",
		'2' : "还行",
		'3' : "不满意"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未设置
		V_0:0,
		//满意
		V_1:1,
		//还行
		V_2:2,
		//不满意
		V_3:3,

		//未设置
		S_0:"0",
		//满意
		S_1:"1",
		//还行
		S_2:"2",
		//不满意
		S_3:"3"


},

tea_content_satisfy_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "不够针对性",
		'2' : "上课讲错题",
		'3' : "无法吸引孩子注意力",
		'4' : "教材不匹配",
		'5' : "年级不匹配",
		'6' : "时间不稳定",
		'7' : "课后作业未布置/过难/过易",
		'8' : "不与孩子互动",
		'9' : "其他"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9"
	},

		//未设置
		V_0:0,
		//不够针对性
		V_1:1,
		//上课讲错题
		V_2:2,
		//无法吸引孩子注意力
		V_3:3,
		//教材不匹配
		V_4:4,
		//年级不匹配
		V_5:5,
		//时间不稳定
		V_6:6,
		//课后作业未布置/过难/过易
		V_7:7,
		//不与孩子互动
		V_8:8,
		//其他
		V_9:9,

		//未设置
		S_0:"0",
		//不够针对性
		S_1:"1",
		//上课讲错题
		S_2:"2",
		//无法吸引孩子注意力
		S_3:"3",
		//教材不匹配
		S_4:"4",
		//年级不匹配
		S_5:"5",
		//时间不稳定
		S_6:"6",
		//课后作业未布置/过难/过易
		S_7:"7",
		//不与孩子互动
		S_8:"8",
		//其他
		S_9:"9"


},

tea_label_atmos_type : {
	desc_map : {
		'1' : "语速均匀",
		'2' : "轻松愉快",
		'3' : "节奏紧凑",
		'4' : "生动有趣",
		'5' : "思路清晰",
		'6' : "语速过快/过慢",
		'7' : "语调沉闷",
		'8' : "节奏拖沓",
		'9' : "枯燥乏味",
		'10' : "思路清晰"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10"
	},

		//语速均匀
		V_1:1,
		//轻松愉快
		V_2:2,
		//节奏紧凑
		V_3:3,
		//生动有趣
		V_4:4,
		//思路清晰
		V_5:5,
		//语速过快/过慢
		V_6:6,
		//语调沉闷
		V_7:7,
		//节奏拖沓
		V_8:8,
		//枯燥乏味
		V_9:9,
		//思路清晰
		V_10:10,

		//语速均匀
		S_1:"1",
		//轻松愉快
		S_2:"2",
		//节奏紧凑
		S_3:"3",
		//生动有趣
		S_4:"4",
		//思路清晰
		S_5:"5",
		//语速过快/过慢
		S_6:"6",
		//语调沉闷
		S_7:"7",
		//节奏拖沓
		S_8:"8",
		//枯燥乏味
		S_9:"9",
		//思路清晰
		S_10:"10"


},

tea_label_interact_type : {
	desc_map : {
		'1' : "鼓励发言",
		'2' : "善于引导",
		'3' : "提问形式多样",
		'4' : "关注度高",
		'5' : "空话套话过多",
		'6' : "Yes/No问题过多",
		'7' : "提问形式单一",
		'8' : "关注度低"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8"
	},

		//鼓励发言
		V_1:1,
		//善于引导
		V_2:2,
		//提问形式多样
		V_3:3,
		//关注度高
		V_4:4,
		//空话套话过多
		V_5:5,
		//Yes/No问题过多
		V_6:6,
		//提问形式单一
		V_7:7,
		//关注度低
		V_8:8,

		//鼓励发言
		S_1:"1",
		//善于引导
		S_2:"2",
		//提问形式多样
		S_3:"3",
		//关注度高
		S_4:"4",
		//空话套话过多
		S_5:"5",
		//Yes/No问题过多
		S_6:"6",
		//提问形式单一
		S_7:"7",
		//关注度低
		S_8:"8"


},

tea_label_norm_type : {
	desc_map : {
		'1' : "考纲熟悉",
		'2' : "软件使用熟练",
		'3' : "讲义精美",
		'4' : "截图合理",
		'5' : "板书规范",
		'6' : "普通话标准",
		'7' : "考纲不熟悉",
		'8' : "软件使用生疏",
		'9' : "讲义凌乱",
		'10' : "截图不合理",
		'11' : "板书不规范",
		'12' : "有口音"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12"
	},

		//考纲熟悉
		V_1:1,
		//软件使用熟练
		V_2:2,
		//讲义精美
		V_3:3,
		//截图合理
		V_4:4,
		//板书规范
		V_5:5,
		//普通话标准
		V_6:6,
		//考纲不熟悉
		V_7:7,
		//软件使用生疏
		V_8:8,
		//讲义凌乱
		V_9:9,
		//截图不合理
		V_10:10,
		//板书不规范
		V_11:11,
		//有口音
		V_12:12,

		//考纲熟悉
		S_1:"1",
		//软件使用熟练
		S_2:"2",
		//讲义精美
		S_3:"3",
		//截图合理
		S_4:"4",
		//板书规范
		S_5:"5",
		//普通话标准
		S_6:"6",
		//考纲不熟悉
		S_7:"7",
		//软件使用生疏
		S_8:"8",
		//讲义凌乱
		S_9:"9",
		//截图不合理
		S_10:"10",
		//板书不规范
		S_11:"11",
		//有口音
		S_12:"12"


},

tea_label_style_type : {
	desc_map : {
		'1' : "平易近人",
		'2' : "生动活泼",
		'3' : "幽默风趣",
		'4' : "严谨认真",
		'5' : "咄咄逼人",
		'6' : "沉闷乏味",
		'7' : "缺乏课堂主导性",
		'8' : "散漫随性"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8"
	},

		//平易近人
		V_1:1,
		//生动活泼
		V_2:2,
		//幽默风趣
		V_3:3,
		//严谨认真
		V_4:4,
		//咄咄逼人
		V_5:5,
		//沉闷乏味
		V_6:6,
		//缺乏课堂主导性
		V_7:7,
		//散漫随性
		V_8:8,

		//平易近人
		S_1:"1",
		//生动活泼
		S_2:"2",
		//幽默风趣
		S_3:"3",
		//严谨认真
		S_4:"4",
		//咄咄逼人
		S_5:"5",
		//沉闷乏味
		S_6:"6",
		//缺乏课堂主导性
		S_7:"7",
		//散漫随性
		S_8:"8"


},

tea_type : {
	desc_map : {
		'0' : "老师",
		'1' : "助教"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//老师
		V_0:0,
		//助教
		V_1:1,

		//老师
		S_0:"0",
		//助教
		S_1:"1"


},

template_type : {
	desc_map : {
		'1' : "推荐类",
		'2' : "培训类",
		'3' : "活动类",
		'4' : "资料领取类"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//推荐类
		V_1:1,
		//培训类
		V_2:2,
		//活动类
		V_3:3,
		//资料领取类
		V_4:4,

		//推荐类
		S_1:"1",
		//培训类
		S_2:"2",
		//活动类
		S_3:"3",
		//资料领取类
		S_4:"4"


},

test_lesson_cancel_flag : {
	desc_map : {
		'0' : "无",
		'1' : "取消",
		'2' : "换时间"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//无
		V_0:0,
		//取消
		V_1:1,
		//换时间
		V_2:2,

		//无
		S_0:"0",
		//取消
		S_1:"1",
		//换时间
		S_2:"2"


},

test_lesson_fail_flag : {
	desc_map : {
		'0' : "未设置",
		'1' : "[付] 学生未到/课程取消",
		'2' : "[付] 换时间/学生设备网络出错",
		'3' : "[付]其它",
		'100' : "[不付] 课程取消",
		'101' : "[不付] 老师未到",
		'102' : "[不付] 老师原因",
		'103' : "[不付] 换时间 ",
		'104' : "[不付] 换老师",
		'105' : "[不付] 排课出错 ",
		'106' : "[不付] 学生未到/课程取消 ",
		'107' : "[不付] 换时间/学生设备出错 ",
		'108' : "[不付] 换老师/课程取消 ",
		'109' : "[不付] 老师未到/旷课 ",
		'110' : "[不付] 看错时间/抢错试听课 ",
		'111' : "[不付] 内容不全/试卷/教材不清楚 ",
		'112' : "[不付] 老师有常规课冲突 ",
		'113' : "[不付] 老师个人原因 ",
		'130' : "[不付] 其他 "
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'100' : "",
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'105' : "",
		'106' : "",
		'107' : "",
		'108' : "",
		'109' : "",
		'110' : "",
		'111' : "",
		'112' : "",
		'113' : "",
		'130' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"100" : 100,
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"105" : 105,
		"106" : 106,
		"107" : 107,
		"108" : 108,
		"109" : 109,
		"110" : 110,
		"111" : 111,
		"112" : 112,
		"113" : 113,
		"130" : 130
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '100':  "100",
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '105':  "105",
		 '106':  "106",
		 '107':  "107",
		 '108':  "108",
		 '109':  "109",
		 '110':  "110",
		 '111':  "111",
		 '112':  "112",
		 '113':  "113",
		 '130':  "130"
	},

		//未设置
		V_0:0,
		//[付] 学生未到/课程取消
		V_1:1,
		//[付] 换时间/学生设备网络出错
		V_2:2,
		//[付]其它
		V_3:3,
		//[不付] 课程取消
		V_100:100,
		//[不付] 老师未到
		V_101:101,
		//[不付] 老师原因
		V_102:102,
		//[不付] 换时间 
		V_103:103,
		//[不付] 换老师
		V_104:104,
		//[不付] 排课出错 
		V_105:105,
		//[不付] 学生未到/课程取消 
		V_106:106,
		//[不付] 换时间/学生设备出错 
		V_107:107,
		//[不付] 换老师/课程取消 
		V_108:108,
		//[不付] 老师未到/旷课 
		V_109:109,
		//[不付] 看错时间/抢错试听课 
		V_110:110,
		//[不付] 内容不全/试卷/教材不清楚 
		V_111:111,
		//[不付] 老师有常规课冲突 
		V_112:112,
		//[不付] 老师个人原因 
		V_113:113,
		//[不付] 其他 
		V_130:130,

		//未设置
		S_0:"0",
		//[付] 学生未到/课程取消
		S_1:"1",
		//[付] 换时间/学生设备网络出错
		S_2:"2",
		//[付]其它
		S_3:"3",
		//[不付] 课程取消
		S_100:"100",
		//[不付] 老师未到
		S_101:"101",
		//[不付] 老师原因
		S_102:"102",
		//[不付] 换时间 
		S_103:"103",
		//[不付] 换老师
		S_104:"104",
		//[不付] 排课出错 
		S_105:"105",
		//[不付] 学生未到/课程取消 
		S_106:"106",
		//[不付] 换时间/学生设备出错 
		S_107:"107",
		//[不付] 换老师/课程取消 
		S_108:"108",
		//[不付] 老师未到/旷课 
		S_109:"109",
		//[不付] 看错时间/抢错试听课 
		S_110:"110",
		//[不付] 内容不全/试卷/教材不清楚 
		S_111:"111",
		//[不付] 老师有常规课冲突 
		S_112:"112",
		//[不付] 老师个人原因 
		S_113:"113",
		//[不付] 其他 
		S_130:"130"


},

test_lesson_level : {
	desc_map : {
		'0' : "初级",
		'1' : "中级",
		'2' : "高级"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//初级
		V_0:0,
		//中级
		V_1:1,
		//高级
		V_2:2,

		//初级
		S_0:"0",
		//中级
		S_1:"1",
		//高级
		S_2:"2"


},

test_lesson_order_fail_flag : {
	desc_map : {
		'0' : "未设置",
		'1001' : "自身原因-只是想尝试下免费课程，本身没有需求",
		'1002' : "自身原因-学生完全抗拒学习",
		'1003' : "自身原因-完全不信任在线教育模式",
		'1004' : "自身原因-学生学习习惯较差，不适应在线教育",
		'1101' : "价格原因-完全接受不了价格，应该比线下低很多",
		'1102' : "价格原因-价格能接受，但是比其他在线教育机构贵",
		'1103' : "价格原因-课程单价能接受，但总价太高",
		'1201' : "品牌信任度-相比其他教育机构理优口碑较差",
		'1202' : "品牌信任度-接受在线教育，但对理优品牌不信任",
		'1301' : "教学能力-上课没有课件",
		'1302' : "教学能力-备课内容与试听需求是否匹配",
		'1303' : "教学能力-课件的质量（课件的层次感，逻辑感）",
		'1304' : "教学能力-技巧，知识点讲解与练习比例过多，或过少",
		'1305' : "教学能力-填鸭式教学，学生过于被动，发言过少",
		'1306' : "教学能力-板书凌乱，没有必要的板书，板书内容太多太杂",
		'1307' : "教学能力-讲解节奏过慢/过快",
		'1308' : "教学能力-讲题方法思路错误",
		'1309' : "教学能力-知识点讲解错误",
		'1310' : "教学能力-抓不住重难点",
		'1311' : "教学能力-课本内容不熟悉",
		'1312' : "教学能力-解题错误",
		'1313' : "教学能力-语言组织能力差，表达不清，无逻辑或反应迟缓，发音不标准",
		'1401' : "教学态度-态度恶劣，争吵、侮辱或谩骂学生，打击学生自信心，",
		'1402' : "教学态度-吃东西，浏览无关网站，闲聊，玩手机，接听电话，收发快递",
		'1403' : "教学态度-议论其他员工、推荐其他机构，使用其他机构材料",
		'1501' : "产品问题-软件操作复杂",
		'1502' : "产品问题-上课时网络断卡现象严重，影响上课",
		'1503' : "产品问题-上课时一直听不到声音，看不到老师讲义",
		'1504' : "产品问题-老师那边背景环境嘈杂，影响听课质量",
		'1601' : "时间问题-约了课程没有时间上",
		'1602' : "时间问题-服务流程复杂不想上了",
		'1603' : "时间问题-排课后学生家长联系不上",
		'1604' : "时间问题-确定好时间后学生没有来上课",
		'1605' : "长期未确定默认为无效"
	},
	simple_desc_map: {
		'0' : "",
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1004' : "",
		'1101' : "",
		'1102' : "",
		'1103' : "",
		'1201' : "",
		'1202' : "",
		'1301' : "",
		'1302' : "",
		'1303' : "",
		'1304' : "",
		'1305' : "",
		'1306' : "",
		'1307' : "",
		'1308' : "",
		'1309' : "",
		'1310' : "",
		'1311' : "",
		'1312' : "",
		'1313' : "",
		'1401' : "",
		'1402' : "",
		'1403' : "",
		'1501' : "",
		'1502' : "",
		'1503' : "",
		'1504' : "",
		'1601' : "",
		'1602' : "",
		'1603' : "",
		'1604' : "",
		'1605' : ""
	},
	s2v_map:{
		"0" : 0,
		"1001" : 1001,
		"1002" : 1002,
		"1003" : 1003,
		"1004" : 1004,
		"1101" : 1101,
		"1102" : 1102,
		"1103" : 1103,
		"1201" : 1201,
		"1202" : 1202,
		"1301" : 1301,
		"1302" : 1302,
		"1303" : 1303,
		"1304" : 1304,
		"1305" : 1305,
		"1306" : 1306,
		"1307" : 1307,
		"1308" : 1308,
		"1309" : 1309,
		"1310" : 1310,
		"1311" : 1311,
		"1312" : 1312,
		"1313" : 1313,
		"1401" : 1401,
		"1402" : 1402,
		"1403" : 1403,
		"1501" : 1501,
		"1502" : 1502,
		"1503" : 1503,
		"1504" : 1504,
		"1601" : 1601,
		"1602" : 1602,
		"1603" : 1603,
		"1604" : 1604,
		"1605" : 1605
	},
	v2s_map:{
		 '0':  "0",
		 '1001':  "1001",
		 '1002':  "1002",
		 '1003':  "1003",
		 '1004':  "1004",
		 '1101':  "1101",
		 '1102':  "1102",
		 '1103':  "1103",
		 '1201':  "1201",
		 '1202':  "1202",
		 '1301':  "1301",
		 '1302':  "1302",
		 '1303':  "1303",
		 '1304':  "1304",
		 '1305':  "1305",
		 '1306':  "1306",
		 '1307':  "1307",
		 '1308':  "1308",
		 '1309':  "1309",
		 '1310':  "1310",
		 '1311':  "1311",
		 '1312':  "1312",
		 '1313':  "1313",
		 '1401':  "1401",
		 '1402':  "1402",
		 '1403':  "1403",
		 '1501':  "1501",
		 '1502':  "1502",
		 '1503':  "1503",
		 '1504':  "1504",
		 '1601':  "1601",
		 '1602':  "1602",
		 '1603':  "1603",
		 '1604':  "1604",
		 '1605':  "1605"
	},

		//未设置
		V_0:0,
		//自身原因-只是想尝试下免费课程，本身没有需求
		V_1001:1001,
		//自身原因-学生完全抗拒学习
		V_1002:1002,
		//自身原因-完全不信任在线教育模式
		V_1003:1003,
		//自身原因-学生学习习惯较差，不适应在线教育
		V_1004:1004,
		//价格原因-完全接受不了价格，应该比线下低很多
		V_1101:1101,
		//价格原因-价格能接受，但是比其他在线教育机构贵
		V_1102:1102,
		//价格原因-课程单价能接受，但总价太高
		V_1103:1103,
		//品牌信任度-相比其他教育机构理优口碑较差
		V_1201:1201,
		//品牌信任度-接受在线教育，但对理优品牌不信任
		V_1202:1202,
		//教学能力-上课没有课件
		V_1301:1301,
		//教学能力-备课内容与试听需求是否匹配
		V_1302:1302,
		//教学能力-课件的质量（课件的层次感，逻辑感）
		V_1303:1303,
		//教学能力-技巧，知识点讲解与练习比例过多，或过少
		V_1304:1304,
		//教学能力-填鸭式教学，学生过于被动，发言过少
		V_1305:1305,
		//教学能力-板书凌乱，没有必要的板书，板书内容太多太杂
		V_1306:1306,
		//教学能力-讲解节奏过慢/过快
		V_1307:1307,
		//教学能力-讲题方法思路错误
		V_1308:1308,
		//教学能力-知识点讲解错误
		V_1309:1309,
		//教学能力-抓不住重难点
		V_1310:1310,
		//教学能力-课本内容不熟悉
		V_1311:1311,
		//教学能力-解题错误
		V_1312:1312,
		//教学能力-语言组织能力差，表达不清，无逻辑或反应迟缓，发音不标准
		V_1313:1313,
		//教学态度-态度恶劣，争吵、侮辱或谩骂学生，打击学生自信心，
		V_1401:1401,
		//教学态度-吃东西，浏览无关网站，闲聊，玩手机，接听电话，收发快递
		V_1402:1402,
		//教学态度-议论其他员工、推荐其他机构，使用其他机构材料
		V_1403:1403,
		//产品问题-软件操作复杂
		V_1501:1501,
		//产品问题-上课时网络断卡现象严重，影响上课
		V_1502:1502,
		//产品问题-上课时一直听不到声音，看不到老师讲义
		V_1503:1503,
		//产品问题-老师那边背景环境嘈杂，影响听课质量
		V_1504:1504,
		//时间问题-约了课程没有时间上
		V_1601:1601,
		//时间问题-服务流程复杂不想上了
		V_1602:1602,
		//时间问题-排课后学生家长联系不上
		V_1603:1603,
		//时间问题-确定好时间后学生没有来上课
		V_1604:1604,
		//长期未确定默认为无效
		V_1605:1605,

		//未设置
		S_0:"0",
		//自身原因-只是想尝试下免费课程，本身没有需求
		S_1001:"1001",
		//自身原因-学生完全抗拒学习
		S_1002:"1002",
		//自身原因-完全不信任在线教育模式
		S_1003:"1003",
		//自身原因-学生学习习惯较差，不适应在线教育
		S_1004:"1004",
		//价格原因-完全接受不了价格，应该比线下低很多
		S_1101:"1101",
		//价格原因-价格能接受，但是比其他在线教育机构贵
		S_1102:"1102",
		//价格原因-课程单价能接受，但总价太高
		S_1103:"1103",
		//品牌信任度-相比其他教育机构理优口碑较差
		S_1201:"1201",
		//品牌信任度-接受在线教育，但对理优品牌不信任
		S_1202:"1202",
		//教学能力-上课没有课件
		S_1301:"1301",
		//教学能力-备课内容与试听需求是否匹配
		S_1302:"1302",
		//教学能力-课件的质量（课件的层次感，逻辑感）
		S_1303:"1303",
		//教学能力-技巧，知识点讲解与练习比例过多，或过少
		S_1304:"1304",
		//教学能力-填鸭式教学，学生过于被动，发言过少
		S_1305:"1305",
		//教学能力-板书凌乱，没有必要的板书，板书内容太多太杂
		S_1306:"1306",
		//教学能力-讲解节奏过慢/过快
		S_1307:"1307",
		//教学能力-讲题方法思路错误
		S_1308:"1308",
		//教学能力-知识点讲解错误
		S_1309:"1309",
		//教学能力-抓不住重难点
		S_1310:"1310",
		//教学能力-课本内容不熟悉
		S_1311:"1311",
		//教学能力-解题错误
		S_1312:"1312",
		//教学能力-语言组织能力差，表达不清，无逻辑或反应迟缓，发音不标准
		S_1313:"1313",
		//教学态度-态度恶劣，争吵、侮辱或谩骂学生，打击学生自信心，
		S_1401:"1401",
		//教学态度-吃东西，浏览无关网站，闲聊，玩手机，接听电话，收发快递
		S_1402:"1402",
		//教学态度-议论其他员工、推荐其他机构，使用其他机构材料
		S_1403:"1403",
		//产品问题-软件操作复杂
		S_1501:"1501",
		//产品问题-上课时网络断卡现象严重，影响上课
		S_1502:"1502",
		//产品问题-上课时一直听不到声音，看不到老师讲义
		S_1503:"1503",
		//产品问题-老师那边背景环境嘈杂，影响听课质量
		S_1504:"1504",
		//时间问题-约了课程没有时间上
		S_1601:"1601",
		//时间问题-服务流程复杂不想上了
		S_1602:"1602",
		//时间问题-排课后学生家长联系不上
		S_1603:"1603",
		//时间问题-确定好时间后学生没有来上课
		S_1604:"1604",
		//长期未确定默认为无效
		S_1605:"1605"


},

test_lesson_score : {
	desc_map : {
		'0' : "0",
		'1' : "1",
		'2' : "2",
		'3' : "3",
		'4' : "4",
		'5' : "5",
		'6' : "6",
		'7' : "7",
		'8' : "8",
		'9' : "9",
		'10' : "10",
		'11' : "11",
		'12' : "12",
		'13' : "13",
		'14' : "14",
		'15' : "15",
		'16' : "16",
		'17' : "17",
		'18' : "18",
		'19' : "19",
		'20' : "20",
		'21' : "21",
		'22' : "22",
		'23' : "23",
		'24' : "24",
		'25' : "25",
		'26' : "26",
		'27' : "27",
		'28' : "28",
		'29' : "29",
		'30' : "30",
		'31' : "31",
		'32' : "32",
		'33' : "33",
		'34' : "34",
		'35' : "35",
		'36' : "36",
		'37' : "37",
		'38' : "38",
		'39' : "39",
		'40' : "40",
		'41' : "41",
		'42' : "42",
		'43' : "43",
		'44' : "44",
		'45' : "45",
		'46' : "46",
		'47' : "47",
		'48' : "48",
		'49' : "49",
		'50' : "50"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'16' : "",
		'17' : "",
		'18' : "",
		'19' : "",
		'20' : "",
		'21' : "",
		'22' : "",
		'23' : "",
		'24' : "",
		'25' : "",
		'26' : "",
		'27' : "",
		'28' : "",
		'29' : "",
		'30' : "",
		'31' : "",
		'32' : "",
		'33' : "",
		'34' : "",
		'35' : "",
		'36' : "",
		'37' : "",
		'38' : "",
		'39' : "",
		'40' : "",
		'41' : "",
		'42' : "",
		'43' : "",
		'44' : "",
		'45' : "",
		'46' : "",
		'47' : "",
		'48' : "",
		'49' : "",
		'50' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"15" : 15,
		"16" : 16,
		"17" : 17,
		"18" : 18,
		"19" : 19,
		"20" : 20,
		"21" : 21,
		"22" : 22,
		"23" : 23,
		"24" : 24,
		"25" : 25,
		"26" : 26,
		"27" : 27,
		"28" : 28,
		"29" : 29,
		"30" : 30,
		"31" : 31,
		"32" : 32,
		"33" : 33,
		"34" : 34,
		"35" : 35,
		"36" : 36,
		"37" : 37,
		"38" : 38,
		"39" : 39,
		"40" : 40,
		"41" : 41,
		"42" : 42,
		"43" : 43,
		"44" : 44,
		"45" : 45,
		"46" : 46,
		"47" : 47,
		"48" : 48,
		"49" : 49,
		"50" : 50
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '15':  "15",
		 '16':  "16",
		 '17':  "17",
		 '18':  "18",
		 '19':  "19",
		 '20':  "20",
		 '21':  "21",
		 '22':  "22",
		 '23':  "23",
		 '24':  "24",
		 '25':  "25",
		 '26':  "26",
		 '27':  "27",
		 '28':  "28",
		 '29':  "29",
		 '30':  "30",
		 '31':  "31",
		 '32':  "32",
		 '33':  "33",
		 '34':  "34",
		 '35':  "35",
		 '36':  "36",
		 '37':  "37",
		 '38':  "38",
		 '39':  "39",
		 '40':  "40",
		 '41':  "41",
		 '42':  "42",
		 '43':  "43",
		 '44':  "44",
		 '45':  "45",
		 '46':  "46",
		 '47':  "47",
		 '48':  "48",
		 '49':  "49",
		 '50':  "50"
	},

		//0
		V_0:0,
		//1
		V_1:1,
		//2
		V_2:2,
		//3
		V_3:3,
		//4
		V_4:4,
		//5
		V_5:5,
		//6
		V_6:6,
		//7
		V_7:7,
		//8
		V_8:8,
		//9
		V_9:9,
		//10
		V_10:10,
		//11
		V_11:11,
		//12
		V_12:12,
		//13
		V_13:13,
		//14
		V_14:14,
		//15
		V_15:15,
		//16
		V_16:16,
		//17
		V_17:17,
		//18
		V_18:18,
		//19
		V_19:19,
		//20
		V_20:20,
		//21
		V_21:21,
		//22
		V_22:22,
		//23
		V_23:23,
		//24
		V_24:24,
		//25
		V_25:25,
		//26
		V_26:26,
		//27
		V_27:27,
		//28
		V_28:28,
		//29
		V_29:29,
		//30
		V_30:30,
		//31
		V_31:31,
		//32
		V_32:32,
		//33
		V_33:33,
		//34
		V_34:34,
		//35
		V_35:35,
		//36
		V_36:36,
		//37
		V_37:37,
		//38
		V_38:38,
		//39
		V_39:39,
		//40
		V_40:40,
		//41
		V_41:41,
		//42
		V_42:42,
		//43
		V_43:43,
		//44
		V_44:44,
		//45
		V_45:45,
		//46
		V_46:46,
		//47
		V_47:47,
		//48
		V_48:48,
		//49
		V_49:49,
		//50
		V_50:50,

		//0
		S_0:"0",
		//1
		S_1:"1",
		//2
		S_2:"2",
		//3
		S_3:"3",
		//4
		S_4:"4",
		//5
		S_5:"5",
		//6
		S_6:"6",
		//7
		S_7:"7",
		//8
		S_8:"8",
		//9
		S_9:"9",
		//10
		S_10:"10",
		//11
		S_11:"11",
		//12
		S_12:"12",
		//13
		S_13:"13",
		//14
		S_14:"14",
		//15
		S_15:"15",
		//16
		S_16:"16",
		//17
		S_17:"17",
		//18
		S_18:"18",
		//19
		S_19:"19",
		//20
		S_20:"20",
		//21
		S_21:"21",
		//22
		S_22:"22",
		//23
		S_23:"23",
		//24
		S_24:"24",
		//25
		S_25:"25",
		//26
		S_26:"26",
		//27
		S_27:"27",
		//28
		S_28:"28",
		//29
		S_29:"29",
		//30
		S_30:"30",
		//31
		S_31:"31",
		//32
		S_32:"32",
		//33
		S_33:"33",
		//34
		S_34:"34",
		//35
		S_35:"35",
		//36
		S_36:"36",
		//37
		S_37:"37",
		//38
		S_38:"38",
		//39
		S_39:"39",
		//40
		S_40:"40",
		//41
		S_41:"41",
		//42
		S_42:"42",
		//43
		S_43:"43",
		//44
		S_44:"44",
		//45
		S_45:"45",
		//46
		S_46:"46",
		//47
		S_47:"47",
		//48
		S_48:"48",
		//49
		S_49:"49",
		//50
		S_50:"50"


},

test_lesson_status : {
	desc_map : {
		'0' : "未设置",
		'1' : "正常完成",
		'2' : "课程取消",
		'3' : "课程取消-换时间",
		'4' : "学生未到",
		'5' : "老师未到",
		'6' : "设备,系统异常",
		'7' : "其他"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//未设置
		V_0:0,
		//正常完成
		V_1:1,
		//课程取消
		V_2:2,
		//课程取消-换时间
		V_3:3,
		//学生未到
		V_4:4,
		//老师未到
		V_5:5,
		//设备,系统异常
		V_6:6,
		//其他
		V_7:7,

		//未设置
		S_0:"0",
		//正常完成
		S_1:"1",
		//课程取消
		S_2:"2",
		//课程取消-换时间
		S_3:"3",
		//学生未到
		S_4:"4",
		//老师未到
		S_5:"5",
		//设备,系统异常
		S_6:"6",
		//其他
		S_7:"7"


},

test_listen_from_type : {
	desc_map : {
		'0' : "渠道试听",
		'1' : "扩课试听",
		'2' : "换老师试听",
		'3' : "未听报试听"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//渠道试听
		V_0:0,
		//扩课试听
		V_1:1,
		//换老师试听
		V_2:2,
		//未听报试听
		V_3:3,

		//渠道试听
		S_0:"0",
		//扩课试听
		S_1:"1",
		//换老师试听
		S_2:"2",
		//未听报试听
		S_3:"3"


},

test_subject_free_reason : {
	desc_map : {
		'0' : "未设置",
		'1' : "学生未上课",
		'2' : "网络太卡",
		'3' : "排课后联系不上",
		'4' : "家长不信任",
		'5' : "孩子抗拒学习",
		'6' : "价钱太贵",
		'7' : "没有时间上课",
		'8' : "不适应线上授课",
		'9' : "其他"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9"
	},

		//未设置
		V_0:0,
		//学生未上课
		V_1:1,
		//网络太卡
		V_2:2,
		//排课后联系不上
		V_3:3,
		//家长不信任
		V_4:4,
		//孩子抗拒学习
		V_5:5,
		//价钱太贵
		V_6:6,
		//没有时间上课
		V_7:7,
		//不适应线上授课
		V_8:8,
		//其他
		V_9:9,

		//未设置
		S_0:"0",
		//学生未上课
		S_1:"1",
		//网络太卡
		S_2:"2",
		//排课后联系不上
		S_3:"3",
		//家长不信任
		S_4:"4",
		//孩子抗拒学习
		S_5:"5",
		//价钱太贵
		S_6:"6",
		//没有时间上课
		S_7:"7",
		//不适应线上授课
		S_8:"8",
		//其他
		S_9:"9"


},

test_subject_free_reason_teacher : {
	desc_map : {
		'1' : "和老师上课风格不合拍",
		'2' : "老师讲的内容太难思路太高端跟不上",
		'3' : "老师讲的内容太简单没收获",
		'4' : "老师表现的对考纲不熟悉",
		'5' : "老师表现的没有授课经验",
		'6' : "老师讲解题目思路不清晰",
		'7' : "老师讲课太枯燥乏味,缺乏互动",
		'8' : "老师授课环境太嘈杂",
		'9' : "老师没有解答出学生疑问",
		'10' : "老师对客户端操作不熟悉",
		'11' : "其他"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11"
	},

		//和老师上课风格不合拍
		V_1:1,
		//老师讲的内容太难思路太高端跟不上
		V_2:2,
		//老师讲的内容太简单没收获
		V_3:3,
		//老师表现的对考纲不熟悉
		V_4:4,
		//老师表现的没有授课经验
		V_5:5,
		//老师讲解题目思路不清晰
		V_6:6,
		//老师讲课太枯燥乏味,缺乏互动
		V_7:7,
		//老师授课环境太嘈杂
		V_8:8,
		//老师没有解答出学生疑问
		V_9:9,
		//老师对客户端操作不熟悉
		V_10:10,
		//其他
		V_11:11,

		//和老师上课风格不合拍
		S_1:"1",
		//老师讲的内容太难思路太高端跟不上
		S_2:"2",
		//老师讲的内容太简单没收获
		S_3:"3",
		//老师表现的对考纲不熟悉
		S_4:"4",
		//老师表现的没有授课经验
		S_5:"5",
		//老师讲解题目思路不清晰
		S_6:"6",
		//老师讲课太枯燥乏味,缺乏互动
		S_7:"7",
		//老师授课环境太嘈杂
		S_8:"8",
		//老师没有解答出学生疑问
		S_9:"9",
		//老师对客户端操作不熟悉
		S_10:"10",
		//其他
		S_11:"11"


},

test_subject_free_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "非老师原因",
		'2' : "老师原因",
		'3' : "无效例子"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未设置
		V_0:0,
		//非老师原因
		V_1:1,
		//老师原因
		V_2:2,
		//无效例子
		V_3:3,

		//未设置
		S_0:"0",
		//非老师原因
		S_1:"1",
		//老师原因
		S_2:"2",
		//无效例子
		S_3:"3"


},

test_user : {
	desc_map : {
		'0' : "不是",
		'1' : "是"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//不是
		V_0:0,
		//是
		V_1:1,

		//不是
		S_0:"0",
		//是
		S_1:"1"


},

textbook_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "沪教版",
		'2' : "人教版",
		'3' : "北师大版",
		'4' : "鲁教版",
		'5' : "苏教版",
		'6' : "浙教版",
		'7' : "沪科版"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//未设置
		V_0:0,
		//沪教版
		V_1:1,
		//人教版
		V_2:2,
		//北师大版
		V_3:3,
		//鲁教版
		V_4:4,
		//苏教版
		V_5:5,
		//浙教版
		V_6:6,
		//沪科版
		V_7:7,

		//未设置
		S_0:"0",
		//沪教版
		S_1:"1",
		//人教版
		S_2:"2",
		//北师大版
		S_3:"3",
		//鲁教版
		S_4:"4",
		//苏教版
		S_5:"5",
		//浙教版
		S_6:"6",
		//沪科版
		S_7:"7"


},

tmk_student_status : {
	desc_map : {
		'0' : "未设置",
		'1' : "待定",
		'2' : "无效",
		'3' : "有效"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未设置
		V_0:0,
		//待定
		V_1:1,
		//无效
		V_2:2,
		//有效
		V_3:3,

		//未设置
		S_0:"0",
		//待定
		S_1:"1",
		//无效
		S_2:"2",
		//有效
		S_3:"3"


},

todo_status : {
	desc_map : {
		'0' : "未开始",
		'1' : "进行中",
		'2' : "完成",
		'3' : "未完成"
	},
	simple_desc_map: {
		'0' : "black",
		'1' : "blue",
		'2' : "green",
		'3' : "red"
	},
	s2v_map:{
		"not_start" : 0,
		"todo" : 1,
		"done" : 2,
		"not_done" : 3
	},
	v2s_map:{
		 '0':  "not_start",
		 '1':  "todo",
		 '2':  "done",
		 '3':  "not_done"
	},

		//未开始
		V_NOT_START:0,
		//进行中
		V_TODO:1,
		//完成
		V_DONE:2,
		//未完成
		V_NOT_DONE:3,

		//未开始
		S_NOT_START:"not_start",
		//进行中
		S_TODO:"todo",
		//完成
		S_DONE:"done",
		//未完成
		S_NOT_DONE:"not_done"


},

todo_type : {
	desc_map : {
		'1001' : "再次回访",
		'1002' : "课前通知",
		'1003' : "课后回访"
	},
	simple_desc_map: {
		'1001' : "",
		'1002' : "",
		'1003' : ""
	},
	s2v_map:{
		"seller_next_call" : 1001,
		"seller_before_lesson_call" : 1002,
		"seller_after_lesson_call" : 1003
	},
	v2s_map:{
		 '1001':  "seller_next_call",
		 '1002':  "seller_before_lesson_call",
		 '1003':  "seller_after_lesson_call"
	},

		//再次回访
		V_SELLER_NEXT_CALL:1001,
		//课前通知
		V_SELLER_BEFORE_LESSON_CALL:1002,
		//课后回访
		V_SELLER_AFTER_LESSON_CALL:1003,

		//再次回访
		S_SELLER_NEXT_CALL:"seller_next_call",
		//课前通知
		S_SELLER_BEFORE_LESSON_CALL:"seller_before_lesson_call",
		//课后回访
		S_SELLER_AFTER_LESSON_CALL:"seller_after_lesson_call"


},

tongji_type : {
	desc_map : {
		'1' : "销售月度邀约",
		'2' : "销售月度-试听成功数",
		'3' : "销售月度-试听成功率",
		'4' : "销售月度签单数",
		'5' : "销售月度签单率",
		'6' : "销售月度签单金额",
		'7' : "销售月度分配资源数",
		'8' : "销售月度排课数",
		'9' : "销售月度签单人数",
		'10' : "销售月度试听课取消率",
		'11' : "销售月度试听课数",
		'12' : "销售月度试听课取消数"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : ""
	},
	s2v_map:{
		"seller_month_require_count" : 1,
		"seller_month_succ_test_lesson_count" : 2,
		"seller_month_succ_test_lesson_percent" : 3,
		"seller_month_order_count" : 4,
		"seller_month_order_percent" : 5,
		"seller_month_order_money" : 6,
		"seller_month_assign_count" : 7,
		"seller_month_lesson_plan" : 8,
		"seller_month_order_person_count" : 9,
		"seller_month_fail_lesson_percent" : 10,
		"seller_month_all_lesson_count" : 11,
		"seller_month_fail_lesson_count" : 12
	},
	v2s_map:{
		 '1':  "seller_month_require_count",
		 '2':  "seller_month_succ_test_lesson_count",
		 '3':  "seller_month_succ_test_lesson_percent",
		 '4':  "seller_month_order_count",
		 '5':  "seller_month_order_percent",
		 '6':  "seller_month_order_money",
		 '7':  "seller_month_assign_count",
		 '8':  "seller_month_lesson_plan",
		 '9':  "seller_month_order_person_count",
		 '10':  "seller_month_fail_lesson_percent",
		 '11':  "seller_month_all_lesson_count",
		 '12':  "seller_month_fail_lesson_count"
	},

		//销售月度邀约
		V_SELLER_MONTH_REQUIRE_COUNT:1,
		//销售月度-试听成功数
		V_SELLER_MONTH_SUCC_TEST_LESSON_COUNT:2,
		//销售月度-试听成功率
		V_SELLER_MONTH_SUCC_TEST_LESSON_PERCENT:3,
		//销售月度签单数
		V_SELLER_MONTH_ORDER_COUNT:4,
		//销售月度签单率
		V_SELLER_MONTH_ORDER_PERCENT:5,
		//销售月度签单金额
		V_SELLER_MONTH_ORDER_MONEY:6,
		//销售月度分配资源数
		V_SELLER_MONTH_ASSIGN_COUNT:7,
		//销售月度排课数
		V_SELLER_MONTH_LESSON_PLAN:8,
		//销售月度签单人数
		V_SELLER_MONTH_ORDER_PERSON_COUNT:9,
		//销售月度试听课取消率
		V_SELLER_MONTH_FAIL_LESSON_PERCENT:10,
		//销售月度试听课数
		V_SELLER_MONTH_ALL_LESSON_COUNT:11,
		//销售月度试听课取消数
		V_SELLER_MONTH_FAIL_LESSON_COUNT:12,

		//销售月度邀约
		S_SELLER_MONTH_REQUIRE_COUNT:"seller_month_require_count",
		//销售月度-试听成功数
		S_SELLER_MONTH_SUCC_TEST_LESSON_COUNT:"seller_month_succ_test_lesson_count",
		//销售月度-试听成功率
		S_SELLER_MONTH_SUCC_TEST_LESSON_PERCENT:"seller_month_succ_test_lesson_percent",
		//销售月度签单数
		S_SELLER_MONTH_ORDER_COUNT:"seller_month_order_count",
		//销售月度签单率
		S_SELLER_MONTH_ORDER_PERCENT:"seller_month_order_percent",
		//销售月度签单金额
		S_SELLER_MONTH_ORDER_MONEY:"seller_month_order_money",
		//销售月度分配资源数
		S_SELLER_MONTH_ASSIGN_COUNT:"seller_month_assign_count",
		//销售月度排课数
		S_SELLER_MONTH_LESSON_PLAN:"seller_month_lesson_plan",
		//销售月度签单人数
		S_SELLER_MONTH_ORDER_PERSON_COUNT:"seller_month_order_person_count",
		//销售月度试听课取消率
		S_SELLER_MONTH_FAIL_LESSON_PERCENT:"seller_month_fail_lesson_percent",
		//销售月度试听课数
		S_SELLER_MONTH_ALL_LESSON_COUNT:"seller_month_all_lesson_count",
		//销售月度试听课取消数
		S_SELLER_MONTH_FAIL_LESSON_COUNT:"seller_month_fail_lesson_count"


},

tq_called_flag : {
	desc_map : {
		'0' : "未联系",
		'1' : "未拨通",
		'2' : "已拨通"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未联系
		V_0:0,
		//未拨通
		V_1:1,
		//已拨通
		V_2:2,

		//未联系
		S_0:"0",
		//未拨通
		S_1:"1",
		//已拨通
		S_2:"2"


},

train_lesson_type : {
	desc_map : {
		'1' : "新入职培训",
		'2' : "科目培训",
		'3' : "试听反馈培训"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//新入职培训
		V_1:1,
		//科目培训
		V_2:2,
		//试听反馈培训
		V_3:3,

		//新入职培训
		S_1:"1",
		//科目培训
		S_2:"2",
		//试听反馈培训
		S_3:"3"


},

train_type : {
	desc_map : {
		'0' : "未设置",
		'1' : "新入职培训",
		'2' : "科目培训",
		'3' : "试听反馈培训",
		'4' : "模拟试听",
		'5' : "面试试讲"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//未设置
		V_0:0,
		//新入职培训
		V_1:1,
		//科目培训
		V_2:2,
		//试听反馈培训
		V_3:3,
		//模拟试听
		V_4:4,
		//面试试讲
		V_5:5,

		//未设置
		S_0:"0",
		//新入职培训
		S_1:"1",
		//科目培训
		S_2:"2",
		//试听反馈培训
		S_3:"3",
		//模拟试听
		S_4:"4",
		//面试试讲
		S_5:"5"


},

trial_type : {
	desc_map : {
		'0' : "无",
		'1' : "1v1试听课",
		'2' : "1v1定制课",
		'3' : "1v1自选课",
		'4' : "小班课购买",
		'5' : "公开课报名"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//无
		V_0:0,
		//1v1试听课
		V_1:1,
		//1v1定制课
		V_2:2,
		//1v1自选课
		V_3:3,
		//小班课购买
		V_4:4,
		//公开课报名
		V_5:5,

		//无
		S_0:"0",
		//1v1试听课
		S_1:"1",
		//1v1定制课
		S_2:"2",
		//1v1自选课
		S_3:"3",
		//小班课购买
		S_4:"4",
		//公开课报名
		S_5:"5"


},

user_lesson_account_reason : {
	desc_map : {
		'1000' : "新增",
		'1001' : "充值",
		'1002' : "课程退费",
		'1003' : "账户间移动",
		'1004' : "修改价格",
		'2001' : "课时消耗",
		'2002' : "账户间移动",
		'3001' : "重设1v1价格"
	},
	simple_desc_map: {
		'1000' : "",
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1004' : "",
		'2001' : "",
		'2002' : "",
		'3001' : ""
	},
	s2v_map:{
		"add_money_for_init" : 1000,
		"add_money_for_user_add" : 1001,
		"add_money_for_cancel_lesson" : 1002,
		"add_money_for_move" : 1003,
		"change_money_for_change_price" : 1004,
		"reduce_money_for_add_lesson" : 2001,
		"reduce_money_for_move" : 2002,
		"other_reset_1v1_price" : 3001
	},
	v2s_map:{
		 '1000':  "add_money_for_init",
		 '1001':  "add_money_for_user_add",
		 '1002':  "add_money_for_cancel_lesson",
		 '1003':  "add_money_for_move",
		 '1004':  "change_money_for_change_price",
		 '2001':  "reduce_money_for_add_lesson",
		 '2002':  "reduce_money_for_move",
		 '3001':  "other_reset_1v1_price"
	},

		//新增
		V_ADD_MONEY_FOR_INIT:1000,
		//充值
		V_ADD_MONEY_FOR_USER_ADD:1001,
		//课程退费
		V_ADD_MONEY_FOR_CANCEL_LESSON:1002,
		//账户间移动
		V_ADD_MONEY_FOR_MOVE:1003,
		//修改价格
		V_CHANGE_MONEY_FOR_CHANGE_PRICE:1004,
		//课时消耗
		V_REDUCE_MONEY_FOR_ADD_LESSON:2001,
		//账户间移动
		V_REDUCE_MONEY_FOR_MOVE:2002,
		//重设1v1价格
		V_OTHER_RESET_1V1_PRICE:3001,

		//新增
		S_ADD_MONEY_FOR_INIT:"add_money_for_init",
		//充值
		S_ADD_MONEY_FOR_USER_ADD:"add_money_for_user_add",
		//课程退费
		S_ADD_MONEY_FOR_CANCEL_LESSON:"add_money_for_cancel_lesson",
		//账户间移动
		S_ADD_MONEY_FOR_MOVE:"add_money_for_move",
		//修改价格
		S_CHANGE_MONEY_FOR_CHANGE_PRICE:"change_money_for_change_price",
		//课时消耗
		S_REDUCE_MONEY_FOR_ADD_LESSON:"reduce_money_for_add_lesson",
		//账户间移动
		S_REDUCE_MONEY_FOR_MOVE:"reduce_money_for_move",
		//重设1v1价格
		S_OTHER_RESET_1V1_PRICE:"other_reset_1v1_price"


},

user_report_from_type : {
	desc_map : {
		'1' : "家长微信申诉",
		'2' : "待定"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//家长微信申诉
		V_1:1,
		//待定
		V_2:2,

		//家长微信申诉
		S_1:"1",
		//待定
		S_2:"2"


},

week : {
	desc_map : {
		'0' : "周日",
		'1' : "周一",
		'2' : "周二",
		'3' : "周三",
		'4' : "周四",
		'5' : "周五",
		'6' : "周六",
		'7' : "周日"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//周日
		V_0:0,
		//周一
		V_1:1,
		//周二
		V_2:2,
		//周三
		V_3:3,
		//周四
		V_4:4,
		//周五
		V_5:5,
		//周六
		V_6:6,
		//周日
		V_7:7,

		//周日
		S_0:"0",
		//周一
		S_1:"1",
		//周二
		S_2:"2",
		//周三
		S_3:"3",
		//周四
		S_4:"4",
		//周五
		S_5:"5",
		//周六
		S_6:"6",
		//周日
		S_7:"7"


},

work_status : {
	desc_map : {
		'0' : "未传",
		'1' : "已传",
		'2' : "学生",
		'3' : "老师",
		'4' : "教研",
		'5' : "助教"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"no_upload" : 0,
		"issue" : 1,
		"finish" : 2,
		"check" : 3,
		"tea_research" : 4,
		"ass_research" : 5
	},
	v2s_map:{
		 '0':  "no_upload",
		 '1':  "issue",
		 '2':  "finish",
		 '3':  "check",
		 '4':  "tea_research",
		 '5':  "ass_research"
	},

		//未传
		V_NO_UPLOAD:0,
		//已传
		V_ISSUE:1,
		//学生
		V_FINISH:2,
		//老师
		V_CHECK:3,
		//教研
		V_TEA_RESEARCH:4,
		//助教
		V_ASS_RESEARCH:5,

		//未传
		S_NO_UPLOAD:"no_upload",
		//已传
		S_ISSUE:"issue",
		//学生
		S_FINISH:"finish",
		//老师
		S_CHECK:"check",
		//教研
		S_TEA_RESEARCH:"tea_research",
		//助教
		S_ASS_RESEARCH:"ass_research"


},

year : {
	desc_map : {
		'2016' : "2016",
		'2015' : "2015",
		'2014' : "2014",
		'2013' : "2013",
		'2012' : "2012",
		'2011' : "2011",
		'2010' : "2010"
	},
	simple_desc_map: {
		'2016' : "",
		'2015' : "",
		'2014' : "",
		'2013' : "",
		'2012' : "",
		'2011' : "",
		'2010' : ""
	},
	s2v_map:{
		"2016" : 2016,
		"2015" : 2015,
		"2014" : 2014,
		"2013" : 2013,
		"2012" : 2012,
		"2011" : 2011,
		"2010" : 2010
	},
	v2s_map:{
		 '2016':  "2016",
		 '2015':  "2015",
		 '2014':  "2014",
		 '2013':  "2013",
		 '2012':  "2012",
		 '2011':  "2011",
		 '2010':  "2010"
	},

		//2016
		V_2016:2016,
		//2015
		V_2015:2015,
		//2014
		V_2014:2014,
		//2013
		V_2013:2013,
		//2012
		V_2012:2012,
		//2011
		V_2011:2011,
		//2010
		V_2010:2010,

		//2016
		S_2016:"2016",
		//2015
		S_2015:"2015",
		//2014
		S_2014:"2014",
		//2013
		S_2013:"2013",
		//2012
		S_2012:"2012",
		//2011
		S_2011:"2011",
		//2010
		S_2010:"2010"


},
__END: {}
};
