<?php
namespace App\Models;
use \App\Enums as E;
class t_teacher_lecture_appointment_info_b2 extends \App\Models\Zgen\z_t_teacher_lecture_appointment_info
{
    public function __construct()
    {
        parent::__construct();
    }

    // 拉取招师人员名单(根据老师名拉取对应的招师人员)
    public function get_name_for_tea_name()
    {
        $sql=$this->gen_sql_new("select ta.name tname,m.name"
                                ." from %s ta left join %s m on ta.accept_adminid=m.uid "
                                ." where ta.name in ('王永兴','汪煜婷','杨哲','韩雪','张健','刘建敏','石铁军','冯雨丽','李烨','王波','王洪权','仲卫懿','钟淑芬','陈雨蒙','李娟','朱秀秀','丛润泽','刘佳','战琼','吴姗姗','王晓华','张金强','张萌萌','向文欣','邓细红','周睿珊','苏保卫','王帅蓉','陈雪冬','任守荣','喻冰雪','吕瑞肇','辛老师','陈淑芳','马海军','曲学轩','罗召鹏','李浩博','韩梦馨','熊孟秋','白晓雯','余泳','陈梦莹','刘玮','王鸿雨','杨凯伟','周春梅','樊诗慧','刘惠玲','梁文香','宋洁','李静','郭蕾','杨连臣','彭章裕','岳文忠','秦天阳','马宇杰','张育贵','李锦胜','王莹','代雅丽','郭荣艳','刘珊','付昱杰','赵文彩','吴勇贫','余洁','侯翠玲','齐恩薇','戢茜','谢新生','姜波','樊超','聂显山','马刚','姚晓妮','尹金萍','梁金凤','汪洋','林守庄','潘俊英','吕锋','鲍禾铮','邱丽红','梁青峰','李红英','唐湘璐','倪老师','张冬晨','文美玉','付小谧','刘国权','陈国腾','张也','徐胜','陈聪慧','黄冬梅','宋雅洁','杨爽','郭彦均','王丹青','李君君','游志坪','董海丽','娄小瑀','唐婷婷','程扶一','殷涛','邹洁','贺毅龙','孙长启','李东耀','邹寒','闫金香','沈铭洋','李雁鸣','王崇辉','田楚楚','焦佳','林双','刘静静','胡雨芳','陈晓晴','赵敏','何丽丽','何映烁','宋文怡','甄宏伟','黄蓉','张璐','郝滢','张金梁','金铃','周心怡','王呼雷','齐雨欣','李碧芳','姜芳','王娟','宋宋','阮淑怡','叶京茹','胡益洲','杨彤','阚鸿瑶','谢珏','刘瑶瑶','刘佳文','张晓帆','刘婉旭','陈静','宋迪','郭晓琳','段双双','李长城','宋佳丽','王霞','钟圆圆','田小恬','沈云云','张和','许一然','孙丹','吴明','杜飞','李阿芳','顾浩','付娟','王瑛','赵紫薇','谢晓耘','黄梦颖','秦雪如','张明华','李小雪','庞梅芳','李红霞','田红贤','焦丽娜','高芷若','耿海玉','袁俊龙','李晨阳','陈玉梅','罗王勇','孙家琛','李英才','胡明亮','苏郡','何青','潘雯','于梦思','魏涛','王英','宋佳月','丁老师','肖宁','马莉霞','李贺','李丹','董琦','邢丽月','朱玲婷','吴伟新','郝晓莉','朱丽莎','刘玉满','王欣') group by ta.name"
                                ,self::DB_TABLE_NAME
                                ,t_manager_info::DB_TABLE_NAME
        );
       
        return $this->main_get_list($sql);
    }
}