<?php
//自动生成枚举类  不要手工修改
//source  file: config_authority.php
namespace  App\Enums;

class Eauthority extends \App\Enums\Enum_base
{
	static public $field_name = "authority"  ;
	static public $name = "authority"  ;
	 static $desc_map= array(
		1 => "录入回访",
		2 => "分配老师",
		3 => "分配助教",
		4 => "学员排课",
		5 => "更改礼品状态",
		6 => "新增合同",
		7 => "合同退费",
		8 => "更改合同状态",
		9 => "更改退费状态",
		10 => "录入备注信息",
		11 => "提交分析报告",
		12 => "修改学生信息",
		13 => "设置课程内容",
		14 => "试听排课",
		15 => "测评分析",
		201 => "教师管理",
		202 => "助教管理",
		203 => "查看员工绩效",
		204 => "",
		301 => "课堂监控",
		501 => "用户管理",
		502 => "角色管理",
		503 => "权限管理",
		504 => "商城管理",
	);
	 static $simple_desc_map= array(
		1 => "",
		2 => "",
		3 => "",
		4 => "",
		5 => "",
		6 => "",
		7 => "",
		8 => "",
		9 => "",
		10 => "",
		11 => "",
		12 => "",
		13 => "",
		14 => "",
		15 => "",
		201 => "",
		202 => "",
		203 => "",
		204 => "",
		301 => "",
		501 => "",
		502 => "",
		503 => "",
		504 => "",
	);
	 static $s2v_map= array(
		"" => 1,
		"" => 2,
		"" => 3,
		"" => 4,
		"" => 5,
		"" => 6,
		"" => 7,
		"" => 8,
		"" => 9,
		"" => 10,
		"" => 11,
		"" => 12,
		"" => 13,
		"" => 14,
		"" => 15,
		"" => 201,
		"" => 202,
		"" => 203,
		"" => 204,
		"" => 301,
		"" => 501,
		"" => 502,
		"" => 503,
		"" => 504,
	);
	 static $v2s_map= array(
		 1=>  "",
		 2=>  "",
		 3=>  "",
		 4=>  "",
		 5=>  "",
		 6=>  "",
		 7=>  "",
		 8=>  "",
		 9=>  "",
		 10=>  "",
		 11=>  "",
		 12=>  "",
		 13=>  "",
		 14=>  "",
		 15=>  "",
		 201=>  "",
		 202=>  "",
		 203=>  "",
		 204=>  "",
		 301=>  "",
		 501=>  "",
		 502=>  "",
		 503=>  "",
		 504=>  "",
	);

	//录入回访
	const V_1=1;
	//分配老师
	const V_2=2;
	//分配助教
	const V_3=3;
	//学员排课
	const V_4=4;
	//更改礼品状态
	const V_5=5;
	//新增合同
	const V_6=6;
	//合同退费
	const V_7=7;
	//更改合同状态
	const V_8=8;
	//更改退费状态
	const V_9=9;
	//录入备注信息
	const V_10=10;
	//提交分析报告
	const V_11=11;
	//修改学生信息
	const V_12=12;
	//设置课程内容
	const V_13=13;
	//试听排课
	const V_14=14;
	//测评分析
	const V_15=15;
	//教师管理
	const V_201=201;
	//助教管理
	const V_202=202;
	//查看员工绩效
	const V_203=203;
	//
	const V_204=204;
	//课堂监控
	const V_301=301;
	//用户管理
	const V_501=501;
	//角色管理
	const V_502=502;
	//权限管理
	const V_503=503;
	//商城管理
	const V_504=504;

	//录入回访
	const S_1="";
	//分配老师
	const S_2="";
	//分配助教
	const S_3="";
	//学员排课
	const S_4="";
	//更改礼品状态
	const S_5="";
	//新增合同
	const S_6="";
	//合同退费
	const S_7="";
	//更改合同状态
	const S_8="";
	//更改退费状态
	const S_9="";
	//录入备注信息
	const S_10="";
	//提交分析报告
	const S_11="";
	//修改学生信息
	const S_12="";
	//设置课程内容
	const S_13="";
	//试听排课
	const S_14="";
	//测评分析
	const S_15="";
	//教师管理
	const S_201="";
	//助教管理
	const S_202="";
	//查看员工绩效
	const S_203="";
	//
	const S_204="";
	//课堂监控
	const S_301="";
	//用户管理
	const S_501="";
	//角色管理
	const S_502="";
	//权限管理
	const S_503="";
	//商城管理
	const S_504="";



};
