<?php
//自动生成枚举类  不要手工修改
//source  file: config_book_grade.php
namespace  App\Enums;

class Ebook_grade extends \App\Enums\Enum_base
{
	static public $field_name = "book_grade"  ;
	static public $name = "book_grade"  ;
	 static $desc_map= array(
		0 => "未填写",
		400 => "学龄前",
		100 => "小学",
		101 => "一年级",
		102 => "二年级",
		103 => "三年级",
		104 => "四年级",
		105 => "五年级",
		106 => "六年级",
		200 => "初中",
		201 => "七年级",
		202 => "八年级",
		203 => "九年级",
		300 => "高中",
		301 => "高一",
		302 => "高二",
		303 => "高三",
	);
	 static $simple_desc_map= array(
		0 => "",
		400 => "",
		100 => "",
		101 => "",
		102 => "",
		103 => "",
		104 => "",
		105 => "",
		106 => "",
		200 => "",
		201 => "",
		202 => "",
		203 => "",
		300 => "",
		301 => "",
		302 => "",
		303 => "",
	);
	 static $s2v_map= array(
		"" => 0,
		"" => 400,
		"" => 100,
		"" => 101,
		"" => 102,
		"" => 103,
		"" => 104,
		"" => 105,
		"" => 106,
		"" => 200,
		"" => 201,
		"" => 202,
		"" => 203,
		"" => 300,
		"" => 301,
		"" => 302,
		"" => 303,
	);
	 static $v2s_map= array(
		 0=>  "",
		 400=>  "",
		 100=>  "",
		 101=>  "",
		 102=>  "",
		 103=>  "",
		 104=>  "",
		 105=>  "",
		 106=>  "",
		 200=>  "",
		 201=>  "",
		 202=>  "",
		 203=>  "",
		 300=>  "",
		 301=>  "",
		 302=>  "",
		 303=>  "",
	);

	//未填写
	const V_0=0;
	//学龄前
	const V_400=400;
	//小学
	const V_100=100;
	//一年级
	const V_101=101;
	//二年级
	const V_102=102;
	//三年级
	const V_103=103;
	//四年级
	const V_104=104;
	//五年级
	const V_105=105;
	//六年级
	const V_106=106;
	//初中
	const V_200=200;
	//七年级
	const V_201=201;
	//八年级
	const V_202=202;
	//九年级
	const V_203=203;
	//高中
	const V_300=300;
	//高一
	const V_301=301;
	//高二
	const V_302=302;
	//高三
	const V_303=303;

	//未填写
	const S_0="";
	//学龄前
	const S_400="";
	//小学
	const S_100="";
	//一年级
	const S_101="";
	//二年级
	const S_102="";
	//三年级
	const S_103="";
	//四年级
	const S_104="";
	//五年级
	const S_105="";
	//六年级
	const S_106="";
	//初中
	const S_200="";
	//七年级
	const S_201="";
	//八年级
	const S_202="";
	//九年级
	const S_203="";
	//高中
	const S_300="";
	//高一
	const S_301="";
	//高二
	const S_302="";
	//高三
	const S_303="";



};
