<?php
//自动生成枚举类  不要手工修改
//source  file: config_department.php
namespace  App\Enums;

class Edepartment extends \App\Core\Enum_base
{
	static public $field_name = "department"  ;
	static public $name = "department"  ;
	 static $desc_map= array(
		0 => "未设置",
		1 => "教研部",
		2 => "教学质量组",
		3 => "培训部",
		4 => "师训部",
		5 => "老师运营组",
		6 => "教学部",
		7 => "产品部",
		8 => "咨询一部",
		9 => "咨询二部",
		10 => "咨询三部",
		11 => "销售运营部",
		12 => "助教部",
		13 => "教务部",
		14 => "客服部",
		15 => "市场部",
		16 => "研发部",
		17 => "财务部",
		18 => "人事部",
	);
	 static $simple_desc_map= array(
		0 => "",
		1 => "",
		2 => "",
		3 => "",
		4 => "",
		5 => "",
		6 => "",
		7 => "",
		8 => "",
		9 => "",
		10 => "",
		11 => "",
		12 => "",
		13 => "",
		14 => "",
		15 => "",
		16 => "",
		17 => "",
		18 => "",
	);
	 static $s2v_map= array(
		"" => 0,
		"" => 1,
		"" => 2,
		"" => 3,
		"" => 4,
		"" => 5,
		"" => 6,
		"" => 7,
		"" => 8,
		"" => 9,
		"" => 10,
		"" => 11,
		"" => 12,
		"" => 13,
		"" => 14,
		"" => 15,
		"" => 16,
		"" => 17,
		"" => 18,
	);
	 static $v2s_map= array(
		 0=>  "",
		 1=>  "",
		 2=>  "",
		 3=>  "",
		 4=>  "",
		 5=>  "",
		 6=>  "",
		 7=>  "",
		 8=>  "",
		 9=>  "",
		 10=>  "",
		 11=>  "",
		 12=>  "",
		 13=>  "",
		 14=>  "",
		 15=>  "",
		 16=>  "",
		 17=>  "",
		 18=>  "",
	);

	//未设置
	const V_0=0;
	//教研部
	const V_1=1;
	//教学质量组
	const V_2=2;
	//培训部
	const V_3=3;
	//师训部
	const V_4=4;
	//老师运营组
	const V_5=5;
	//教学部
	const V_6=6;
	//产品部
	const V_7=7;
	//咨询一部
	const V_8=8;
	//咨询二部
	const V_9=9;
	//咨询三部
	const V_10=10;
	//销售运营部
	const V_11=11;
	//助教部
	const V_12=12;
	//教务部
	const V_13=13;
	//客服部
	const V_14=14;
	//市场部
	const V_15=15;
	//研发部
	const V_16=16;
	//财务部
	const V_17=17;
	//人事部
	const V_18=18;

	//未设置
	const S_0="";
	//教研部
	const S_1="";
	//教学质量组
	const S_2="";
	//培训部
	const S_3="";
	//师训部
	const S_4="";
	//老师运营组
	const S_5="";
	//教学部
	const S_6="";
	//产品部
	const S_7="";
	//咨询一部
	const S_8="";
	//咨询二部
	const S_9="";
	//咨询三部
	const S_10="";
	//销售运营部
	const S_11="";
	//助教部
	const S_12="";
	//教务部
	const S_13="";
	//客服部
	const S_14="";
	//市场部
	const S_15="";
	//研发部
	const S_16="";
	//财务部
	const S_17="";
	//人事部
	const S_18="";



};
