<?php
//自动生成枚举类  不要手工修改
//source  file: config_department_group.php
namespace  App\Enums;

class Edepartment_group extends \App\Core\Enum_base
{
	static public $field_name = "department_group"  ;
	static public $name = "department_group"  ;
	 static $desc_map= array(
		0 => "未设置",
		1 => "文科组",
		2 => "数学组",
		3 => "综合组",
		4 => "教学质量组",
		5 => "培训组",
		6 => "师训组",
		7 => "老师运营组",
		8 => "教学组",
		9 => "产品组",
		10 => "助教一组",
		11 => "助教二组",
		12 => "营销组",
		13 => "运营组",
		14 => "质检组",
		15 => "前端开发组",
		16 => "后端开发组",
		17 => "测试组",
		18 => "运维组",
		19 => "出纳组",
		20 => "核算组",
		21 => "招聘培训组",
		22 => "薪福绩效组",
		23 => "员工关系组",
		24 => "行政组",
	);
	 static $simple_desc_map= array(
		0 => "",
		1 => "",
		2 => "",
		3 => "",
		4 => "",
		5 => "",
		6 => "",
		7 => "",
		8 => "",
		9 => "",
		10 => "",
		11 => "",
		12 => "",
		13 => "",
		14 => "",
		15 => "",
		16 => "",
		17 => "",
		18 => "",
		19 => "",
		20 => "",
		21 => "",
		22 => "",
		23 => "",
		24 => "",
	);
	 static $s2v_map= array(
		"" => 0,
		"" => 1,
		"" => 2,
		"" => 3,
		"" => 4,
		"" => 5,
		"" => 6,
		"" => 7,
		"" => 8,
		"" => 9,
		"" => 10,
		"" => 11,
		"" => 12,
		"" => 13,
		"" => 14,
		"" => 15,
		"" => 16,
		"" => 17,
		"" => 18,
		"" => 19,
		"" => 20,
		"" => 21,
		"" => 22,
		"" => 23,
		"" => 24,
	);
	 static $v2s_map= array(
		 0=>  "",
		 1=>  "",
		 2=>  "",
		 3=>  "",
		 4=>  "",
		 5=>  "",
		 6=>  "",
		 7=>  "",
		 8=>  "",
		 9=>  "",
		 10=>  "",
		 11=>  "",
		 12=>  "",
		 13=>  "",
		 14=>  "",
		 15=>  "",
		 16=>  "",
		 17=>  "",
		 18=>  "",
		 19=>  "",
		 20=>  "",
		 21=>  "",
		 22=>  "",
		 23=>  "",
		 24=>  "",
	);

	//未设置
	const V_0=0;
	//文科组
	const V_1=1;
	//数学组
	const V_2=2;
	//综合组
	const V_3=3;
	//教学质量组
	const V_4=4;
	//培训组
	const V_5=5;
	//师训组
	const V_6=6;
	//老师运营组
	const V_7=7;
	//教学组
	const V_8=8;
	//产品组
	const V_9=9;
	//助教一组
	const V_10=10;
	//助教二组
	const V_11=11;
	//营销组
	const V_12=12;
	//运营组
	const V_13=13;
	//质检组
	const V_14=14;
	//前端开发组
	const V_15=15;
	//后端开发组
	const V_16=16;
	//测试组
	const V_17=17;
	//运维组
	const V_18=18;
	//出纳组
	const V_19=19;
	//核算组
	const V_20=20;
	//招聘培训组
	const V_21=21;
	//薪福绩效组
	const V_22=22;
	//员工关系组
	const V_23=23;
	//行政组
	const V_24=24;

	//未设置
	const S_0="";
	//文科组
	const S_1="";
	//数学组
	const S_2="";
	//综合组
	const S_3="";
	//教学质量组
	const S_4="";
	//培训组
	const S_5="";
	//师训组
	const S_6="";
	//老师运营组
	const S_7="";
	//教学组
	const S_8="";
	//产品组
	const S_9="";
	//助教一组
	const S_10="";
	//助教二组
	const S_11="";
	//营销组
	const S_12="";
	//运营组
	const S_13="";
	//质检组
	const S_14="";
	//前端开发组
	const S_15="";
	//后端开发组
	const S_16="";
	//测试组
	const S_17="";
	//运维组
	const S_18="";
	//出纳组
	const S_19="";
	//核算组
	const S_20="";
	//招聘培训组
	const S_21="";
	//薪福绩效组
	const S_22="";
	//员工关系组
	const S_23="";
	//行政组
	const S_24="";



};
