<?php
//自动生成枚举类  不要手工修改
//source  file: config_groupid.php
namespace  App\Enums;

class Egroupid extends \App\Core\Enum_base
{
	static public $field_name = "groupid"  ;
	static public $name = "groupid"  ;
	 static $desc_map= array(
		66 => "01 后台管理员",
		52 => "02 非金钱管理账户",
		37 => "10 助教组长",
		59 => "11 助教一般",
		39 => "20 教研组长",
		70 => "21 教研-一般",
		67 => "23 教研-排课",
		68 => "30 市场助长",
		69 => "31 市场一般",
		72 => "32 市场分配资源",
		73 => "33 市场-一般-初级",
		57 => "40 顾问组长",
		38 => "41 顾问-一般",
		74 => "42 顾问-统计",
		77 => "43 顾问-小组长",
		76 => "44 顾问-其他",
		58 => "50 财务",
		75 => "51 人事",
		71 => "61 产品",
		42 => "91 题库-编辑",
		49 => "92 题库-审核",
		43 => "93 题库-编辑-统计",
		78 => "99 角色",
		48 => "工具箱 学校编辑",
		60 => "统计",
		61 => "统计金额",
		54 => "预约+工具",
		51 => "预约管理",
		36 => "超级管理员",
		55 => "查看合同金额",
		47 => "查看用户",
	);
	 static $simple_desc_map= array(
		66 => "",
		52 => "",
		37 => "",
		59 => "",
		39 => "",
		70 => "",
		67 => "",
		68 => "",
		69 => "",
		72 => "",
		73 => "",
		57 => "",
		38 => "",
		74 => "",
		77 => "",
		76 => "",
		58 => "",
		75 => "",
		71 => "",
		42 => "",
		49 => "",
		43 => "",
		78 => "",
		48 => "",
		60 => "",
		61 => "",
		54 => "",
		51 => "",
		36 => "",
		55 => "",
		47 => "",
	);
	 static $s2v_map= array(
		"" => 66,
		"" => 52,
		"" => 37,
		"" => 59,
		"" => 39,
		"" => 70,
		"" => 67,
		"" => 68,
		"" => 69,
		"" => 72,
		"" => 73,
		"" => 57,
		"" => 38,
		"" => 74,
		"" => 77,
		"" => 76,
		"" => 58,
		"" => 75,
		"" => 71,
		"" => 42,
		"" => 49,
		"" => 43,
		"" => 78,
		"" => 48,
		"" => 60,
		"" => 61,
		"" => 54,
		"" => 51,
		"" => 36,
		"" => 55,
		"" => 47,
	);
	 static $v2s_map= array(
		 66=>  "",
		 52=>  "",
		 37=>  "",
		 59=>  "",
		 39=>  "",
		 70=>  "",
		 67=>  "",
		 68=>  "",
		 69=>  "",
		 72=>  "",
		 73=>  "",
		 57=>  "",
		 38=>  "",
		 74=>  "",
		 77=>  "",
		 76=>  "",
		 58=>  "",
		 75=>  "",
		 71=>  "",
		 42=>  "",
		 49=>  "",
		 43=>  "",
		 78=>  "",
		 48=>  "",
		 60=>  "",
		 61=>  "",
		 54=>  "",
		 51=>  "",
		 36=>  "",
		 55=>  "",
		 47=>  "",
	);

	//01 后台管理员
	const V_66=66;
	//02 非金钱管理账户
	const V_52=52;
	//10 助教组长
	const V_37=37;
	//11 助教一般
	const V_59=59;
	//20 教研组长
	const V_39=39;
	//21 教研-一般
	const V_70=70;
	//23 教研-排课
	const V_67=67;
	//30 市场助长
	const V_68=68;
	//31 市场一般
	const V_69=69;
	//32 市场分配资源
	const V_72=72;
	//33 市场-一般-初级
	const V_73=73;
	//40 顾问组长
	const V_57=57;
	//41 顾问-一般
	const V_38=38;
	//42 顾问-统计
	const V_74=74;
	//43 顾问-小组长
	const V_77=77;
	//44 顾问-其他
	const V_76=76;
	//50 财务
	const V_58=58;
	//51 人事
	const V_75=75;
	//61 产品
	const V_71=71;
	//91 题库-编辑
	const V_42=42;
	//92 题库-审核
	const V_49=49;
	//93 题库-编辑-统计
	const V_43=43;
	//99 角色
	const V_78=78;
	//工具箱 学校编辑
	const V_48=48;
	//统计
	const V_60=60;
	//统计金额
	const V_61=61;
	//预约+工具
	const V_54=54;
	//预约管理
	const V_51=51;
	//超级管理员
	const V_36=36;
	//查看合同金额
	const V_55=55;
	//查看用户
	const V_47=47;

	//01 后台管理员
	const S_66="";
	//02 非金钱管理账户
	const S_52="";
	//10 助教组长
	const S_37="";
	//11 助教一般
	const S_59="";
	//20 教研组长
	const S_39="";
	//21 教研-一般
	const S_70="";
	//23 教研-排课
	const S_67="";
	//30 市场助长
	const S_68="";
	//31 市场一般
	const S_69="";
	//32 市场分配资源
	const S_72="";
	//33 市场-一般-初级
	const S_73="";
	//40 顾问组长
	const S_57="";
	//41 顾问-一般
	const S_38="";
	//42 顾问-统计
	const S_74="";
	//43 顾问-小组长
	const S_77="";
	//44 顾问-其他
	const S_76="";
	//50 财务
	const S_58="";
	//51 人事
	const S_75="";
	//61 产品
	const S_71="";
	//91 题库-编辑
	const S_42="";
	//92 题库-审核
	const S_49="";
	//93 题库-编辑-统计
	const S_43="";
	//99 角色
	const S_78="";
	//工具箱 学校编辑
	const S_48="";
	//统计
	const S_60="";
	//统计金额
	const S_61="";
	//预约+工具
	const S_54="";
	//预约管理
	const S_51="";
	//超级管理员
	const S_36="";
	//查看合同金额
	const S_55="";
	//查看用户
	const S_47="";



};
