<?php
//自动生成枚举类  不要手工修改
//source  file: config_lesson_error.php
namespace  App\Enums;

class Elesson_error extends \App\Core\Enum_base
{
	static public $field_name = "lesson_error"  ;
	static public $name = "lesson_error"  ;
	 static $desc_map= array(
		1 => "学生听不到老师声音",
		2 => "老师听不到学生声音",
		3 => "学生卡在加载语音服务",
		4 => "老师卡在加载语音服务",
		5 => "学生卡在加载白板",
		6 => "老师卡在加载白板",
		7 => "学生白板中图片无法显示",
		8 => "老师白板中图片无法显示",
		9 => "进出白板次数过多",
		10 => "网络错误1001",
		11 => "声音卡顿",
		12 => "老师无法加载讲义",
		13 => "学生无法加载讲义",
		14 => "白板中出现遗留或莫名图片划线",
	);
	 static $simple_desc_map= array(
		1 => "",
		2 => "",
		3 => "",
		4 => "",
		5 => "",
		6 => "",
		7 => "",
		8 => "",
		9 => "",
		10 => "",
		11 => "",
		12 => "",
		13 => "",
		14 => "",
	);
	 static $s2v_map= array(
		"" => 1,
		"" => 2,
		"" => 3,
		"" => 4,
		"" => 5,
		"" => 6,
		"" => 7,
		"" => 8,
		"" => 9,
		"" => 10,
		"" => 11,
		"" => 12,
		"" => 13,
		"" => 14,
	);
	 static $v2s_map= array(
		 1=>  "",
		 2=>  "",
		 3=>  "",
		 4=>  "",
		 5=>  "",
		 6=>  "",
		 7=>  "",
		 8=>  "",
		 9=>  "",
		 10=>  "",
		 11=>  "",
		 12=>  "",
		 13=>  "",
		 14=>  "",
	);

	//学生听不到老师声音
	const V_1=1;
	//老师听不到学生声音
	const V_2=2;
	//学生卡在加载语音服务
	const V_3=3;
	//老师卡在加载语音服务
	const V_4=4;
	//学生卡在加载白板
	const V_5=5;
	//老师卡在加载白板
	const V_6=6;
	//学生白板中图片无法显示
	const V_7=7;
	//老师白板中图片无法显示
	const V_8=8;
	//进出白板次数过多
	const V_9=9;
	//网络错误1001
	const V_10=10;
	//声音卡顿
	const V_11=11;
	//老师无法加载讲义
	const V_12=12;
	//学生无法加载讲义
	const V_13=13;
	//白板中出现遗留或莫名图片划线
	const V_14=14;

	//学生听不到老师声音
	const S_1="";
	//老师听不到学生声音
	const S_2="";
	//学生卡在加载语音服务
	const S_3="";
	//老师卡在加载语音服务
	const S_4="";
	//学生卡在加载白板
	const S_5="";
	//老师卡在加载白板
	const S_6="";
	//学生白板中图片无法显示
	const S_7="";
	//老师白板中图片无法显示
	const S_8="";
	//进出白板次数过多
	const S_9="";
	//网络错误1001
	const S_10="";
	//声音卡顿
	const S_11="";
	//老师无法加载讲义
	const S_12="";
	//学生无法加载讲义
	const S_13="";
	//白板中出现遗留或莫名图片划线
	const S_14="";



};
