<?php
//自动生成枚举类  不要手工修改
//source  file: config_message_type.php
namespace  App\Enums;

class Emessage_type extends \App\Enums\Enum_base
{
	static public $field_name = "message_type"  ;
	static public $name = "message_type"  ;
	 static $desc_map= array(
		1001 => "提醒学生上课",
		1002 => "订单支付",
		1003 => "即将上课",
		1004 => "今日测评",
		1005 => "作业已批",
		1006 => "测评已批",
		1007 => "系统消息",
		1008 => "收到消息",
		1009 => "新增作业",
		1010 => "礼品状态",
		1011 => "测评开始",
		1012 => "作业未完成",
		1013 => "讲课视频完成",
		1014 => "测评已批阅",
		1015 => "视频生成",
		1016 => "反馈报告",
		2001 => "有课要上",
		2002 => "批改pdf作业",
		2003 => "批改测评",
		2004 => "即将上课",
		2005 => "上传讲义",
		2006 => "上传作业",
		2007 => "批改题库作业",
		2008 => "上传试卷",
		2009 => "批改试卷",
		2010 => "系统消息",
		2011 => "课堂反馈报告",
		2012 => "1对1反馈报告未填写",
		2013 => "1对1重新评价",
		3001 => "学生未写作业",
		3002 => "老师未批作业",
		3003 => "到点未做测评",
		3004 => "测评未批改",
		3005 => "测评未tongguo",
		4001 => "即将上课",
		4002 => "已经下课",
		4003 => "作业批改完成",
		4004 => "测评批改完成",
		4005 => "收到消息",
		4006 => "生成订单",
		4007 => "测评开始",
		4008 => "作业未完成",
		4009 => "讲课视频录制完成",
		4010 => "测评已评价",
		4011 => "升学头条",
		4012 => "政策百科",
		4013 => "视频生成",
		4014 => "系统消息",
		4015 => "新增作业",
	);
	 static $simple_desc_map= array(
		1001 => "",
		1002 => "",
		1003 => "",
		1004 => "",
		1005 => "",
		1006 => "",
		1007 => "",
		1008 => "",
		1009 => "",
		1010 => "",
		1011 => "",
		1012 => "",
		1013 => "",
		1014 => "",
		1015 => "",
		1016 => "",
		2001 => "",
		2002 => "",
		2003 => "",
		2004 => "",
		2005 => "",
		2006 => "",
		2007 => "",
		2008 => "",
		2009 => "",
		2010 => "",
		2011 => "",
		2012 => "",
		2013 => "",
		3001 => "",
		3002 => "",
		3003 => "",
		3004 => "",
		3005 => "",
		4001 => "",
		4002 => "",
		4003 => "",
		4004 => "",
		4005 => "",
		4006 => "",
		4007 => "",
		4008 => "",
		4009 => "",
		4010 => "",
		4011 => "",
		4012 => "",
		4013 => "",
		4014 => "",
		4015 => "",
	);
	 static $s2v_map= array(
		"" => 1001,
		"" => 1002,
		"" => 1003,
		"" => 1004,
		"" => 1005,
		"" => 1006,
		"" => 1007,
		"" => 1008,
		"" => 1009,
		"" => 1010,
		"" => 1011,
		"" => 1012,
		"" => 1013,
		"" => 1014,
		"" => 1015,
		"" => 1016,
		"" => 2001,
		"" => 2002,
		"" => 2003,
		"" => 2004,
		"" => 2005,
		"" => 2006,
		"" => 2007,
		"" => 2008,
		"" => 2009,
		"" => 2010,
		"" => 2011,
		"" => 2012,
		"" => 2013,
		"" => 3001,
		"" => 3002,
		"" => 3003,
		"" => 3004,
		"" => 3005,
		"" => 4001,
		"" => 4002,
		"" => 4003,
		"" => 4004,
		"" => 4005,
		"" => 4006,
		"" => 4007,
		"" => 4008,
		"" => 4009,
		"" => 4010,
		"" => 4011,
		"" => 4012,
		"" => 4013,
		"" => 4014,
		"" => 4015,
	);
	 static $v2s_map= array(
		 1001=>  "",
		 1002=>  "",
		 1003=>  "",
		 1004=>  "",
		 1005=>  "",
		 1006=>  "",
		 1007=>  "",
		 1008=>  "",
		 1009=>  "",
		 1010=>  "",
		 1011=>  "",
		 1012=>  "",
		 1013=>  "",
		 1014=>  "",
		 1015=>  "",
		 1016=>  "",
		 2001=>  "",
		 2002=>  "",
		 2003=>  "",
		 2004=>  "",
		 2005=>  "",
		 2006=>  "",
		 2007=>  "",
		 2008=>  "",
		 2009=>  "",
		 2010=>  "",
		 2011=>  "",
		 2012=>  "",
		 2013=>  "",
		 3001=>  "",
		 3002=>  "",
		 3003=>  "",
		 3004=>  "",
		 3005=>  "",
		 4001=>  "",
		 4002=>  "",
		 4003=>  "",
		 4004=>  "",
		 4005=>  "",
		 4006=>  "",
		 4007=>  "",
		 4008=>  "",
		 4009=>  "",
		 4010=>  "",
		 4011=>  "",
		 4012=>  "",
		 4013=>  "",
		 4014=>  "",
		 4015=>  "",
	);

	//提醒学生上课
	const V_1001=1001;
	//订单支付
	const V_1002=1002;
	//即将上课
	const V_1003=1003;
	//今日测评
	const V_1004=1004;
	//作业已批
	const V_1005=1005;
	//测评已批
	const V_1006=1006;
	//系统消息
	const V_1007=1007;
	//收到消息
	const V_1008=1008;
	//新增作业
	const V_1009=1009;
	//礼品状态
	const V_1010=1010;
	//测评开始
	const V_1011=1011;
	//作业未完成
	const V_1012=1012;
	//讲课视频完成
	const V_1013=1013;
	//测评已批阅
	const V_1014=1014;
	//视频生成
	const V_1015=1015;
	//反馈报告
	const V_1016=1016;
	//有课要上
	const V_2001=2001;
	//批改pdf作业
	const V_2002=2002;
	//批改测评
	const V_2003=2003;
	//即将上课
	const V_2004=2004;
	//上传讲义
	const V_2005=2005;
	//上传作业
	const V_2006=2006;
	//批改题库作业
	const V_2007=2007;
	//上传试卷
	const V_2008=2008;
	//批改试卷
	const V_2009=2009;
	//系统消息
	const V_2010=2010;
	//课堂反馈报告
	const V_2011=2011;
	//1对1反馈报告未填写
	const V_2012=2012;
	//1对1重新评价
	const V_2013=2013;
	//学生未写作业
	const V_3001=3001;
	//老师未批作业
	const V_3002=3002;
	//到点未做测评
	const V_3003=3003;
	//测评未批改
	const V_3004=3004;
	//测评未tongguo
	const V_3005=3005;
	//即将上课
	const V_4001=4001;
	//已经下课
	const V_4002=4002;
	//作业批改完成
	const V_4003=4003;
	//测评批改完成
	const V_4004=4004;
	//收到消息
	const V_4005=4005;
	//生成订单
	const V_4006=4006;
	//测评开始
	const V_4007=4007;
	//作业未完成
	const V_4008=4008;
	//讲课视频录制完成
	const V_4009=4009;
	//测评已评价
	const V_4010=4010;
	//升学头条
	const V_4011=4011;
	//政策百科
	const V_4012=4012;
	//视频生成
	const V_4013=4013;
	//系统消息
	const V_4014=4014;
	//新增作业
	const V_4015=4015;

	//提醒学生上课
	const S_1001="";
	//订单支付
	const S_1002="";
	//即将上课
	const S_1003="";
	//今日测评
	const S_1004="";
	//作业已批
	const S_1005="";
	//测评已批
	const S_1006="";
	//系统消息
	const S_1007="";
	//收到消息
	const S_1008="";
	//新增作业
	const S_1009="";
	//礼品状态
	const S_1010="";
	//测评开始
	const S_1011="";
	//作业未完成
	const S_1012="";
	//讲课视频完成
	const S_1013="";
	//测评已批阅
	const S_1014="";
	//视频生成
	const S_1015="";
	//反馈报告
	const S_1016="";
	//有课要上
	const S_2001="";
	//批改pdf作业
	const S_2002="";
	//批改测评
	const S_2003="";
	//即将上课
	const S_2004="";
	//上传讲义
	const S_2005="";
	//上传作业
	const S_2006="";
	//批改题库作业
	const S_2007="";
	//上传试卷
	const S_2008="";
	//批改试卷
	const S_2009="";
	//系统消息
	const S_2010="";
	//课堂反馈报告
	const S_2011="";
	//1对1反馈报告未填写
	const S_2012="";
	//1对1重新评价
	const S_2013="";
	//学生未写作业
	const S_3001="";
	//老师未批作业
	const S_3002="";
	//到点未做测评
	const S_3003="";
	//测评未批改
	const S_3004="";
	//测评未tongguo
	const S_3005="";
	//即将上课
	const S_4001="";
	//已经下课
	const S_4002="";
	//作业批改完成
	const S_4003="";
	//测评批改完成
	const S_4004="";
	//收到消息
	const S_4005="";
	//生成订单
	const S_4006="";
	//测评开始
	const S_4007="";
	//作业未完成
	const S_4008="";
	//讲课视频录制完成
	const S_4009="";
	//测评已评价
	const S_4010="";
	//升学头条
	const S_4011="";
	//政策百科
	const S_4012="";
	//视频生成
	const S_4013="";
	//系统消息
	const S_4014="";
	//新增作业
	const S_4015="";



};
