<?php
//自动生成枚举类  不要手工修改
//source  file: config_pic_usage_type.php
namespace  App\Enums;

class Epic_usage_type extends \App\Core\Enum_base
{
	static public $field_name = "pic_usage_type"  ;
	static public $name = "pic_usage_type"  ;
	 static $desc_map= array(
		101 => "小学图标",
		102 => "初中图标",
		103 => "广告闪图",
		104 => "家长端轮播图",
		201 => "学生端主页图标",
		202 => "学生服饰",
		203 => "学生头饰",
		204 => "男老师服饰",
		205 => "女老师服饰",
		206 => "活动背景",
		207 => "1v1课程图片",
		208 => "主页轮播图",
		209 => "推送消息图标",
		210 => "商城轮播图",
		211 => "公开课课程图片",
		212 => "小班课课程图片",
		301 => "网页轮播图",
		9901 => "老师帮二维码",
		9999 => "其他",
	);
	 static $simple_desc_map= array(
		101 => "",
		102 => "",
		103 => "",
		104 => "",
		201 => "",
		202 => "",
		203 => "",
		204 => "",
		205 => "",
		206 => "",
		207 => "",
		208 => "",
		209 => "",
		210 => "",
		211 => "",
		212 => "",
		301 => "",
		9901 => "",
		9999 => "",
	);
	 static $s2v_map= array(
		"" => 101,
		"" => 102,
		"" => 103,
		"" => 104,
		"" => 201,
		"" => 202,
		"" => 203,
		"" => 204,
		"" => 205,
		"" => 206,
		"" => 207,
		"" => 208,
		"" => 209,
		"" => 210,
		"" => 211,
		"" => 212,
		"" => 301,
		"" => 9901,
		"" => 9999,
	);
	 static $v2s_map= array(
		 101=>  "",
		 102=>  "",
		 103=>  "",
		 104=>  "",
		 201=>  "",
		 202=>  "",
		 203=>  "",
		 204=>  "",
		 205=>  "",
		 206=>  "",
		 207=>  "",
		 208=>  "",
		 209=>  "",
		 210=>  "",
		 211=>  "",
		 212=>  "",
		 301=>  "",
		 9901=>  "",
		 9999=>  "",
	);

	//小学图标
	const V_101=101;
	//初中图标
	const V_102=102;
	//广告闪图
	const V_103=103;
	//家长端轮播图
	const V_104=104;
	//学生端主页图标
	const V_201=201;
	//学生服饰
	const V_202=202;
	//学生头饰
	const V_203=203;
	//男老师服饰
	const V_204=204;
	//女老师服饰
	const V_205=205;
	//活动背景
	const V_206=206;
	//1v1课程图片
	const V_207=207;
	//主页轮播图
	const V_208=208;
	//推送消息图标
	const V_209=209;
	//商城轮播图
	const V_210=210;
	//公开课课程图片
	const V_211=211;
	//小班课课程图片
	const V_212=212;
	//网页轮播图
	const V_301=301;
	//老师帮二维码
	const V_9901=9901;
	//其他
	const V_9999=9999;

	//小学图标
	const S_101="";
	//初中图标
	const S_102="";
	//广告闪图
	const S_103="";
	//家长端轮播图
	const S_104="";
	//学生端主页图标
	const S_201="";
	//学生服饰
	const S_202="";
	//学生头饰
	const S_203="";
	//男老师服饰
	const S_204="";
	//女老师服饰
	const S_205="";
	//活动背景
	const S_206="";
	//1v1课程图片
	const S_207="";
	//主页轮播图
	const S_208="";
	//推送消息图标
	const S_209="";
	//商城轮播图
	const S_210="";
	//公开课课程图片
	const S_211="";
	//小班课课程图片
	const S_212="";
	//网页轮播图
	const S_301="";
	//老师帮二维码
	const S_9901="";
	//其他
	const S_9999="";



};
