<?php
//自动生成枚举类  不要手工修改
//source  file: config_praise.php
namespace  App\Enums;

class Epraise extends \App\Core\Enum_base
{
	static public $field_name = "praise"  ;
	static public $name = "praise"  ;
	 static $desc_map= array(
		1001 => "准时上课",
		1002 => "课堂表现",
		1003 => "作业得A",
		1004 => "作业得B",
		1005 => "测试95-100",
		1006 => "测试85-94",
		1007 => "进入测评",
		1008 => "取消兑换",
		1009 => "上传头像",
		1010 => "邀请好友注册",
		1011 => "邀请好友买课",
		1012 => "更新到新版本",
		1013 => "查看讲义",
		1014 => "查看视频",
		1015 => "课前测试",
		1016 => "评价老师",
		1017 => "完成阶段小测",
		1018 => "购课满10次",
		1019 => "购课满30次",
		1020 => "购课满50次",
		1021 => "购课满70次",
		1022 => "生日",
		1023 => "淘米一日游",
		1024 => "系统发放得普通题",
		1025 => "系统发放得抢答题",
		1026 => "系统发放得抽查题",
		1027 => "老师每次给予的赞数",
		1028 => "",
		1029 => "购课赠送",
		1030 => "家长绑定公众号赠送",
		1099 => "后台添加",
		2000 => "",
		2001 => "兑换礼品",
		2002 => "",
		2003 => "退费扣赞",
	);
	 static $simple_desc_map= array(
		1001 => "",
		1002 => "",
		1003 => "",
		1004 => "",
		1005 => "",
		1006 => "",
		1007 => "",
		1008 => "",
		1009 => "",
		1010 => "",
		1011 => "",
		1012 => "",
		1013 => "",
		1014 => "",
		1015 => "",
		1016 => "",
		1017 => "",
		1018 => "",
		1019 => "",
		1020 => "",
		1021 => "",
		1022 => "",
		1023 => "",
		1024 => "",
		1025 => "",
		1026 => "",
		1027 => "",
		1028 => "",
		1029 => "",
		1030 => "",
		1099 => "",
		2000 => "",
		2001 => "",
		2002 => "",
		2003 => "",
	);
	 static $s2v_map= array(
		"" => 1001,
		"" => 1002,
		"" => 1003,
		"" => 1004,
		"" => 1005,
		"" => 1006,
		"" => 1007,
		"" => 1008,
		"" => 1009,
		"" => 1010,
		"" => 1011,
		"" => 1012,
		"" => 1013,
		"" => 1014,
		"" => 1015,
		"" => 1016,
		"" => 1017,
		"" => 1018,
		"" => 1019,
		"" => 1020,
		"" => 1021,
		"" => 1022,
		"" => 1023,
		"" => 1024,
		"" => 1025,
		"" => 1026,
		"" => 1027,
		"" => 1028,
		"" => 1029,
		"" => 1030,
		"" => 1099,
		"" => 2000,
		"" => 2001,
		"" => 2002,
		"" => 2003,
	);
	 static $v2s_map= array(
		 1001=>  "",
		 1002=>  "",
		 1003=>  "",
		 1004=>  "",
		 1005=>  "",
		 1006=>  "",
		 1007=>  "",
		 1008=>  "",
		 1009=>  "",
		 1010=>  "",
		 1011=>  "",
		 1012=>  "",
		 1013=>  "",
		 1014=>  "",
		 1015=>  "",
		 1016=>  "",
		 1017=>  "",
		 1018=>  "",
		 1019=>  "",
		 1020=>  "",
		 1021=>  "",
		 1022=>  "",
		 1023=>  "",
		 1024=>  "",
		 1025=>  "",
		 1026=>  "",
		 1027=>  "",
		 1028=>  "",
		 1029=>  "",
		 1030=>  "",
		 1099=>  "",
		 2000=>  "",
		 2001=>  "",
		 2002=>  "",
		 2003=>  "",
	);

	//准时上课
	const V_1001=1001;
	//课堂表现
	const V_1002=1002;
	//作业得A
	const V_1003=1003;
	//作业得B
	const V_1004=1004;
	//测试95-100
	const V_1005=1005;
	//测试85-94
	const V_1006=1006;
	//进入测评
	const V_1007=1007;
	//取消兑换
	const V_1008=1008;
	//上传头像
	const V_1009=1009;
	//邀请好友注册
	const V_1010=1010;
	//邀请好友买课
	const V_1011=1011;
	//更新到新版本
	const V_1012=1012;
	//查看讲义
	const V_1013=1013;
	//查看视频
	const V_1014=1014;
	//课前测试
	const V_1015=1015;
	//评价老师
	const V_1016=1016;
	//完成阶段小测
	const V_1017=1017;
	//购课满10次
	const V_1018=1018;
	//购课满30次
	const V_1019=1019;
	//购课满50次
	const V_1020=1020;
	//购课满70次
	const V_1021=1021;
	//生日
	const V_1022=1022;
	//淘米一日游
	const V_1023=1023;
	//系统发放得普通题
	const V_1024=1024;
	//系统发放得抢答题
	const V_1025=1025;
	//系统发放得抽查题
	const V_1026=1026;
	//老师每次给予的赞数
	const V_1027=1027;
	//
	const V_1028=1028;
	//购课赠送
	const V_1029=1029;
	//家长绑定公众号赠送
	const V_1030=1030;
	//后台添加
	const V_1099=1099;
	//
	const V_2000=2000;
	//兑换礼品
	const V_2001=2001;
	//
	const V_2002=2002;
	//退费扣赞
	const V_2003=2003;

	//准时上课
	const S_1001="";
	//课堂表现
	const S_1002="";
	//作业得A
	const S_1003="";
	//作业得B
	const S_1004="";
	//测试95-100
	const S_1005="";
	//测试85-94
	const S_1006="";
	//进入测评
	const S_1007="";
	//取消兑换
	const S_1008="";
	//上传头像
	const S_1009="";
	//邀请好友注册
	const S_1010="";
	//邀请好友买课
	const S_1011="";
	//更新到新版本
	const S_1012="";
	//查看讲义
	const S_1013="";
	//查看视频
	const S_1014="";
	//课前测试
	const S_1015="";
	//评价老师
	const S_1016="";
	//完成阶段小测
	const S_1017="";
	//购课满10次
	const S_1018="";
	//购课满30次
	const S_1019="";
	//购课满50次
	const S_1020="";
	//购课满70次
	const S_1021="";
	//生日
	const S_1022="";
	//淘米一日游
	const S_1023="";
	//系统发放得普通题
	const S_1024="";
	//系统发放得抢答题
	const S_1025="";
	//系统发放得抽查题
	const S_1026="";
	//老师每次给予的赞数
	const S_1027="";
	//
	const S_1028="";
	//购课赠送
	const S_1029="";
	//家长绑定公众号赠送
	const S_1030="";
	//后台添加
	const S_1099="";
	//
	const S_2000="";
	//兑换礼品
	const S_2001="";
	//
	const S_2002="";
	//退费扣赞
	const S_2003="";



};
