<?php
//自动生成枚举类  不要手工修改
//source  file: config_question_grade.php
namespace  App\Enums;

class Equestion_grade extends \App\Core\Enum_base
{
	static public $field_name = "question_grade"  ;
	static public $name = "question_grade"  ;
	 static $desc_map= array(
		100 => "小学",
		200 => "初中",
		300 => "高中",
		101 => "小一",
		102 => "小二",
		103 => "小三",
		104 => "小四",
		105 => "小五",
		106 => "小六",
		201 => "初一",
		202 => "初二",
		203 => "初三",
		301 => "高一",
		302 => "高二",
		303 => "高三",
	);
	 static $simple_desc_map= array(
		100 => "",
		200 => "",
		300 => "",
		101 => "",
		102 => "",
		103 => "",
		104 => "",
		105 => "",
		106 => "",
		201 => "",
		202 => "",
		203 => "",
		301 => "",
		302 => "",
		303 => "",
	);
	 static $s2v_map= array(
		"" => 100,
		"" => 200,
		"" => 300,
		"" => 101,
		"" => 102,
		"" => 103,
		"" => 104,
		"" => 105,
		"" => 106,
		"" => 201,
		"" => 202,
		"" => 203,
		"" => 301,
		"" => 302,
		"" => 303,
	);
	 static $v2s_map= array(
		 100=>  "",
		 200=>  "",
		 300=>  "",
		 101=>  "",
		 102=>  "",
		 103=>  "",
		 104=>  "",
		 105=>  "",
		 106=>  "",
		 201=>  "",
		 202=>  "",
		 203=>  "",
		 301=>  "",
		 302=>  "",
		 303=>  "",
	);

	//小学
	const V_100=100;
	//初中
	const V_200=200;
	//高中
	const V_300=300;
	//小一
	const V_101=101;
	//小二
	const V_102=102;
	//小三
	const V_103=103;
	//小四
	const V_104=104;
	//小五
	const V_105=105;
	//小六
	const V_106=106;
	//初一
	const V_201=201;
	//初二
	const V_202=202;
	//初三
	const V_203=203;
	//高一
	const V_301=301;
	//高二
	const V_302=302;
	//高三
	const V_303=303;

	//小学
	const S_100="";
	//初中
	const S_200="";
	//高中
	const S_300="";
	//小一
	const S_101="";
	//小二
	const S_102="";
	//小三
	const S_103="";
	//小四
	const S_104="";
	//小五
	const S_105="";
	//小六
	const S_106="";
	//初一
	const S_201="";
	//初二
	const S_202="";
	//初三
	const S_203="";
	//高一
	const S_301="";
	//高二
	const S_302="";
	//高三
	const S_303="";



};
