<?php
//自动生成枚举类  不要手工修改
//source  file: config_region_version.php
namespace  App\Enums;

class Eregion_version extends \App\Core\Enum_base
{
	static public $field_name = "region_version"  ;
	static public $name = "region_version"  ;
	 static $desc_map= array(
		0 => "未设置",
		1 => "人教五四新版",
		2 => "人教五四版",
		3 => "人教新版",
		4 => "人教版",
		5 => "冀教新版",
		6 => "冀教版",
		7 => "北京课改新版",
		8 => "北京课改版",
		9 => "北师大版",
		10 => "华师大新版",
		11 => "华师大版",
		12 => "沪教版",
		13 => "沪科新版",
		14 => "沪科版",
		15 => "浙教新版",
		16 => "浙教版",
		17 => "湘教新版",
		18 => "湘教版",
		19 => "苏科新版",
		20 => "苏科版",
		21 => "青岛版",
		22 => "鲁教新版",
		23 => "鲁教版",
		24 => "外研版（江苏凤凰出版社）",
		25 => "外研版（外语教学与研究出版社）",
		26 => "语文出版社A版",
		27 => "语文出版社S版",
		28 => "粤教版",
		29 => "苏教版",
		30 => "山东版",
		31 => "浙科版",
		32 => "地理-中国版",
		30001 => "英语-上海牛津",
		30002 => "英语-译林牛津",
		30003 => "英语-新世纪",
		30004 => "英语-苏教版",
		30005 => "英语-人教新版（精通版）",
		30006 => "英语-灵通少儿英语",
		30007 => "英语-人教新起点（一起）",
		30008 => "英语-人教PEP（三起）",
		30009 => "英语-PEP新起点（一起）",
		30010 => "英语-外研新标准 （一起）",
		30011 => "英语-外研新标准 （三起）",
		30012 => "英语-闽教（三起）",
		30013 => "英语-北师大（一起）",
		30014 => "英语-北师大（三起）",
		30015 => "英语-仁爱版",
		30016 => "英语-鲁教版",
		30017 => "英语-湘鲁版",
		30018 => "英语-冀教版",
		30019 => "英语-广州教科版",
		30020 => "英语-闽教（三起）",
		30021 => "英语-北京版",
		30022 => "英语-清华大学版",
		30023 => "英语-福建教育出版社",
		30024 => "英语-青岛出版社",
		30025 => "英语-科普版",
		30026 => "英语-四川教育出版社",
		30027 => "英语-重庆大学出版社",
		30028 => "英语-青少年新概念",
		30029 => "英语-成人版新概念",
		30030 => "英语-3E",
		30031 => "英语-全能五星",
		30032 => "英语-剑桥小学英语",
		30033 => "英语-香港朗文",
	);
	 static $simple_desc_map= array(
		0 => "",
		1 => "",
		2 => "",
		3 => "",
		4 => "",
		5 => "",
		6 => "",
		7 => "",
		8 => "",
		9 => "",
		10 => "",
		11 => "",
		12 => "",
		13 => "",
		14 => "",
		15 => "",
		16 => "",
		17 => "",
		18 => "",
		19 => "",
		20 => "",
		21 => "",
		22 => "",
		23 => "",
		24 => "",
		25 => "",
		26 => "",
		27 => "",
		28 => "",
		29 => "",
		30 => "",
		31 => "",
		32 => "",
		30001 => "",
		30002 => "",
		30003 => "",
		30004 => "",
		30005 => "",
		30006 => "",
		30007 => "",
		30008 => "",
		30009 => "",
		30010 => "",
		30011 => "",
		30012 => "",
		30013 => "",
		30014 => "",
		30015 => "",
		30016 => "",
		30017 => "",
		30018 => "",
		30019 => "",
		30020 => "",
		30021 => "",
		30022 => "",
		30023 => "",
		30024 => "",
		30025 => "",
		30026 => "",
		30027 => "",
		30028 => "",
		30029 => "",
		30030 => "",
		30031 => "",
		30032 => "",
		30033 => "",
	);
	 static $s2v_map= array(
		"" => 0,
		"" => 1,
		"" => 2,
		"" => 3,
		"" => 4,
		"" => 5,
		"" => 6,
		"" => 7,
		"" => 8,
		"" => 9,
		"" => 10,
		"" => 11,
		"" => 12,
		"" => 13,
		"" => 14,
		"" => 15,
		"" => 16,
		"" => 17,
		"" => 18,
		"" => 19,
		"" => 20,
		"" => 21,
		"" => 22,
		"" => 23,
		"" => 24,
		"" => 25,
		"" => 26,
		"" => 27,
		"" => 28,
		"" => 29,
		"" => 30,
		"" => 31,
		"" => 32,
		"" => 30001,
		"" => 30002,
		"" => 30003,
		"" => 30004,
		"" => 30005,
		"" => 30006,
		"" => 30007,
		"" => 30008,
		"" => 30009,
		"" => 30010,
		"" => 30011,
		"" => 30012,
		"" => 30013,
		"" => 30014,
		"" => 30015,
		"" => 30016,
		"" => 30017,
		"" => 30018,
		"" => 30019,
		"" => 30020,
		"" => 30021,
		"" => 30022,
		"" => 30023,
		"" => 30024,
		"" => 30025,
		"" => 30026,
		"" => 30027,
		"" => 30028,
		"" => 30029,
		"" => 30030,
		"" => 30031,
		"" => 30032,
		"" => 30033,
	);
	 static $v2s_map= array(
		 0=>  "",
		 1=>  "",
		 2=>  "",
		 3=>  "",
		 4=>  "",
		 5=>  "",
		 6=>  "",
		 7=>  "",
		 8=>  "",
		 9=>  "",
		 10=>  "",
		 11=>  "",
		 12=>  "",
		 13=>  "",
		 14=>  "",
		 15=>  "",
		 16=>  "",
		 17=>  "",
		 18=>  "",
		 19=>  "",
		 20=>  "",
		 21=>  "",
		 22=>  "",
		 23=>  "",
		 24=>  "",
		 25=>  "",
		 26=>  "",
		 27=>  "",
		 28=>  "",
		 29=>  "",
		 30=>  "",
		 31=>  "",
		 32=>  "",
		 30001=>  "",
		 30002=>  "",
		 30003=>  "",
		 30004=>  "",
		 30005=>  "",
		 30006=>  "",
		 30007=>  "",
		 30008=>  "",
		 30009=>  "",
		 30010=>  "",
		 30011=>  "",
		 30012=>  "",
		 30013=>  "",
		 30014=>  "",
		 30015=>  "",
		 30016=>  "",
		 30017=>  "",
		 30018=>  "",
		 30019=>  "",
		 30020=>  "",
		 30021=>  "",
		 30022=>  "",
		 30023=>  "",
		 30024=>  "",
		 30025=>  "",
		 30026=>  "",
		 30027=>  "",
		 30028=>  "",
		 30029=>  "",
		 30030=>  "",
		 30031=>  "",
		 30032=>  "",
		 30033=>  "",
	);

	//未设置
	const V_0=0;
	//人教五四新版
	const V_1=1;
	//人教五四版
	const V_2=2;
	//人教新版
	const V_3=3;
	//人教版
	const V_4=4;
	//冀教新版
	const V_5=5;
	//冀教版
	const V_6=6;
	//北京课改新版
	const V_7=7;
	//北京课改版
	const V_8=8;
	//北师大版
	const V_9=9;
	//华师大新版
	const V_10=10;
	//华师大版
	const V_11=11;
	//沪教版
	const V_12=12;
	//沪科新版
	const V_13=13;
	//沪科版
	const V_14=14;
	//浙教新版
	const V_15=15;
	//浙教版
	const V_16=16;
	//湘教新版
	const V_17=17;
	//湘教版
	const V_18=18;
	//苏科新版
	const V_19=19;
	//苏科版
	const V_20=20;
	//青岛版
	const V_21=21;
	//鲁教新版
	const V_22=22;
	//鲁教版
	const V_23=23;
	//外研版（江苏凤凰出版社）
	const V_24=24;
	//外研版（外语教学与研究出版社）
	const V_25=25;
	//语文出版社A版
	const V_26=26;
	//语文出版社S版
	const V_27=27;
	//粤教版
	const V_28=28;
	//苏教版
	const V_29=29;
	//山东版
	const V_30=30;
	//浙科版
	const V_31=31;
	//地理-中国版
	const V_32=32;
	//英语-上海牛津
	const V_30001=30001;
	//英语-译林牛津
	const V_30002=30002;
	//英语-新世纪
	const V_30003=30003;
	//英语-苏教版
	const V_30004=30004;
	//英语-人教新版（精通版）
	const V_30005=30005;
	//英语-灵通少儿英语
	const V_30006=30006;
	//英语-人教新起点（一起）
	const V_30007=30007;
	//英语-人教PEP（三起）
	const V_30008=30008;
	//英语-PEP新起点（一起）
	const V_30009=30009;
	//英语-外研新标准 （一起）
	const V_30010=30010;
	//英语-外研新标准 （三起）
	const V_30011=30011;
	//英语-闽教（三起）
	const V_30012=30012;
	//英语-北师大（一起）
	const V_30013=30013;
	//英语-北师大（三起）
	const V_30014=30014;
	//英语-仁爱版
	const V_30015=30015;
	//英语-鲁教版
	const V_30016=30016;
	//英语-湘鲁版
	const V_30017=30017;
	//英语-冀教版
	const V_30018=30018;
	//英语-广州教科版
	const V_30019=30019;
	//英语-闽教（三起）
	const V_30020=30020;
	//英语-北京版
	const V_30021=30021;
	//英语-清华大学版
	const V_30022=30022;
	//英语-福建教育出版社
	const V_30023=30023;
	//英语-青岛出版社
	const V_30024=30024;
	//英语-科普版
	const V_30025=30025;
	//英语-四川教育出版社
	const V_30026=30026;
	//英语-重庆大学出版社
	const V_30027=30027;
	//英语-青少年新概念
	const V_30028=30028;
	//英语-成人版新概念
	const V_30029=30029;
	//英语-3E
	const V_30030=30030;
	//英语-全能五星
	const V_30031=30031;
	//英语-剑桥小学英语
	const V_30032=30032;
	//英语-香港朗文
	const V_30033=30033;

	//未设置
	const S_0="";
	//人教五四新版
	const S_1="";
	//人教五四版
	const S_2="";
	//人教新版
	const S_3="";
	//人教版
	const S_4="";
	//冀教新版
	const S_5="";
	//冀教版
	const S_6="";
	//北京课改新版
	const S_7="";
	//北京课改版
	const S_8="";
	//北师大版
	const S_9="";
	//华师大新版
	const S_10="";
	//华师大版
	const S_11="";
	//沪教版
	const S_12="";
	//沪科新版
	const S_13="";
	//沪科版
	const S_14="";
	//浙教新版
	const S_15="";
	//浙教版
	const S_16="";
	//湘教新版
	const S_17="";
	//湘教版
	const S_18="";
	//苏科新版
	const S_19="";
	//苏科版
	const S_20="";
	//青岛版
	const S_21="";
	//鲁教新版
	const S_22="";
	//鲁教版
	const S_23="";
	//外研版（江苏凤凰出版社）
	const S_24="";
	//外研版（外语教学与研究出版社）
	const S_25="";
	//语文出版社A版
	const S_26="";
	//语文出版社S版
	const S_27="";
	//粤教版
	const S_28="";
	//苏教版
	const S_29="";
	//山东版
	const S_30="";
	//浙科版
	const S_31="";
	//地理-中国版
	const S_32="";
	//英语-上海牛津
	const S_30001="";
	//英语-译林牛津
	const S_30002="";
	//英语-新世纪
	const S_30003="";
	//英语-苏教版
	const S_30004="";
	//英语-人教新版（精通版）
	const S_30005="";
	//英语-灵通少儿英语
	const S_30006="";
	//英语-人教新起点（一起）
	const S_30007="";
	//英语-人教PEP（三起）
	const S_30008="";
	//英语-PEP新起点（一起）
	const S_30009="";
	//英语-外研新标准 （一起）
	const S_30010="";
	//英语-外研新标准 （三起）
	const S_30011="";
	//英语-闽教（三起）
	const S_30012="";
	//英语-北师大（一起）
	const S_30013="";
	//英语-北师大（三起）
	const S_30014="";
	//英语-仁爱版
	const S_30015="";
	//英语-鲁教版
	const S_30016="";
	//英语-湘鲁版
	const S_30017="";
	//英语-冀教版
	const S_30018="";
	//英语-广州教科版
	const S_30019="";
	//英语-闽教（三起）
	const S_30020="";
	//英语-北京版
	const S_30021="";
	//英语-清华大学版
	const S_30022="";
	//英语-福建教育出版社
	const S_30023="";
	//英语-青岛出版社
	const S_30024="";
	//英语-科普版
	const S_30025="";
	//英语-四川教育出版社
	const S_30026="";
	//英语-重庆大学出版社
	const S_30027="";
	//英语-青少年新概念
	const S_30028="";
	//英语-成人版新概念
	const S_30029="";
	//英语-3E
	const S_30030="";
	//英语-全能五星
	const S_30031="";
	//英语-剑桥小学英语
	const S_30032="";
	//英语-香港朗文
	const S_30033="";



};
