<?php
//自动生成枚举类  不要手工修改
//source  file: config_seller_student_sub_status.php
namespace  App\Enums;

class Eseller_student_sub_status extends \App\Enums\Enum_base
{
	static public $field_name = "seller_student_sub_status"  ;
	static public $name = "子状态"  ;
	 static $desc_map= array(
		0 => "无",
		1001 => "无效-空号",
		1002 => "无效-停机",
		1003 => "无效-号码错误",
		1004 => "无效-不接电话",
		1005 => "无效-秒挂",
		1006 => "无效-无意向",
		1007 => "无效-没时间",
		1008 => "无效-价格贵",
		1009 => "无效-设备问题",
		1010 => "无效-网络问题",
		1011 => "无效-其他",
	);
	 static $simple_desc_map= array(
		0 => "",
		1001 => "",
		1002 => "",
		1003 => "",
		1004 => "",
		1005 => "",
		1006 => "",
		1007 => "",
		1008 => "",
		1009 => "",
		1010 => "",
		1011 => "",
	);
	 static $s2v_map= array(
		"" => 0,
		"" => 1001,
		"" => 1002,
		"" => 1003,
		"" => 1004,
		"" => 1005,
		"" => 1006,
		"" => 1007,
		"" => 1008,
		"" => 1009,
		"" => 1010,
		"" => 1011,
	);
	 static $v2s_map= array(
		 0=>  "",
		 1001=>  "",
		 1002=>  "",
		 1003=>  "",
		 1004=>  "",
		 1005=>  "",
		 1006=>  "",
		 1007=>  "",
		 1008=>  "",
		 1009=>  "",
		 1010=>  "",
		 1011=>  "",
	);

	//无
	const V_0=0;
	//无效-空号
	const V_1001=1001;
	//无效-停机
	const V_1002=1002;
	//无效-号码错误
	const V_1003=1003;
	//无效-不接电话
	const V_1004=1004;
	//无效-秒挂
	const V_1005=1005;
	//无效-无意向
	const V_1006=1006;
	//无效-没时间
	const V_1007=1007;
	//无效-价格贵
	const V_1008=1008;
	//无效-设备问题
	const V_1009=1009;
	//无效-网络问题
	const V_1010=1010;
	//无效-其他
	const V_1011=1011;

	//无
	const S_0="";
	//无效-空号
	const S_1001="";
	//无效-停机
	const S_1002="";
	//无效-号码错误
	const S_1003="";
	//无效-不接电话
	const S_1004="";
	//无效-秒挂
	const S_1005="";
	//无效-无意向
	const S_1006="";
	//无效-没时间
	const S_1007="";
	//无效-价格贵
	const S_1008="";
	//无效-设备问题
	const S_1009="";
	//无效-网络问题
	const S_1010="";
	//无效-其他
	const S_1011="";



};
