<?php
//自动生成枚举类  不要手工修改
//source  file: config_sh_area.php
namespace  App\Enums;

class Esh_area extends \App\Enums\Enum_base
{
	static public $field_name = "sh_area"  ;
	static public $name = "sh_area"  ;
	 static $desc_map= array(
		101 => "黄浦",
		102 => "徐汇",
		103 => "长宁",
		104 => "静安",
		105 => "普陀",
		106 => "虹口",
		107 => "杨浦",
		108 => "闵行",
		109 => "宝山",
		111 => "嘉定",
		112 => "浦东新区",
		113 => "金山",
		114 => "松江",
		115 => "青浦",
		116 => "奉贤",
		117 => "崇明县",
		118 => "闸北区",
	);
	 static $simple_desc_map= array(
		101 => "",
		102 => "",
		103 => "",
		104 => "",
		105 => "",
		106 => "",
		107 => "",
		108 => "",
		109 => "",
		111 => "",
		112 => "",
		113 => "",
		114 => "",
		115 => "",
		116 => "",
		117 => "",
		118 => "",
	);
	 static $s2v_map= array(
		"" => 101,
		"" => 102,
		"" => 103,
		"" => 104,
		"" => 105,
		"" => 106,
		"" => 107,
		"" => 108,
		"" => 109,
		"" => 111,
		"" => 112,
		"" => 113,
		"" => 114,
		"" => 115,
		"" => 116,
		"" => 117,
		"" => 118,
	);
	 static $v2s_map= array(
		 101=>  "",
		 102=>  "",
		 103=>  "",
		 104=>  "",
		 105=>  "",
		 106=>  "",
		 107=>  "",
		 108=>  "",
		 109=>  "",
		 111=>  "",
		 112=>  "",
		 113=>  "",
		 114=>  "",
		 115=>  "",
		 116=>  "",
		 117=>  "",
		 118=>  "",
	);

	//黄浦
	const V_101=101;
	//徐汇
	const V_102=102;
	//长宁
	const V_103=103;
	//静安
	const V_104=104;
	//普陀
	const V_105=105;
	//虹口
	const V_106=106;
	//杨浦
	const V_107=107;
	//闵行
	const V_108=108;
	//宝山
	const V_109=109;
	//嘉定
	const V_111=111;
	//浦东新区
	const V_112=112;
	//金山
	const V_113=113;
	//松江
	const V_114=114;
	//青浦
	const V_115=115;
	//奉贤
	const V_116=116;
	//崇明县
	const V_117=117;
	//闸北区
	const V_118=118;

	//黄浦
	const S_101="";
	//徐汇
	const S_102="";
	//长宁
	const S_103="";
	//静安
	const S_104="";
	//普陀
	const S_105="";
	//虹口
	const S_106="";
	//杨浦
	const S_107="";
	//闵行
	const S_108="";
	//宝山
	const S_109="";
	//嘉定
	const S_111="";
	//浦东新区
	const S_112="";
	//金山
	const S_113="";
	//松江
	const S_114="";
	//青浦
	const S_115="";
	//奉贤
	const S_116="";
	//崇明县
	const S_117="";
	//闸北区
	const S_118="";



};
