<?php
//自动生成枚举类  不要手工修改
//source  file: config_test_lesson_order_fail_flag.php
namespace  App\Enums;

class Etest_lesson_order_fail_flag extends \App\Core\Enum_base
{
	static public $field_name = "test_lesson_order_fail_flag"  ;
	static public $name = "test_lesson_order_fail_flag"  ;
	 static $desc_map= array(
		0 => "未设置",
		1001 => "自身原因-只是想尝试下免费课程，本身没有需求",
		1002 => "自身原因-学生完全抗拒学习",
		1003 => "自身原因-完全不信任在线教育模式",
		1004 => "自身原因-学生学习习惯较差，不适应在线教育",
		1101 => "价格原因-完全接受不了价格，应该比线下低很多",
		1102 => "价格原因-价格能接受，但是比其他在线教育机构贵",
		1103 => "价格原因-课程单价能接受，但总价太高",
		1201 => "品牌信任度-相比其他教育机构理优口碑较差",
		1202 => "品牌信任度-接受在线教育，但对理优品牌不信任",
		1301 => "教学能力-上课没有课件",
		1302 => "教学能力-备课内容与试听需求是否匹配",
		1303 => "教学能力-课件的质量（课件的层次感，逻辑感）",
		1304 => "教学能力-技巧，知识点讲解与练习比例过多，或过少",
		1305 => "教学能力-填鸭式教学，学生过于被动，发言过少",
		1306 => "教学能力-板书凌乱，没有必要的板书，板书内容太多太杂",
		1307 => "教学能力-讲解节奏过慢/过快",
		1308 => "教学能力-讲题方法思路错误",
		1309 => "教学能力-知识点讲解错误",
		1310 => "教学能力-抓不住重难点",
		1311 => "教学能力-课本内容不熟悉",
		1312 => "教学能力-解题错误",
		1313 => "教学能力-语言组织能力差，表达不清，无逻辑或反应迟缓，发音不标准",
		1401 => "教学态度-态度恶劣，争吵、侮辱或谩骂学生，打击学生自信心，",
		1402 => "教学态度-吃东西，浏览无关网站，闲聊，玩手机，接听电话，收发快递",
		1403 => "教学态度-议论其他员工、推荐其他机构，使用其他机构材料",
		1501 => "产品问题-软件操作复杂",
		1502 => "产品问题-上课时网络断卡现象严重，影响上课",
		1503 => "产品问题-上课时一直听不到声音，看不到老师讲义",
		1504 => "产品问题-老师那边背景环境嘈杂，影响听课质量",
		1601 => "时间问题-约了课程没有时间上",
		1602 => "时间问题-服务流程复杂不想上了",
		1603 => "时间问题-排课后学生家长联系不上",
		1604 => "时间问题-确定好时间后学生没有来上课",
		1605 => "长期未确定默认为无效",
	);
	 static $simple_desc_map= array(
		0 => "",
		1001 => "",
		1002 => "",
		1003 => "",
		1004 => "",
		1101 => "",
		1102 => "",
		1103 => "",
		1201 => "",
		1202 => "",
		1301 => "",
		1302 => "",
		1303 => "",
		1304 => "",
		1305 => "",
		1306 => "",
		1307 => "",
		1308 => "",
		1309 => "",
		1310 => "",
		1311 => "",
		1312 => "",
		1313 => "",
		1401 => "",
		1402 => "",
		1403 => "",
		1501 => "",
		1502 => "",
		1503 => "",
		1504 => "",
		1601 => "",
		1602 => "",
		1603 => "",
		1604 => "",
		1605 => "",
	);
	 static $s2v_map= array(
		"" => 0,
		"" => 1001,
		"" => 1002,
		"" => 1003,
		"" => 1004,
		"" => 1101,
		"" => 1102,
		"" => 1103,
		"" => 1201,
		"" => 1202,
		"" => 1301,
		"" => 1302,
		"" => 1303,
		"" => 1304,
		"" => 1305,
		"" => 1306,
		"" => 1307,
		"" => 1308,
		"" => 1309,
		"" => 1310,
		"" => 1311,
		"" => 1312,
		"" => 1313,
		"" => 1401,
		"" => 1402,
		"" => 1403,
		"" => 1501,
		"" => 1502,
		"" => 1503,
		"" => 1504,
		"" => 1601,
		"" => 1602,
		"" => 1603,
		"" => 1604,
		"" => 1605,
	);
	 static $v2s_map= array(
		 0=>  "",
		 1001=>  "",
		 1002=>  "",
		 1003=>  "",
		 1004=>  "",
		 1101=>  "",
		 1102=>  "",
		 1103=>  "",
		 1201=>  "",
		 1202=>  "",
		 1301=>  "",
		 1302=>  "",
		 1303=>  "",
		 1304=>  "",
		 1305=>  "",
		 1306=>  "",
		 1307=>  "",
		 1308=>  "",
		 1309=>  "",
		 1310=>  "",
		 1311=>  "",
		 1312=>  "",
		 1313=>  "",
		 1401=>  "",
		 1402=>  "",
		 1403=>  "",
		 1501=>  "",
		 1502=>  "",
		 1503=>  "",
		 1504=>  "",
		 1601=>  "",
		 1602=>  "",
		 1603=>  "",
		 1604=>  "",
		 1605=>  "",
	);

	//未设置
	const V_0=0;
	//自身原因-只是想尝试下免费课程，本身没有需求
	const V_1001=1001;
	//自身原因-学生完全抗拒学习
	const V_1002=1002;
	//自身原因-完全不信任在线教育模式
	const V_1003=1003;
	//自身原因-学生学习习惯较差，不适应在线教育
	const V_1004=1004;
	//价格原因-完全接受不了价格，应该比线下低很多
	const V_1101=1101;
	//价格原因-价格能接受，但是比其他在线教育机构贵
	const V_1102=1102;
	//价格原因-课程单价能接受，但总价太高
	const V_1103=1103;
	//品牌信任度-相比其他教育机构理优口碑较差
	const V_1201=1201;
	//品牌信任度-接受在线教育，但对理优品牌不信任
	const V_1202=1202;
	//教学能力-上课没有课件
	const V_1301=1301;
	//教学能力-备课内容与试听需求是否匹配
	const V_1302=1302;
	//教学能力-课件的质量（课件的层次感，逻辑感）
	const V_1303=1303;
	//教学能力-技巧，知识点讲解与练习比例过多，或过少
	const V_1304=1304;
	//教学能力-填鸭式教学，学生过于被动，发言过少
	const V_1305=1305;
	//教学能力-板书凌乱，没有必要的板书，板书内容太多太杂
	const V_1306=1306;
	//教学能力-讲解节奏过慢/过快
	const V_1307=1307;
	//教学能力-讲题方法思路错误
	const V_1308=1308;
	//教学能力-知识点讲解错误
	const V_1309=1309;
	//教学能力-抓不住重难点
	const V_1310=1310;
	//教学能力-课本内容不熟悉
	const V_1311=1311;
	//教学能力-解题错误
	const V_1312=1312;
	//教学能力-语言组织能力差，表达不清，无逻辑或反应迟缓，发音不标准
	const V_1313=1313;
	//教学态度-态度恶劣，争吵、侮辱或谩骂学生，打击学生自信心，
	const V_1401=1401;
	//教学态度-吃东西，浏览无关网站，闲聊，玩手机，接听电话，收发快递
	const V_1402=1402;
	//教学态度-议论其他员工、推荐其他机构，使用其他机构材料
	const V_1403=1403;
	//产品问题-软件操作复杂
	const V_1501=1501;
	//产品问题-上课时网络断卡现象严重，影响上课
	const V_1502=1502;
	//产品问题-上课时一直听不到声音，看不到老师讲义
	const V_1503=1503;
	//产品问题-老师那边背景环境嘈杂，影响听课质量
	const V_1504=1504;
	//时间问题-约了课程没有时间上
	const V_1601=1601;
	//时间问题-服务流程复杂不想上了
	const V_1602=1602;
	//时间问题-排课后学生家长联系不上
	const V_1603=1603;
	//时间问题-确定好时间后学生没有来上课
	const V_1604=1604;
	//长期未确定默认为无效
	const V_1605=1605;

	//未设置
	const S_0="";
	//自身原因-只是想尝试下免费课程，本身没有需求
	const S_1001="";
	//自身原因-学生完全抗拒学习
	const S_1002="";
	//自身原因-完全不信任在线教育模式
	const S_1003="";
	//自身原因-学生学习习惯较差，不适应在线教育
	const S_1004="";
	//价格原因-完全接受不了价格，应该比线下低很多
	const S_1101="";
	//价格原因-价格能接受，但是比其他在线教育机构贵
	const S_1102="";
	//价格原因-课程单价能接受，但总价太高
	const S_1103="";
	//品牌信任度-相比其他教育机构理优口碑较差
	const S_1201="";
	//品牌信任度-接受在线教育，但对理优品牌不信任
	const S_1202="";
	//教学能力-上课没有课件
	const S_1301="";
	//教学能力-备课内容与试听需求是否匹配
	const S_1302="";
	//教学能力-课件的质量（课件的层次感，逻辑感）
	const S_1303="";
	//教学能力-技巧，知识点讲解与练习比例过多，或过少
	const S_1304="";
	//教学能力-填鸭式教学，学生过于被动，发言过少
	const S_1305="";
	//教学能力-板书凌乱，没有必要的板书，板书内容太多太杂
	const S_1306="";
	//教学能力-讲解节奏过慢/过快
	const S_1307="";
	//教学能力-讲题方法思路错误
	const S_1308="";
	//教学能力-知识点讲解错误
	const S_1309="";
	//教学能力-抓不住重难点
	const S_1310="";
	//教学能力-课本内容不熟悉
	const S_1311="";
	//教学能力-解题错误
	const S_1312="";
	//教学能力-语言组织能力差，表达不清，无逻辑或反应迟缓，发音不标准
	const S_1313="";
	//教学态度-态度恶劣，争吵、侮辱或谩骂学生，打击学生自信心，
	const S_1401="";
	//教学态度-吃东西，浏览无关网站，闲聊，玩手机，接听电话，收发快递
	const S_1402="";
	//教学态度-议论其他员工、推荐其他机构，使用其他机构材料
	const S_1403="";
	//产品问题-软件操作复杂
	const S_1501="";
	//产品问题-上课时网络断卡现象严重，影响上课
	const S_1502="";
	//产品问题-上课时一直听不到声音，看不到老师讲义
	const S_1503="";
	//产品问题-老师那边背景环境嘈杂，影响听课质量
	const S_1504="";
	//时间问题-约了课程没有时间上
	const S_1601="";
	//时间问题-服务流程复杂不想上了
	const S_1602="";
	//时间问题-排课后学生家长联系不上
	const S_1603="";
	//时间问题-确定好时间后学生没有来上课
	const S_1604="";
	//长期未确定默认为无效
	const S_1605="";



};
