<?php
//自动生成枚举类  不要手工修改
//source  file: config_test_lesson_fail_flag.php
namespace  App\Enums;

class Etest_lesson_fail_flag extends \App\Core\Enum_base
{
	static public $field_name = "test_lesson_fail_flag"  ;
	static public $name = "出错类型"  ;
	 static $desc_map= array(
		0 => "未设置",
		1 => "[付] 学生未到/课程取消",
		2 => "[付] 换时间/学生设备网络出错",
		3 => "[付]其它",
		100 => "[不付] 课程取消",
		101 => "[不付] 老师未到",
		102 => "[不付] 老师原因",
		103 => "[不付] 换时间 ",
		104 => "[不付] 换老师",
		105 => "[不付] 排课出错 ",
		106 => "[不付] 学生未到/课程取消 ",
		107 => "[不付] 换时间/学生设备出错 ",
		108 => "[不付] 换老师/课程取消 ",
		109 => "[不付] 老师未到/旷课 ",
		110 => "[不付] 看错时间/抢错试听课 ",
		111 => "[不付] 内容不全/试卷/教材不清楚 ",
		112 => "[不付] 老师有常规课冲突 ",
		113 => "[不付] 老师个人原因 ",
		130 => "[不付] 其他 ",
	);
	 static $simple_desc_map= array(
		0 => "",
		1 => "",
		2 => "",
		3 => "",
		100 => "",
		101 => "",
		102 => "",
		103 => "",
		104 => "",
		105 => "",
		106 => "",
		107 => "",
		108 => "",
		109 => "",
		110 => "",
		111 => "",
		112 => "",
		113 => "",
		130 => "",
	);
	 static $s2v_map= array(
		"" => 0,
		"" => 1,
		"" => 2,
		"" => 3,
		"" => 100,
		"" => 101,
		"" => 102,
		"" => 103,
		"" => 104,
		"" => 105,
		"" => 106,
		"" => 107,
		"" => 108,
		"" => 109,
		"" => 110,
		"" => 111,
		"" => 112,
		"" => 113,
		"" => 130,
	);
	 static $v2s_map= array(
		 0=>  "",
		 1=>  "",
		 2=>  "",
		 3=>  "",
		 100=>  "",
		 101=>  "",
		 102=>  "",
		 103=>  "",
		 104=>  "",
		 105=>  "",
		 106=>  "",
		 107=>  "",
		 108=>  "",
		 109=>  "",
		 110=>  "",
		 111=>  "",
		 112=>  "",
		 113=>  "",
		 130=>  "",
	);

	//未设置
	const V_0=0;
	//[付] 学生未到/课程取消
	const V_1=1;
	//[付] 换时间/学生设备网络出错
	const V_2=2;
	//[付]其它
	const V_3=3;
	//[不付] 课程取消
	const V_100=100;
	//[不付] 老师未到
	const V_101=101;
	//[不付] 老师原因
	const V_102=102;
	//[不付] 换时间 
	const V_103=103;
	//[不付] 换老师
	const V_104=104;
	//[不付] 排课出错 
	const V_105=105;
	//[不付] 学生未到/课程取消 
	const V_106=106;
	//[不付] 换时间/学生设备出错 
	const V_107=107;
	//[不付] 换老师/课程取消 
	const V_108=108;
	//[不付] 老师未到/旷课 
	const V_109=109;
	//[不付] 看错时间/抢错试听课 
	const V_110=110;
	//[不付] 内容不全/试卷/教材不清楚 
	const V_111=111;
	//[不付] 老师有常规课冲突 
	const V_112=112;
	//[不付] 老师个人原因 
	const V_113=113;
	//[不付] 其他 
	const V_130=130;

	//未设置
	const S_0="";
	//[付] 学生未到/课程取消
	const S_1="";
	//[付] 换时间/学生设备网络出错
	const S_2="";
	//[付]其它
	const S_3="";
	//[不付] 课程取消
	const S_100="";
	//[不付] 老师未到
	const S_101="";
	//[不付] 老师原因
	const S_102="";
	//[不付] 换时间 
	const S_103="";
	//[不付] 换老师
	const S_104="";
	//[不付] 排课出错 
	const S_105="";
	//[不付] 学生未到/课程取消 
	const S_106="";
	//[不付] 换时间/学生设备出错 
	const S_107="";
	//[不付] 换老师/课程取消 
	const S_108="";
	//[不付] 老师未到/旷课 
	const S_109="";
	//[不付] 看错时间/抢错试听课 
	const S_110="";
	//[不付] 内容不全/试卷/教材不清楚 
	const S_111="";
	//[不付] 老师有常规课冲突 
	const S_112="";
	//[不付] 老师个人原因 
	const S_113="";
	//[不付] 其他 
	const S_130="";



};
