var g_enum_map={

account_role : {
	desc_map : {
		'0' : "未设置",
		'1' : "助教",
		'2' : "销售",
		'3' : "other"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未设置
		V_0:0,
		//助教
		V_1:1,
		//销售
		V_2:2,
		//other
		V_3:3,

		//未设置
		S_0:"0",
		//助教
		S_1:"1",
		//销售
		S_2:"2",
		//other
		S_3:"3"


},

admin_group : {
	desc_map : {
		'1' : "销售"
	},
	simple_desc_map: {
		'1' : ""
	},
	s2v_map:{
		"1" : 1
	},
	v2s_map:{
		 '1':  "1"
	},

		//销售
		V_1:1,

		//销售
		S_1:"1"


},

ad_status : {
	desc_map : {
		'0' : "不可点击",
		'1' : "可点击"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//不可点击
		V_0:0,
		//可点击
		V_1:1,

		//不可点击
		S_0:"0",
		//可点击
		S_1:"1"


},

assistant_type : {
	desc_map : {
		'1' : "全职",
		'2' : "兼职"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//全职
		V_1:1,
		//兼职
		V_2:2,

		//全职
		S_1:"1",
		//兼职
		S_2:"2"


},

authority : {
	desc_map : {
		'1' : "录入回访",
		'2' : "分配老师",
		'3' : "分配助教",
		'4' : "学员排课",
		'5' : "更改礼品状态",
		'6' : "新增合同",
		'7' : "合同退费",
		'8' : "更改合同状态",
		'9' : "更改退费状态",
		'10' : "录入备注信息",
		'11' : "提交分析报告",
		'12' : "修改学生信息",
		'13' : "设置课程内容",
		'14' : "试听排课",
		'15' : "测评分析",
		'201' : "教师管理",
		'202' : "助教管理",
		'203' : "查看员工绩效",
		'204' : "",
		'301' : "课堂监控",
		'501' : "用户管理",
		'502' : "角色管理",
		'503' : "权限管理",
		'504' : "商城管理"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'204' : "",
		'301' : "",
		'501' : "",
		'502' : "",
		'503' : "",
		'504' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"15" : 15,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"204" : 204,
		"301" : 301,
		"501" : 501,
		"502" : 502,
		"503" : 503,
		"504" : 504
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '15':  "15",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '204':  "204",
		 '301':  "301",
		 '501':  "501",
		 '502':  "502",
		 '503':  "503",
		 '504':  "504"
	},

		//录入回访
		V_1:1,
		//分配老师
		V_2:2,
		//分配助教
		V_3:3,
		//学员排课
		V_4:4,
		//更改礼品状态
		V_5:5,
		//新增合同
		V_6:6,
		//合同退费
		V_7:7,
		//更改合同状态
		V_8:8,
		//更改退费状态
		V_9:9,
		//录入备注信息
		V_10:10,
		//提交分析报告
		V_11:11,
		//修改学生信息
		V_12:12,
		//设置课程内容
		V_13:13,
		//试听排课
		V_14:14,
		//测评分析
		V_15:15,
		//教师管理
		V_201:201,
		//助教管理
		V_202:202,
		//查看员工绩效
		V_203:203,
		//
		V_204:204,
		//课堂监控
		V_301:301,
		//用户管理
		V_501:501,
		//角色管理
		V_502:502,
		//权限管理
		V_503:503,
		//商城管理
		V_504:504,

		//录入回访
		S_1:"1",
		//分配老师
		S_2:"2",
		//分配助教
		S_3:"3",
		//学员排课
		S_4:"4",
		//更改礼品状态
		S_5:"5",
		//新增合同
		S_6:"6",
		//合同退费
		S_7:"7",
		//更改合同状态
		S_8:"8",
		//更改退费状态
		S_9:"9",
		//录入备注信息
		S_10:"10",
		//提交分析报告
		S_11:"11",
		//修改学生信息
		S_12:"12",
		//设置课程内容
		S_13:"13",
		//试听排课
		S_14:"14",
		//测评分析
		S_15:"15",
		//教师管理
		S_201:"201",
		//助教管理
		S_202:"202",
		//查看员工绩效
		S_203:"203",
		//
		S_204:"204",
		//课堂监控
		S_301:"301",
		//用户管理
		S_501:"501",
		//角色管理
		S_502:"502",
		//权限管理
		S_503:"503",
		//商城管理
		S_504:"504"


},

book_grade : {
	desc_map : {
		'0' : "未填写",
		'400' : "学龄前",
		'100' : "小学",
		'101' : "一年级",
		'102' : "二年级",
		'103' : "三年级",
		'104' : "四年级",
		'105' : "五年级",
		'106' : "六年级",
		'201' : "七年级",
		'202' : "八年级",
		'203' : "九年级",
		'300' : "高中",
		'301' : "高一",
		'302' : "高二",
		'303' : "高三"
	},
	simple_desc_map: {
		'0' : "",
		'400' : "",
		'100' : "",
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'105' : "",
		'106' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'300' : "",
		'301' : "",
		'302' : "",
		'303' : ""
	},
	s2v_map:{
		"0" : 0,
		"400" : 400,
		"100" : 100,
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"105" : 105,
		"106" : 106,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"300" : 300,
		"301" : 301,
		"302" : 302,
		"303" : 303
	},
	v2s_map:{
		 '0':  "0",
		 '400':  "400",
		 '100':  "100",
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '105':  "105",
		 '106':  "106",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '300':  "300",
		 '301':  "301",
		 '302':  "302",
		 '303':  "303"
	},

		//未填写
		V_0:0,
		//学龄前
		V_400:400,
		//小学
		V_100:100,
		//一年级
		V_101:101,
		//二年级
		V_102:102,
		//三年级
		V_103:103,
		//四年级
		V_104:104,
		//五年级
		V_105:105,
		//六年级
		V_106:106,
		//七年级
		V_201:201,
		//八年级
		V_202:202,
		//九年级
		V_203:203,
		//高中
		V_300:300,
		//高一
		V_301:301,
		//高二
		V_302:302,
		//高三
		V_303:303,

		//未填写
		S_0:"0",
		//学龄前
		S_400:"400",
		//小学
		S_100:"100",
		//一年级
		S_101:"101",
		//二年级
		S_102:"102",
		//三年级
		S_103:"103",
		//四年级
		S_104:"104",
		//五年级
		S_105:"105",
		//六年级
		S_106:"106",
		//七年级
		S_201:"201",
		//八年级
		S_202:"202",
		//九年级
		S_203:"203",
		//高中
		S_300:"300",
		//高一
		S_301:"301",
		//高二
		S_302:"302",
		//高三
		S_303:"303"


},

book_status : {
	desc_map : {
		'0' : "未回访",
		'1' : "无效资源",
		'2' : "未接通",
		'3' : "有效-意向A档",
		'4' : "有效-意向B档",
		'5' : "有效-意向C档",
		'6' : "已试听-待跟进",
		'7' : "已试听-未签",
		'8' : "已试听-已签",
		'9' : "试听-预约",
		'10' : "试听-已排课",
		'11' : "试听-时间待定",
		'12' : "试听-时间确定",
		'13' : "试听-无法排课",
		'14' : "试听-驳回"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"test_lesson_report" : 9,
		"test_lesson_set_lesson" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "test_lesson_report",
		 '10':  "test_lesson_set_lesson",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14"
	},

		//未回访
		V_0:0,
		//无效资源
		V_1:1,
		//未接通
		V_2:2,
		//有效-意向A档
		V_3:3,
		//有效-意向B档
		V_4:4,
		//有效-意向C档
		V_5:5,
		//已试听-待跟进
		V_6:6,
		//已试听-未签
		V_7:7,
		//已试听-已签
		V_8:8,
		//试听-预约
		V_TEST_LESSON_REPORT:9,
		//试听-已排课
		V_TEST_LESSON_SET_LESSON:10,
		//试听-时间待定
		V_11:11,
		//试听-时间确定
		V_12:12,
		//试听-无法排课
		V_13:13,
		//试听-驳回
		V_14:14,

		//未回访
		S_0:"0",
		//无效资源
		S_1:"1",
		//未接通
		S_2:"2",
		//有效-意向A档
		S_3:"3",
		//有效-意向B档
		S_4:"4",
		//有效-意向C档
		S_5:"5",
		//已试听-待跟进
		S_6:"6",
		//已试听-未签
		S_7:"7",
		//已试听-已签
		S_8:"8",
		//试听-预约
		S_TEST_LESSON_REPORT:"test_lesson_report",
		//试听-已排课
		S_TEST_LESSON_SET_LESSON:"test_lesson_set_lesson",
		//试听-时间待定
		S_11:"11",
		//试听-时间确定
		S_12:"12",
		//试听-无法排课
		S_13:"13",
		//试听-驳回
		S_14:"14"


},

boolean : {
	desc_map : {
		'0' : "否",
		'1' : "是"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//否
		V_0:0,
		//是
		V_1:1,

		//否
		S_0:"0",
		//是
		S_1:"1"


},

can_set : {
	desc_map : {
		'1' : "不可设置",
		'2' : "可设置"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//不可设置
		V_1:1,
		//可设置
		V_2:2,

		//不可设置
		S_1:"1",
		//可设置
		S_2:"2"


},

check_money_flag : {
	desc_map : {
		'0' : "未确认",
		'1' : "有效",
		'2' : "无效"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未确认
		V_0:0,
		//有效
		V_1:1,
		//无效
		V_2:2,

		//未确认
		S_0:"0",
		//有效
		S_1:"1",
		//无效
		S_2:"2"


},

class_time : {
	desc_map : {
		'1' : "已设置",
		'2' : "未设置"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//已设置
		V_1:1,
		//未设置
		V_2:2,

		//已设置
		S_1:"1",
		//未设置
		S_2:"2"


},

click_status : {
	desc_map : {
		'1' : "可点击",
		'0' : "不可点击"
	},
	simple_desc_map: {
		'1' : "",
		'0' : ""
	},
	s2v_map:{
		"1" : 1,
		"0" : 0
	},
	v2s_map:{
		 '1':  "1",
		 '0':  "0"
	},

		//可点击
		V_1:1,
		//不可点击
		V_0:0,

		//可点击
		S_1:"1",
		//不可点击
		S_0:"0"


},

confirm_flag : {
	desc_map : {
		'0' : "未设置",
		'1' : "有效课程",
		'2' : "无效课程-课程取消",
		'3' : "无效课程-需给老师工资"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未设置
		V_0:0,
		//有效课程
		V_1:1,
		//无效课程-课程取消
		V_2:2,
		//无效课程-需给老师工资
		V_3:3,

		//未设置
		S_0:"0",
		//有效课程
		S_1:"1",
		//无效课程-课程取消
		S_2:"2",
		//无效课程-需给老师工资
		S_3:"3"


},

contract_from_type : {
	desc_map : {
		'0' : "新签",
		'1' : "转介绍",
		'10' : "常规续费",
		'11' : "扩课续费"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'10' : "",
		'11' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"10" : 10,
		"11" : 11
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '10':  "10",
		 '11':  "11"
	},

		//新签
		V_0:0,
		//转介绍
		V_1:1,
		//常规续费
		V_10:10,
		//扩课续费
		V_11:11,

		//新签
		S_0:"0",
		//转介绍
		S_1:"1",
		//常规续费
		S_10:"10",
		//扩课续费
		S_11:"11"


},

contract_status : {
	desc_map : {
		'0' : "未付款",
		'1' : "执行中",
		'2' : "已结束",
		'3' : "提前终止"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//未付款
		V_0:0,
		//执行中
		V_1:1,
		//已结束
		V_2:2,
		//提前终止
		V_3:3,

		//未付款
		S_0:"0",
		//执行中
		S_1:"1",
		//已结束
		S_2:"2",
		//提前终止
		S_3:"3"


},

contract_type_ex : {
	desc_map : {
		'0' : "公开课",
		'1' : "1对1",
		'2' : "小班课",
		'3' : "答疑课"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//公开课
		V_0:0,
		//1对1
		V_1:1,
		//小班课
		V_2:2,
		//答疑课
		V_3:3,

		//公开课
		S_0:"0",
		//1对1
		S_1:"1",
		//小班课
		S_2:"2",
		//答疑课
		S_3:"3"


},

contract_type : {
	desc_map : {
		'0' : "常规",
		'1' : "赠送",
		'2' : "试听",
		'3' : "续费",
		'1001' : "普通公开课(A)",
		'1002' : "普通公开课(B)",
		'1003' : "高级公开课",
		'2001' : "公开答疑",
		'3001' : "小班课",
		'4001' : "机器人课程"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'2001' : "",
		'3001' : "",
		'4001' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"open_class" : 1001,
		"1002" : 1002,
		"1003" : 1003,
		"2001" : 2001,
		"small_class" : 3001,
		"copy_open_class" : 4001
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '1001':  "open_class",
		 '1002':  "1002",
		 '1003':  "1003",
		 '2001':  "2001",
		 '3001':  "small_class",
		 '4001':  "copy_open_class"
	},

		//常规
		V_0:0,
		//赠送
		V_1:1,
		//试听
		V_2:2,
		//续费
		V_3:3,
		//普通公开课(A)
		V_OPEN_CLASS:1001,
		//普通公开课(B)
		V_1002:1002,
		//高级公开课
		V_1003:1003,
		//公开答疑
		V_2001:2001,
		//小班课
		V_SMALL_CLASS:3001,
		//机器人课程
		V_COPY_OPEN_CLASS:4001,

		//常规
		S_0:"0",
		//赠送
		S_1:"1",
		//试听
		S_2:"2",
		//续费
		S_3:"3",
		//普通公开课(A)
		S_OPEN_CLASS:"open_class",
		//普通公开课(B)
		S_1002:"1002",
		//高级公开课
		S_1003:"1003",
		//公开答疑
		S_2001:"2001",
		//小班课
		S_SMALL_CLASS:"small_class",
		//机器人课程
		S_COPY_OPEN_CLASS:"copy_open_class"


},

course_status : {
	desc_map : {
		'0' : "正常上课",
		'1' : "正常结课",
		'2' : "退费锁定",
		'3' : "退费成功",
		'4' : "课程切换"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//正常上课
		V_0:0,
		//正常结课
		V_1:1,
		//退费锁定
		V_2:2,
		//退费成功
		V_3:3,
		//课程切换
		V_4:4,

		//正常上课
		S_0:"0",
		//正常结课
		S_1:"1",
		//退费锁定
		S_2:"2",
		//退费成功
		S_3:"3",
		//课程切换
		S_4:"4"


},

degree : {
	desc_map : {
		'0' : "无",
		'1' : "普通",
		'2' : "优秀"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//无
		V_0:0,
		//普通
		V_1:1,
		//优秀
		V_2:2,

		//无
		S_0:"0",
		//普通
		S_1:"1",
		//优秀
		S_2:"2"


},

ency_type : {
	desc_map : {
		'1' : "升学百科",
		'2' : "三大杯赛",
		'3' : "小升初流程",
		'4' : "最贵民办学区",
		'5' : "最贵公办学区",
		'6' : "民办初中排名",
		'7' : "公办初中排名",
		'8' : "民办小学排名",
		'9' : "预录取排名",
		'10' : "高考成绩",
		'99' : "编辑百科标签"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'99' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"99" : 99
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '99':  "99"
	},

		//升学百科
		V_1:1,
		//三大杯赛
		V_2:2,
		//小升初流程
		V_3:3,
		//最贵民办学区
		V_4:4,
		//最贵公办学区
		V_5:5,
		//民办初中排名
		V_6:6,
		//公办初中排名
		V_7:7,
		//民办小学排名
		V_8:8,
		//预录取排名
		V_9:9,
		//高考成绩
		V_10:10,
		//编辑百科标签
		V_99:99,

		//升学百科
		S_1:"1",
		//三大杯赛
		S_2:"2",
		//小升初流程
		S_3:"3",
		//最贵民办学区
		S_4:"4",
		//最贵公办学区
		S_5:"5",
		//民办初中排名
		S_6:"6",
		//公办初中排名
		S_7:"7",
		//民办小学排名
		S_8:"8",
		//预录取排名
		S_9:"9",
		//高考成绩
		S_10:"10",
		//编辑百科标签
		S_99:"99"


},

env : {
	desc_map : {
		'1' : "开发",
		'3' : "外网测试",
		'4' : "外网正式",
		'10' : "phpunit 运行时"
	},
	simple_desc_map: {
		'1' : "",
		'3' : "",
		'4' : "",
		'10' : ""
	},
	s2v_map:{
		"local" : 1,
		"test" : 3,
		"release" : 4,
		"testing" : 10
	},
	v2s_map:{
		 '1':  "local",
		 '3':  "test",
		 '4':  "release",
		 '10':  "testing"
	},

		//开发
		V_LOCAL:1,
		//外网测试
		V_TEST:3,
		//外网正式
		V_RELEASE:4,
		//phpunit 运行时
		V_TESTING:10,

		//开发
		S_LOCAL:"local",
		//外网测试
		S_TEST:"test",
		//外网正式
		S_RELEASE:"release",
		//phpunit 运行时
		S_TESTING:"testing"


},

error : {
	desc_map : {
		'0' : "成功",
		'7000' : "系统错误",
		'7001' : "验证码错误",
		'7002' : "用户名密码错误",
		'7003' : "没有权限",
		'7010' : "没有登录",
		'7020' : "用户不操作",
		'7030' : "",
		'7031' : "",
		'7101' : "",
		'7201' : "非法参数",
		'7202' : "",
		'7301' : "",
		'7401' : "",
		'7402' : ""
	},
	simple_desc_map: {
		'0' : "",
		'7000' : "",
		'7001' : "",
		'7002' : "",
		'7003' : "",
		'7010' : "",
		'7020' : "",
		'7030' : "",
		'7031' : "",
		'7101' : "",
		'7201' : "",
		'7202' : "",
		'7301' : "",
		'7401' : "",
		'7402' : ""
	},
	s2v_map:{
		"success" : 0,
		"system_err" : 7000,
		"wrong_verify_code" : 7001,
		"wrong_account_passwd" : 7002,
		"access_denied" : 7003,
		"not_login" : 7010,
		"user_not_exist" : 7020,
		"not_auth" : 7030,
		"not_permit" : 7031,
		"course_not_available" : 7101,
		"illegal_params" : 7201,
		"illegal_grade" : 7202,
		"course_alerted" : 7301,
		"to_late_to_cancel" : 7401,
		"has_a_teacher" : 7402
	},
	v2s_map:{
		 '0':  "success",
		 '7000':  "system_err",
		 '7001':  "wrong_verify_code",
		 '7002':  "wrong_account_passwd",
		 '7003':  "access_denied",
		 '7010':  "not_login",
		 '7020':  "user_not_exist",
		 '7030':  "not_auth",
		 '7031':  "not_permit",
		 '7101':  "course_not_available",
		 '7201':  "illegal_params",
		 '7202':  "illegal_grade",
		 '7301':  "course_alerted",
		 '7401':  "to_late_to_cancel",
		 '7402':  "has_a_teacher"
	},

		//成功
		V_SUCCESS:0,
		//系统错误
		V_SYSTEM_ERR:7000,
		//验证码错误
		V_WRONG_VERIFY_CODE:7001,
		//用户名密码错误
		V_WRONG_ACCOUNT_PASSWD:7002,
		//没有权限
		V_ACCESS_DENIED:7003,
		//没有登录
		V_NOT_LOGIN:7010,
		//用户不操作
		V_USER_NOT_EXIST:7020,
		//
		V_NOT_AUTH:7030,
		//
		V_NOT_PERMIT:7031,
		//
		V_COURSE_NOT_AVAILABLE:7101,
		//非法参数
		V_ILLEGAL_PARAMS:7201,
		//
		V_ILLEGAL_GRADE:7202,
		//
		V_COURSE_ALERTED:7301,
		//
		V_TO_LATE_TO_CANCEL:7401,
		//
		V_HAS_A_TEACHER:7402,

		//成功
		S_SUCCESS:"success",
		//系统错误
		S_SYSTEM_ERR:"system_err",
		//验证码错误
		S_WRONG_VERIFY_CODE:"wrong_verify_code",
		//用户名密码错误
		S_WRONG_ACCOUNT_PASSWD:"wrong_account_passwd",
		//没有权限
		S_ACCESS_DENIED:"access_denied",
		//没有登录
		S_NOT_LOGIN:"not_login",
		//用户不操作
		S_USER_NOT_EXIST:"user_not_exist",
		//
		S_NOT_AUTH:"not_auth",
		//
		S_NOT_PERMIT:"not_permit",
		//
		S_COURSE_NOT_AVAILABLE:"course_not_available",
		//非法参数
		S_ILLEGAL_PARAMS:"illegal_params",
		//
		S_ILLEGAL_GRADE:"illegal_grade",
		//
		S_COURSE_ALERTED:"course_alerted",
		//
		S_TO_LATE_TO_CANCEL:"to_late_to_cancel",
		//
		S_HAS_A_TEACHER:"has_a_teacher"


},

express_name : {
	desc_map : {
		'0' : "EX_START",
		'1' : "顺丰速运",
		'2' : "申通快递",
		'3' : "中通快递",
		'4' : "圆通快递",
		'5' : "韵达快递",
		'6' : "EX_END"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//EX_START
		V_0:0,
		//顺丰速运
		V_1:1,
		//申通快递
		V_2:2,
		//中通快递
		V_3:3,
		//圆通快递
		V_4:4,
		//韵达快递
		V_5:5,
		//EX_END
		V_6:6,

		//EX_START
		S_0:"0",
		//顺丰速运
		S_1:"1",
		//申通快递
		S_2:"2",
		//中通快递
		S_3:"3",
		//圆通快递
		S_4:"4",
		//韵达快递
		S_5:"5",
		//EX_END
		S_6:"6"


},

freetime : {
	desc_map : {
		'0' : "无空闲",
		'1' : "空闲"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//无空闲
		V_0:0,
		//空闲
		V_1:1,

		//无空闲
		S_0:"0",
		//空闲
		S_1:"1"


},

from_type : {
	desc_map : {
		'0' : "课程包",
		'1' : "按课时计费"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//课程包
		V_0:0,
		//按课时计费
		V_1:1,

		//课程包
		S_0:"0",
		//按课时计费
		S_1:"1"


},

gender : {
	desc_map : {
		'0' : "未设置",
		'1' : "男",
		'2' : "女"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//未设置
		V_0:0,
		//男
		V_1:1,
		//女
		V_2:2,

		//未设置
		S_0:"0",
		//男
		S_1:"1",
		//女
		S_2:"2"


},

gift_status : {
	desc_map : {
		'0' : "待处理",
		'1' : "已发货",
		'2' : "已收货",
		'3' : "已锁定",
		'4' : "已取消"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4"
	},

		//待处理
		V_0:0,
		//已发货
		V_1:1,
		//已收货
		V_2:2,
		//已锁定
		V_3:3,
		//已取消
		V_4:4,

		//待处理
		S_0:"0",
		//已发货
		S_1:"1",
		//已收货
		S_2:"2",
		//已锁定
		S_3:"3",
		//已取消
		S_4:"4"


},

grade_part_ex : {
	desc_map : {
		'1' : "小学",
		'2' : "初中",
		'3' : "高中"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//小学
		V_1:1,
		//初中
		V_2:2,
		//高中
		V_3:3,

		//小学
		S_1:"1",
		//初中
		S_2:"2",
		//高中
		S_3:"3"


},

grade_part : {
	desc_map : {
		'100' : "小学",
		'200' : "初中",
		'300' : "高中"
	},
	simple_desc_map: {
		'100' : "",
		'200' : "",
		'300' : ""
	},
	s2v_map:{
		"100" : 100,
		"200" : 200,
		"300" : 300
	},
	v2s_map:{
		 '100':  "100",
		 '200':  "200",
		 '300':  "300"
	},

		//小学
		V_100:100,
		//初中
		V_200:200,
		//高中
		V_300:300,

		//小学
		S_100:"100",
		//初中
		S_200:"200",
		//高中
		S_300:"300"


},

grade : {
	desc_map : {
		'101' : "小一",
		'102' : "小二",
		'103' : "小三",
		'104' : "小四",
		'105' : "小五",
		'106' : "小六",
		'201' : "初一",
		'202' : "初二",
		'203' : "初三",
		'301' : "高一",
		'302' : "高二",
		'303' : "高三"
	},
	simple_desc_map: {
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'105' : "",
		'106' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'301' : "",
		'302' : "",
		'303' : ""
	},
	s2v_map:{
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"105" : 105,
		"106" : 106,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"301" : 301,
		"302" : 302,
		"303" : 303
	},
	v2s_map:{
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '105':  "105",
		 '106':  "106",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '301':  "301",
		 '302':  "302",
		 '303':  "303"
	},

		//小一
		V_101:101,
		//小二
		V_102:102,
		//小三
		V_103:103,
		//小四
		V_104:104,
		//小五
		V_105:105,
		//小六
		V_106:106,
		//初一
		V_201:201,
		//初二
		V_202:202,
		//初三
		V_203:203,
		//高一
		V_301:301,
		//高二
		V_302:302,
		//高三
		V_303:303,

		//小一
		S_101:"101",
		//小二
		S_102:"102",
		//小三
		S_103:"103",
		//小四
		S_104:"104",
		//小五
		S_105:"105",
		//小六
		S_106:"106",
		//初一
		S_201:"201",
		//初二
		S_202:"202",
		//初三
		S_203:"203",
		//高一
		S_301:"301",
		//高二
		S_302:"302",
		//高三
		S_303:"303"


},

grade_type : {
	desc_map : {
		'0' : "公开课",
		'1' : "1对1",
		'2' : "小班课"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//公开课
		V_0:0,
		//1对1
		V_1:1,
		//小班课
		V_2:2,

		//公开课
		S_0:"0",
		//1对1
		S_1:"1",
		//小班课
		S_2:"2"


},

is_invoice : {
	desc_map : {
		'0' : "不需要",
		'2' : "需要"
	},
	simple_desc_map: {
		'0' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '2':  "2"
	},

		//不需要
		V_0:0,
		//需要
		V_2:2,

		//不需要
		S_0:"0",
		//需要
		S_2:"2"


},

is_top : {
	desc_map : {
		'1' : "1",
		'2' : "2",
		'3' : "3",
		'4' : "4",
		'5' : "5",
		'6' : "6"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//1
		V_1:1,
		//2
		V_2:2,
		//3
		V_3:3,
		//4
		V_4:4,
		//5
		V_5:5,
		//6
		V_6:6,

		//1
		S_1:"1",
		//2
		S_2:"2",
		//3
		S_3:"3",
		//4
		S_4:"4",
		//5
		S_5:"5",
		//6
		S_6:"6"


},

lesson_count_level : {
	desc_map : {
		'1' : "0-9",
		'2' : "10-29",
		'3' : "30-49",
		'4' : "50-69",
		'5' : "70-99",
		'6' : "100-119",
		'7' : ">=120"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//0-9
		V_1:1,
		//10-29
		V_2:2,
		//30-49
		V_3:3,
		//50-69
		V_4:4,
		//70-99
		V_5:5,
		//100-119
		V_6:6,
		//>=120
		V_7:7,

		//0-9
		S_1:"1",
		//10-29
		S_2:"2",
		//30-49
		S_3:"3",
		//50-69
		S_4:"4",
		//70-99
		S_5:"5",
		//100-119
		S_6:"6",
		//>=120
		S_7:"7"


},

lesson_error : {
	desc_map : {
		'1' : "学生听不到老师声音",
		'2' : "老师听不到学生声音",
		'3' : "学生卡在加载语音服务",
		'4' : "老师卡在加载语音服务",
		'5' : "学生卡在加载白板",
		'6' : "老师卡在加载白板",
		'7' : "学生白板中图片无法显示",
		'8' : "老师白板中图片无法显示",
		'9' : "进出白板次数过多",
		'10' : "网络错误1001",
		'11' : "声音卡顿",
		'12' : "老师无法加载讲义",
		'13' : "学生无法加载讲义",
		'14' : "白板中出现遗留或莫名图片划线"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14"
	},

		//学生听不到老师声音
		V_1:1,
		//老师听不到学生声音
		V_2:2,
		//学生卡在加载语音服务
		V_3:3,
		//老师卡在加载语音服务
		V_4:4,
		//学生卡在加载白板
		V_5:5,
		//老师卡在加载白板
		V_6:6,
		//学生白板中图片无法显示
		V_7:7,
		//老师白板中图片无法显示
		V_8:8,
		//进出白板次数过多
		V_9:9,
		//网络错误1001
		V_10:10,
		//声音卡顿
		V_11:11,
		//老师无法加载讲义
		V_12:12,
		//学生无法加载讲义
		V_13:13,
		//白板中出现遗留或莫名图片划线
		V_14:14,

		//学生听不到老师声音
		S_1:"1",
		//老师听不到学生声音
		S_2:"2",
		//学生卡在加载语音服务
		S_3:"3",
		//老师卡在加载语音服务
		S_4:"4",
		//学生卡在加载白板
		S_5:"5",
		//老师卡在加载白板
		S_6:"6",
		//学生白板中图片无法显示
		S_7:"7",
		//老师白板中图片无法显示
		S_8:"8",
		//进出白板次数过多
		S_9:"9",
		//网络错误1001
		S_10:"10",
		//声音卡顿
		S_11:"11",
		//老师无法加载讲义
		S_12:"12",
		//学生无法加载讲义
		S_13:"13",
		//白板中出现遗留或莫名图片划线
		S_14:"14"


},

lesson_status : {
	desc_map : {
		'0' : "未开始",
		'1' : "进行中",
		'2' : "已结束",
		'3' : "课程终结或取消"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"no_start" : 0,
		"start" : 1,
		"end" : 2,
		"course_finish" : 3
	},
	v2s_map:{
		 '0':  "no_start",
		 '1':  "start",
		 '2':  "end",
		 '3':  "course_finish"
	},

		//未开始
		V_NO_START:0,
		//进行中
		V_START:1,
		//已结束
		V_END:2,
		//课程终结或取消
		V_COURSE_FINISH:3,

		//未开始
		S_NO_START:"no_start",
		//进行中
		S_START:"start",
		//已结束
		S_END:"end",
		//课程终结或取消
		S_COURSE_FINISH:"course_finish"


},

lesson_work_status : {
	desc_map : {
		'0' : "老师未上传",
		'1' : "学生未上传",
		'2' : "未批改",
		'3' : "已批改",
		'4' : "教研已评价",
		'5' : "助教已评价"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//老师未上传
		V_0:0,
		//学生未上传
		V_1:1,
		//未批改
		V_2:2,
		//已批改
		V_3:3,
		//教研已评价
		V_4:4,
		//助教已评价
		V_5:5,

		//老师未上传
		S_0:"0",
		//学生未上传
		S_1:"1",
		//未批改
		S_2:"2",
		//已批改
		S_3:"3",
		//教研已评价
		S_4:"4",
		//助教已评价
		S_5:"5"


},

level : {
	desc_map : {
		'0' : "零级",
		'1' : "一级",
		'2' : "二级",
		'3' : "三级",
		'4' : "四级",
		'5' : "五级",
		'6' : "六级",
		'7' : "七级",
		'8' : "八级",
		'9' : "九级",
		'10' : "十级"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10"
	},

		//零级
		V_0:0,
		//一级
		V_1:1,
		//二级
		V_2:2,
		//三级
		V_3:3,
		//四级
		V_4:4,
		//五级
		V_5:5,
		//六级
		V_6:6,
		//七级
		V_7:7,
		//八级
		V_8:8,
		//九级
		V_9:9,
		//十级
		V_10:10,

		//零级
		S_0:"0",
		//一级
		S_1:"1",
		//二级
		S_2:"2",
		//三级
		S_3:"3",
		//四级
		S_4:"4",
		//五级
		S_5:"5",
		//六级
		S_6:"6",
		//七级
		S_7:"7",
		//八级
		S_8:"8",
		//九级
		S_9:"9",
		//十级
		S_10:"10"


},

opt_type : {
	desc_map : {
		'0' : "get",
		'1' : "sel",
		'2' : "del",
		'3' : "add"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"get" : 0,
		"set" : 1,
		"del" : 2,
		"add" : 3
	},
	v2s_map:{
		 '0':  "get",
		 '1':  "set",
		 '2':  "del",
		 '3':  "add"
	},

		//get
		V_GET:0,
		//sel
		V_SET:1,
		//del
		V_DEL:2,
		//add
		V_ADD:3,

		//get
		S_GET:"get",
		//sel
		S_SET:"set",
		//del
		S_DEL:"del",
		//add
		S_ADD:"add"


},

package_type : {
	desc_map : {
		'1' : "1v1试听课",
		'2' : "1v1定制课",
		'3' : "1v1自选课",
		'1001' : "普通公开课",
		'2001' : "普通答疑课",
		'3001' : "普通小班课"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'1001' : "",
		'2001' : "",
		'3001' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"1001" : 1001,
		"2001" : 2001,
		"3001" : 3001
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '1001':  "1001",
		 '2001':  "2001",
		 '3001':  "3001"
	},

		//1v1试听课
		V_1:1,
		//1v1定制课
		V_2:2,
		//1v1自选课
		V_3:3,
		//普通公开课
		V_1001:1001,
		//普通答疑课
		V_2001:2001,
		//普通小班课
		V_3001:3001,

		//1v1试听课
		S_1:"1",
		//1v1定制课
		S_2:"2",
		//1v1自选课
		S_3:"3",
		//普通公开课
		S_1001:"1001",
		//普通答疑课
		S_2001:"2001",
		//普通小班课
		S_3001:"3001"


},

pad_type : {
	desc_map : {
		'0' : "没有",
		'1' : "ipad",
		'2' : "安卓pad",
		'3' : "其它pad"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//没有
		V_0:0,
		//ipad
		V_1:1,
		//安卓pad
		V_2:2,
		//其它pad
		V_3:3,

		//没有
		S_0:"0",
		//ipad
		S_1:"1",
		//安卓pad
		S_2:"2",
		//其它pad
		S_3:"3"


},

performance : {
	desc_map : {
		'1' : "差",
		'2' : "较差",
		'3' : "一般",
		'4' : "较好",
		'5' : "优秀"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//差
		V_1:1,
		//较差
		V_2:2,
		//一般
		V_3:3,
		//较好
		V_4:4,
		//优秀
		V_5:5,

		//差
		S_1:"1",
		//较差
		S_2:"2",
		//一般
		S_3:"3",
		//较好
		S_4:"4",
		//优秀
		S_5:"5"


},

permission : {
	desc_map : {
		'0' : "无权限",
		'1' : "有权限"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//无权限
		V_0:0,
		//有权限
		V_1:1,

		//无权限
		S_0:"0",
		//有权限
		S_1:"1"


},

pic_time_type : {
	desc_map : {
		'1' : "永久",
		'2' : "一个月",
		'3' : "三个月",
		'4' : "半年",
		'5' : "一年"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//永久
		V_1:1,
		//一个月
		V_2:2,
		//三个月
		V_3:3,
		//半年
		V_4:4,
		//一年
		V_5:5,

		//永久
		S_1:"1",
		//一个月
		S_2:"2",
		//三个月
		S_3:"3",
		//半年
		S_4:"4",
		//一年
		S_5:"5"


},

pic_type : {
	desc_map : {
		'1' : "家长端图片",
		'2' : "学生端图片"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//家长端图片
		V_1:1,
		//学生端图片
		V_2:2,

		//家长端图片
		S_1:"1",
		//学生端图片
		S_2:"2"


},

pic_usage_type : {
	desc_map : {
		'101' : "小学图标",
		'102' : "初中图标",
		'103' : "广告闪图",
		'104' : "活动图",
		'201' : "学生端图标",
		'202' : "学生服饰",
		'203' : "学生头饰",
		'204' : "男老师服饰",
		'205' : "女老师服饰",
		'206' : "活动背景",
		'207' : "默认课程图片",
		'208' : "轮播图",
		'209' : "推送消息图标"
	},
	simple_desc_map: {
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'204' : "",
		'205' : "",
		'206' : "",
		'207' : "",
		'208' : "",
		'209' : ""
	},
	s2v_map:{
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"204" : 204,
		"205" : 205,
		"206" : 206,
		"207" : 207,
		"208" : 208,
		"209" : 209
	},
	v2s_map:{
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '204':  "204",
		 '205':  "205",
		 '206':  "206",
		 '207':  "207",
		 '208':  "208",
		 '209':  "209"
	},

		//小学图标
		V_101:101,
		//初中图标
		V_102:102,
		//广告闪图
		V_103:103,
		//活动图
		V_104:104,
		//学生端图标
		V_201:201,
		//学生服饰
		V_202:202,
		//学生头饰
		V_203:203,
		//男老师服饰
		V_204:204,
		//女老师服饰
		V_205:205,
		//活动背景
		V_206:206,
		//默认课程图片
		V_207:207,
		//轮播图
		V_208:208,
		//推送消息图标
		V_209:209,

		//小学图标
		S_101:"101",
		//初中图标
		S_102:"102",
		//广告闪图
		S_103:"103",
		//活动图
		S_104:"104",
		//学生端图标
		S_201:"201",
		//学生服饰
		S_202:"202",
		//学生头饰
		S_203:"203",
		//男老师服饰
		S_204:"204",
		//女老师服饰
		S_205:"205",
		//活动背景
		S_206:"206",
		//默认课程图片
		S_207:"207",
		//轮播图
		S_208:"208",
		//推送消息图标
		S_209:"209"


},

power : {
	desc_map : {
		'1' : "录入回访",
		'2' : "分配老师",
		'3' : "分配助教",
		'4' : "学员排课",
		'5' : "更改礼品状态",
		'6' : "新增合同",
		'7' : "合同退费",
		'8' : "更改合同状态",
		'9' : "更改退费状态",
		'10' : "录入备注信息",
		'11' : "提交分析报告",
		'12' : "修改学生信息",
		'13' : "设置课程内容",
		'14' : "试听排课",
		'15' : "测评分析",
		'16' : "强制更改金额",
		'20' : "查看合同金额",
		'21' : "查看统计金额",
		'201' : "教师管理",
		'202' : "助教管理",
		'203' : "查看员工绩效",
		'204' : "xx",
		'205' : "助教统计",
		'301' : "课堂监控",
		'401' : "预约管理",
		'402' : "约课管理",
		'410' : "预约管理-分配用户给指定销售",
		'501' : "用户管理",
		'502' : "角色管理",
		'503' : "权限管理",
		'504' : "商城管理",
		'505' : "工具箱－查学校",
		'506' : "消息发送统计",
		'601' : "题库编辑",
		'602' : "题库审核",
		'603' : "题库统计",
		'604' : "再审",
		'801' : "预约统计",
		'1021' : "财务审核"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : "",
		'10' : "",
		'11' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'16' : "",
		'20' : "",
		'21' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'204' : "",
		'205' : "",
		'301' : "",
		'401' : "",
		'402' : "",
		'410' : "",
		'501' : "",
		'502' : "",
		'503' : "",
		'504' : "",
		'505' : "",
		'506' : "",
		'601' : "",
		'602' : "",
		'603' : "",
		'604' : "",
		'801' : "",
		'1021' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"add_contract" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9,
		"10" : 10,
		"11" : 11,
		"12" : 12,
		"13" : 13,
		"14" : 14,
		"15" : 15,
		"16" : 16,
		"show_money" : 20,
		"tongji_show_money" : 21,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"204" : 204,
		"205" : 205,
		"lesson_monitor" : 301,
		"401" : 401,
		"402" : 402,
		"user_book_assign" : 410,
		"501" : 501,
		"502" : 502,
		"503" : 503,
		"504" : 504,
		"505" : 505,
		"506" : 506,
		"question_edit" : 601,
		"question_check" : 602,
		"question_tongji" : 603,
		"question_check2" : 604,
		"yuyue_tongji" : 801,
		"money_check" : 1021
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "add_contract",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9",
		 '10':  "10",
		 '11':  "11",
		 '12':  "12",
		 '13':  "13",
		 '14':  "14",
		 '15':  "15",
		 '16':  "16",
		 '20':  "show_money",
		 '21':  "tongji_show_money",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '204':  "204",
		 '205':  "205",
		 '301':  "lesson_monitor",
		 '401':  "401",
		 '402':  "402",
		 '410':  "user_book_assign",
		 '501':  "501",
		 '502':  "502",
		 '503':  "503",
		 '504':  "504",
		 '505':  "505",
		 '506':  "506",
		 '601':  "question_edit",
		 '602':  "question_check",
		 '603':  "question_tongji",
		 '604':  "question_check2",
		 '801':  "yuyue_tongji",
		 '1021':  "money_check"
	},

		//录入回访
		V_1:1,
		//分配老师
		V_2:2,
		//分配助教
		V_3:3,
		//学员排课
		V_4:4,
		//更改礼品状态
		V_5:5,
		//新增合同
		V_ADD_CONTRACT:6,
		//合同退费
		V_7:7,
		//更改合同状态
		V_8:8,
		//更改退费状态
		V_9:9,
		//录入备注信息
		V_10:10,
		//提交分析报告
		V_11:11,
		//修改学生信息
		V_12:12,
		//设置课程内容
		V_13:13,
		//试听排课
		V_14:14,
		//测评分析
		V_15:15,
		//强制更改金额
		V_16:16,
		//查看合同金额
		V_SHOW_MONEY:20,
		//查看统计金额
		V_TONGJI_SHOW_MONEY:21,
		//教师管理
		V_201:201,
		//助教管理
		V_202:202,
		//查看员工绩效
		V_203:203,
		//xx
		V_204:204,
		//助教统计
		V_205:205,
		//课堂监控
		V_LESSON_MONITOR:301,
		//预约管理
		V_401:401,
		//约课管理
		V_402:402,
		//预约管理-分配用户给指定销售
		V_USER_BOOK_ASSIGN:410,
		//用户管理
		V_501:501,
		//角色管理
		V_502:502,
		//权限管理
		V_503:503,
		//商城管理
		V_504:504,
		//工具箱－查学校
		V_505:505,
		//消息发送统计
		V_506:506,
		//题库编辑
		V_QUESTION_EDIT:601,
		//题库审核
		V_QUESTION_CHECK:602,
		//题库统计
		V_QUESTION_TONGJI:603,
		//再审
		V_QUESTION_CHECK2:604,
		//预约统计
		V_YUYUE_TONGJI:801,
		//财务审核
		V_MONEY_CHECK:1021,

		//录入回访
		S_1:"1",
		//分配老师
		S_2:"2",
		//分配助教
		S_3:"3",
		//学员排课
		S_4:"4",
		//更改礼品状态
		S_5:"5",
		//新增合同
		S_ADD_CONTRACT:"add_contract",
		//合同退费
		S_7:"7",
		//更改合同状态
		S_8:"8",
		//更改退费状态
		S_9:"9",
		//录入备注信息
		S_10:"10",
		//提交分析报告
		S_11:"11",
		//修改学生信息
		S_12:"12",
		//设置课程内容
		S_13:"13",
		//试听排课
		S_14:"14",
		//测评分析
		S_15:"15",
		//强制更改金额
		S_16:"16",
		//查看合同金额
		S_SHOW_MONEY:"show_money",
		//查看统计金额
		S_TONGJI_SHOW_MONEY:"tongji_show_money",
		//教师管理
		S_201:"201",
		//助教管理
		S_202:"202",
		//查看员工绩效
		S_203:"203",
		//xx
		S_204:"204",
		//助教统计
		S_205:"205",
		//课堂监控
		S_LESSON_MONITOR:"lesson_monitor",
		//预约管理
		S_401:"401",
		//约课管理
		S_402:"402",
		//预约管理-分配用户给指定销售
		S_USER_BOOK_ASSIGN:"user_book_assign",
		//用户管理
		S_501:"501",
		//角色管理
		S_502:"502",
		//权限管理
		S_503:"503",
		//商城管理
		S_504:"504",
		//工具箱－查学校
		S_505:"505",
		//消息发送统计
		S_506:"506",
		//题库编辑
		S_QUESTION_EDIT:"question_edit",
		//题库审核
		S_QUESTION_CHECK:"question_check",
		//题库统计
		S_QUESTION_TONGJI:"question_tongji",
		//再审
		S_QUESTION_CHECK2:"question_check2",
		//预约统计
		S_YUYUE_TONGJI:"yuyue_tongji",
		//财务审核
		S_MONEY_CHECK:"money_check"


},

praise : {
	desc_map : {
		'1001' : "准时上课",
		'1002' : "课堂表现",
		'1003' : "作业得A",
		'1004' : "作业得B",
		'1005' : "测试95-100",
		'1006' : "测试85-94",
		'1007' : "进入测评",
		'1008' : "取消兑换",
		'1009' : "上传头像",
		'1010' : "邀请好友注册",
		'1011' : "邀请好友买课",
		'1012' : "更新到新版本",
		'1013' : "查看讲义",
		'1014' : "查看视频",
		'1015' : "课前测试",
		'1016' : "评价老师",
		'1017' : "完成阶段小测",
		'1018' : "购课满10次",
		'1019' : "购课满30次",
		'1020' : "购课满50次",
		'1021' : "购课满70次",
		'1022' : "生日",
		'1023' : "淘米一日游",
		'1024' : "系统发放得普通题",
		'1025' : "系统发放得抢答题",
		'1026' : "系统发放得抽查题",
		'1027' : "老师每次给予的赞数",
		'1028' : "",
		'2000' : "",
		'2001' : "兑换礼品",
		'2002' : ""
	},
	simple_desc_map: {
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1004' : "",
		'1005' : "",
		'1006' : "",
		'1007' : "",
		'1008' : "",
		'1009' : "",
		'1010' : "",
		'1011' : "",
		'1012' : "",
		'1013' : "",
		'1014' : "",
		'1015' : "",
		'1016' : "",
		'1017' : "",
		'1018' : "",
		'1019' : "",
		'1020' : "",
		'1021' : "",
		'1022' : "",
		'1023' : "",
		'1024' : "",
		'1025' : "",
		'1026' : "",
		'1027' : "",
		'1028' : "",
		'2000' : "",
		'2001' : "",
		'2002' : ""
	},
	s2v_map:{
		"1001" : 1001,
		"1002" : 1002,
		"1003" : 1003,
		"1004" : 1004,
		"1005" : 1005,
		"1006" : 1006,
		"1007" : 1007,
		"1008" : 1008,
		"1009" : 1009,
		"1010" : 1010,
		"1011" : 1011,
		"1012" : 1012,
		"1013" : 1013,
		"1014" : 1014,
		"1015" : 1015,
		"1016" : 1016,
		"1017" : 1017,
		"1018" : 1018,
		"1019" : 1019,
		"1020" : 1020,
		"1021" : 1021,
		"1022" : 1022,
		"1023" : 1023,
		"1024" : 1024,
		"1025" : 1025,
		"1026" : 1026,
		"1027" : 1027,
		"1028" : 1028,
		"2000" : 2000,
		"2001" : 2001,
		"2002" : 2002
	},
	v2s_map:{
		 '1001':  "1001",
		 '1002':  "1002",
		 '1003':  "1003",
		 '1004':  "1004",
		 '1005':  "1005",
		 '1006':  "1006",
		 '1007':  "1007",
		 '1008':  "1008",
		 '1009':  "1009",
		 '1010':  "1010",
		 '1011':  "1011",
		 '1012':  "1012",
		 '1013':  "1013",
		 '1014':  "1014",
		 '1015':  "1015",
		 '1016':  "1016",
		 '1017':  "1017",
		 '1018':  "1018",
		 '1019':  "1019",
		 '1020':  "1020",
		 '1021':  "1021",
		 '1022':  "1022",
		 '1023':  "1023",
		 '1024':  "1024",
		 '1025':  "1025",
		 '1026':  "1026",
		 '1027':  "1027",
		 '1028':  "1028",
		 '2000':  "2000",
		 '2001':  "2001",
		 '2002':  "2002"
	},

		//准时上课
		V_1001:1001,
		//课堂表现
		V_1002:1002,
		//作业得A
		V_1003:1003,
		//作业得B
		V_1004:1004,
		//测试95-100
		V_1005:1005,
		//测试85-94
		V_1006:1006,
		//进入测评
		V_1007:1007,
		//取消兑换
		V_1008:1008,
		//上传头像
		V_1009:1009,
		//邀请好友注册
		V_1010:1010,
		//邀请好友买课
		V_1011:1011,
		//更新到新版本
		V_1012:1012,
		//查看讲义
		V_1013:1013,
		//查看视频
		V_1014:1014,
		//课前测试
		V_1015:1015,
		//评价老师
		V_1016:1016,
		//完成阶段小测
		V_1017:1017,
		//购课满10次
		V_1018:1018,
		//购课满30次
		V_1019:1019,
		//购课满50次
		V_1020:1020,
		//购课满70次
		V_1021:1021,
		//生日
		V_1022:1022,
		//淘米一日游
		V_1023:1023,
		//系统发放得普通题
		V_1024:1024,
		//系统发放得抢答题
		V_1025:1025,
		//系统发放得抽查题
		V_1026:1026,
		//老师每次给予的赞数
		V_1027:1027,
		//
		V_1028:1028,
		//
		V_2000:2000,
		//兑换礼品
		V_2001:2001,
		//
		V_2002:2002,

		//准时上课
		S_1001:"1001",
		//课堂表现
		S_1002:"1002",
		//作业得A
		S_1003:"1003",
		//作业得B
		S_1004:"1004",
		//测试95-100
		S_1005:"1005",
		//测试85-94
		S_1006:"1006",
		//进入测评
		S_1007:"1007",
		//取消兑换
		S_1008:"1008",
		//上传头像
		S_1009:"1009",
		//邀请好友注册
		S_1010:"1010",
		//邀请好友买课
		S_1011:"1011",
		//更新到新版本
		S_1012:"1012",
		//查看讲义
		S_1013:"1013",
		//查看视频
		S_1014:"1014",
		//课前测试
		S_1015:"1015",
		//评价老师
		S_1016:"1016",
		//完成阶段小测
		S_1017:"1017",
		//购课满10次
		S_1018:"1018",
		//购课满30次
		S_1019:"1019",
		//购课满50次
		S_1020:"1020",
		//购课满70次
		S_1021:"1021",
		//生日
		S_1022:"1022",
		//淘米一日游
		S_1023:"1023",
		//系统发放得普通题
		S_1024:"1024",
		//系统发放得抢答题
		S_1025:"1025",
		//系统发放得抽查题
		S_1026:"1026",
		//老师每次给予的赞数
		S_1027:"1027",
		//
		S_1028:"1028",
		//
		S_2000:"2000",
		//兑换礼品
		S_2001:"2001",
		//
		S_2002:"2002"


},

process_status : {
	desc_map : {
		'0' : "a,b",
		'1' : "a,b",
		'2' : "a,c,d",
		'3' : "a,f,g",
		'4' : "a,b,g",
		'5' : "a,e",
		'6' : "a,b"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//a,b
		V_0:0,
		//a,b
		V_1:1,
		//a,c,d
		V_2:2,
		//a,f,g
		V_3:3,
		//a,b,g
		V_4:4,
		//a,e
		V_5:5,
		//a,b
		V_6:6,

		//a,b
		S_0:"0",
		//a,b
		S_1:"1",
		//a,c,d
		S_2:"2",
		//a,f,g
		S_3:"3",
		//a,b,g
		S_4:"4",
		//a,e
		S_5:"5",
		//a,b
		S_6:"6"


},

push_status : {
	desc_map : {
		'0' : "未推送",
		'1' : "已推送"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//未推送
		V_0:0,
		//已推送
		V_1:1,

		//未推送
		S_0:"0",
		//已推送
		S_1:"1"


},

push_type : {
	desc_map : {
		'1001' : "PUSH_STUDENT_DAILY_LESSON",
		'1002' : "PUSH_STUDENT_NEW_ORDER",
		'1003' : "PUSH_STUDENT_LESSON_NOTICE",
		'1004' : "PUSH_STUDENT_DAILY_QUIZ",
		'1005' : "PUSH_STUDENT_HOMEWORK_CHECKED",
		'1006' : "PUSH_STUDENT_QUIZ_CHECKED",
		'1007' : "PUSH_STUDENT_SYSTEM_NOTICE",
		'1008' : "PUSH_STUDENT_NORMAL_NOTICE",
		'1009' : "PUSH_STUDENT_NEW_HOMEWORK",
		'1010' : "PUSH_STUDENT_GIFT_SENT"
	},
	simple_desc_map: {
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1004' : "",
		'1005' : "",
		'1006' : "",
		'1007' : "",
		'1008' : "",
		'1009' : "",
		'1010' : ""
	},
	s2v_map:{
		"1001" : 1001,
		"1002" : 1002,
		"1003" : 1003,
		"1004" : 1004,
		"1005" : 1005,
		"1006" : 1006,
		"1007" : 1007,
		"1008" : 1008,
		"1009" : 1009,
		"1010" : 1010
	},
	v2s_map:{
		 '1001':  "1001",
		 '1002':  "1002",
		 '1003':  "1003",
		 '1004':  "1004",
		 '1005':  "1005",
		 '1006':  "1006",
		 '1007':  "1007",
		 '1008':  "1008",
		 '1009':  "1009",
		 '1010':  "1010"
	},

		//PUSH_STUDENT_DAILY_LESSON
		V_1001:1001,
		//PUSH_STUDENT_NEW_ORDER
		V_1002:1002,
		//PUSH_STUDENT_LESSON_NOTICE
		V_1003:1003,
		//PUSH_STUDENT_DAILY_QUIZ
		V_1004:1004,
		//PUSH_STUDENT_HOMEWORK_CHECKED
		V_1005:1005,
		//PUSH_STUDENT_QUIZ_CHECKED
		V_1006:1006,
		//PUSH_STUDENT_SYSTEM_NOTICE
		V_1007:1007,
		//PUSH_STUDENT_NORMAL_NOTICE
		V_1008:1008,
		//PUSH_STUDENT_NEW_HOMEWORK
		V_1009:1009,
		//PUSH_STUDENT_GIFT_SENT
		V_1010:1010,

		//PUSH_STUDENT_DAILY_LESSON
		S_1001:"1001",
		//PUSH_STUDENT_NEW_ORDER
		S_1002:"1002",
		//PUSH_STUDENT_LESSON_NOTICE
		S_1003:"1003",
		//PUSH_STUDENT_DAILY_QUIZ
		S_1004:"1004",
		//PUSH_STUDENT_HOMEWORK_CHECKED
		S_1005:"1005",
		//PUSH_STUDENT_QUIZ_CHECKED
		S_1006:"1006",
		//PUSH_STUDENT_SYSTEM_NOTICE
		S_1007:"1007",
		//PUSH_STUDENT_NORMAL_NOTICE
		S_1008:"1008",
		//PUSH_STUDENT_NEW_HOMEWORK
		S_1009:"1009",
		//PUSH_STUDENT_GIFT_SENT
		S_1010:"1010"


},

question_check_flag : {
	desc_map : {
		'0' : "无",
		'1' : "提交审核",
		'2' : "一审通过",
		'3' : "一审不通过 扣10%",
		'4' : "一审不通过 扣50%",
		'5' : "一审不通过 扣100%",
		'6' : "一审不通过 不入库",
		'12' : "再审通过",
		'13' : "再审不通过 扣10%",
		'14' : "再审不通过 扣50%",
		'15' : "再审不通过 扣100%",
		'16' : "再审不通过 不入库"
	},
	simple_desc_map: {
		'0' : "无",
		'1' : "提交",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'12' : "",
		'13' : "",
		'14' : "",
		'15' : "",
		'16' : ""
	},
	s2v_map:{
		"nopost" : 0,
		"post" : 1,
		"pass" : 2,
		"nopass_10" : 3,
		"nopass_50" : 4,
		"nopass_100" : 5,
		"nopass_del" : 6,
		"pass2" : 12,
		"nopass2_10" : 13,
		"nopass2_50" : 14,
		"nopass2_100" : 15,
		"nopass2_del" : 16
	},
	v2s_map:{
		 '0':  "nopost",
		 '1':  "post",
		 '2':  "pass",
		 '3':  "nopass_10",
		 '4':  "nopass_50",
		 '5':  "nopass_100",
		 '6':  "nopass_del",
		 '12':  "pass2",
		 '13':  "nopass2_10",
		 '14':  "nopass2_50",
		 '15':  "nopass2_100",
		 '16':  "nopass2_del"
	},

		//无
		V_NOPOST:0,
		//提交审核
		V_POST:1,
		//一审通过
		V_PASS:2,
		//一审不通过 扣10%
		V_NOPASS_10:3,
		//一审不通过 扣50%
		V_NOPASS_50:4,
		//一审不通过 扣100%
		V_NOPASS_100:5,
		//一审不通过 不入库
		V_NOPASS_DEL:6,
		//再审通过
		V_PASS2:12,
		//再审不通过 扣10%
		V_NOPASS2_10:13,
		//再审不通过 扣50%
		V_NOPASS2_50:14,
		//再审不通过 扣100%
		V_NOPASS2_100:15,
		//再审不通过 不入库
		V_NOPASS2_DEL:16,

		//无
		S_NOPOST:"nopost",
		//提交审核
		S_POST:"post",
		//一审通过
		S_PASS:"pass",
		//一审不通过 扣10%
		S_NOPASS_10:"nopass_10",
		//一审不通过 扣50%
		S_NOPASS_50:"nopass_50",
		//一审不通过 扣100%
		S_NOPASS_100:"nopass_100",
		//一审不通过 不入库
		S_NOPASS_DEL:"nopass_del",
		//再审通过
		S_PASS2:"pass2",
		//再审不通过 扣10%
		S_NOPASS2_10:"nopass2_10",
		//再审不通过 扣50%
		S_NOPASS2_50:"nopass2_50",
		//再审不通过 扣100%
		S_NOPASS2_100:"nopass2_100",
		//再审不通过 不入库
		S_NOPASS2_DEL:"nopass2_del"


},

question_difficulty : {
	desc_map : {
		'1' : "基础",
		'2' : "中档",
		'3' : "困难"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//基础
		V_1:1,
		//中档
		V_2:2,
		//困难
		V_3:3,

		//基础
		S_1:"1",
		//中档
		S_2:"2",
		//困难
		S_3:"3"


},

question_grade : {
	desc_map : {
		'100' : "小学",
		'200' : "初中",
		'300' : "高中",
		'101' : "小一",
		'102' : "小二",
		'103' : "小三",
		'104' : "小四",
		'105' : "小五",
		'106' : "小六",
		'201' : "初一",
		'202' : "初二",
		'203' : "初三",
		'301' : "高一",
		'302' : "高二",
		'303' : "高三"
	},
	simple_desc_map: {
		'100' : "",
		'200' : "",
		'300' : "",
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'105' : "",
		'106' : "",
		'201' : "",
		'202' : "",
		'203' : "",
		'301' : "",
		'302' : "",
		'303' : ""
	},
	s2v_map:{
		"100" : 100,
		"200" : 200,
		"300" : 300,
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"105" : 105,
		"106" : 106,
		"201" : 201,
		"202" : 202,
		"203" : 203,
		"301" : 301,
		"302" : 302,
		"303" : 303
	},
	v2s_map:{
		 '100':  "100",
		 '200':  "200",
		 '300':  "300",
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '105':  "105",
		 '106':  "106",
		 '201':  "201",
		 '202':  "202",
		 '203':  "203",
		 '301':  "301",
		 '302':  "302",
		 '303':  "303"
	},

		//小学
		V_100:100,
		//初中
		V_200:200,
		//高中
		V_300:300,
		//小一
		V_101:101,
		//小二
		V_102:102,
		//小三
		V_103:103,
		//小四
		V_104:104,
		//小五
		V_105:105,
		//小六
		V_106:106,
		//初一
		V_201:201,
		//初二
		V_202:202,
		//初三
		V_203:203,
		//高一
		V_301:301,
		//高二
		V_302:302,
		//高三
		V_303:303,

		//小学
		S_100:"100",
		//初中
		S_200:"200",
		//高中
		S_300:"300",
		//小一
		S_101:"101",
		//小二
		S_102:"102",
		//小三
		S_103:"103",
		//小四
		S_104:"104",
		//小五
		S_105:"105",
		//小六
		S_106:"106",
		//初一
		S_201:"201",
		//初二
		S_202:"202",
		//初三
		S_203:"203",
		//高一
		S_301:"301",
		//高二
		S_302:"302",
		//高三
		S_303:"303"


},

question_type : {
	desc_map : {
		'1' : "选择",
		'2' : "填空",
		'3' : "问答",
		'4' : "知识点"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"select" : 1,
		"line" : 2,
		"text" : 3,
		"without_a" : 4
	},
	v2s_map:{
		 '1':  "select",
		 '2':  "line",
		 '3':  "text",
		 '4':  "without_a"
	},

		//选择
		V_SELECT:1,
		//填空
		V_LINE:2,
		//问答
		V_TEXT:3,
		//知识点
		V_WITHOUT_A:4,

		//选择
		S_SELECT:"select",
		//填空
		S_LINE:"line",
		//问答
		S_TEXT:"text",
		//知识点
		S_WITHOUT_A:"without_a"


},

region_version : {
	desc_map : {
		'11' : "华师大版（华东师范大学出版社）",
		'10' : "华师大新版（华东师范大学出版社）",
		'2' : "人教五四版（人民教育出版社）",
		'1' : "人教五四新版（人民教育出版社）",
		'4' : "人教版（人民教育出版社）",
		'3' : "人教新版（人民教育出版社）",
		'9' : "北师大版（北京师范大学出版社）",
		'8' : "北京课改版（北京出版社）",
		'7' : "北京课改新版（北京出版社）",
		'6' : "冀教版（河北教育出版社）",
		'5' : "冀教新版（河北教育出版社）",
		'21' : "青岛版（青岛出版社）",
		'23' : "鲁教版（山东教育出版社）",
		'22' : "鲁教新版（山东教育出版社）",
		'20' : "苏科版（江苏科学技术出版社）",
		'19' : "苏科新版（江苏科学技术出版社）",
		'14' : "沪科版（上海科学技术出版社）",
		'13' : "沪科新版（上海科学技术出版社）",
		'12' : "沪教版（上海教育出版社）",
		'18' : "湘教版（湖南教育出版社）",
		'17' : "湘教新版（湖南教育出版社）",
		'16' : "浙教版（浙江教育出版社）",
		'15' : "浙教新版（浙江教育出版社）"
	},
	simple_desc_map: {
		'11' : "",
		'10' : "",
		'2' : "",
		'1' : "",
		'4' : "",
		'3' : "",
		'9' : "",
		'8' : "",
		'7' : "",
		'6' : "",
		'5' : "",
		'21' : "",
		'23' : "",
		'22' : "",
		'20' : "",
		'19' : "",
		'14' : "",
		'13' : "",
		'12' : "",
		'18' : "",
		'17' : "",
		'16' : "",
		'15' : ""
	},
	s2v_map:{
		"11" : 11,
		"10" : 10,
		"2" : 2,
		"1" : 1,
		"4" : 4,
		"3" : 3,
		"9" : 9,
		"8" : 8,
		"7" : 7,
		"6" : 6,
		"5" : 5,
		"21" : 21,
		"23" : 23,
		"22" : 22,
		"20" : 20,
		"19" : 19,
		"14" : 14,
		"13" : 13,
		"12" : 12,
		"18" : 18,
		"17" : 17,
		"16" : 16,
		"15" : 15
	},
	v2s_map:{
		 '11':  "11",
		 '10':  "10",
		 '2':  "2",
		 '1':  "1",
		 '4':  "4",
		 '3':  "3",
		 '9':  "9",
		 '8':  "8",
		 '7':  "7",
		 '6':  "6",
		 '5':  "5",
		 '21':  "21",
		 '23':  "23",
		 '22':  "22",
		 '20':  "20",
		 '19':  "19",
		 '14':  "14",
		 '13':  "13",
		 '12':  "12",
		 '18':  "18",
		 '17':  "17",
		 '16':  "16",
		 '15':  "15"
	},

		//华师大版（华东师范大学出版社）
		V_11:11,
		//华师大新版（华东师范大学出版社）
		V_10:10,
		//人教五四版（人民教育出版社）
		V_2:2,
		//人教五四新版（人民教育出版社）
		V_1:1,
		//人教版（人民教育出版社）
		V_4:4,
		//人教新版（人民教育出版社）
		V_3:3,
		//北师大版（北京师范大学出版社）
		V_9:9,
		//北京课改版（北京出版社）
		V_8:8,
		//北京课改新版（北京出版社）
		V_7:7,
		//冀教版（河北教育出版社）
		V_6:6,
		//冀教新版（河北教育出版社）
		V_5:5,
		//青岛版（青岛出版社）
		V_21:21,
		//鲁教版（山东教育出版社）
		V_23:23,
		//鲁教新版（山东教育出版社）
		V_22:22,
		//苏科版（江苏科学技术出版社）
		V_20:20,
		//苏科新版（江苏科学技术出版社）
		V_19:19,
		//沪科版（上海科学技术出版社）
		V_14:14,
		//沪科新版（上海科学技术出版社）
		V_13:13,
		//沪教版（上海教育出版社）
		V_12:12,
		//湘教版（湖南教育出版社）
		V_18:18,
		//湘教新版（湖南教育出版社）
		V_17:17,
		//浙教版（浙江教育出版社）
		V_16:16,
		//浙教新版（浙江教育出版社）
		V_15:15,

		//华师大版（华东师范大学出版社）
		S_11:"11",
		//华师大新版（华东师范大学出版社）
		S_10:"10",
		//人教五四版（人民教育出版社）
		S_2:"2",
		//人教五四新版（人民教育出版社）
		S_1:"1",
		//人教版（人民教育出版社）
		S_4:"4",
		//人教新版（人民教育出版社）
		S_3:"3",
		//北师大版（北京师范大学出版社）
		S_9:"9",
		//北京课改版（北京出版社）
		S_8:"8",
		//北京课改新版（北京出版社）
		S_7:"7",
		//冀教版（河北教育出版社）
		S_6:"6",
		//冀教新版（河北教育出版社）
		S_5:"5",
		//青岛版（青岛出版社）
		S_21:"21",
		//鲁教版（山东教育出版社）
		S_23:"23",
		//鲁教新版（山东教育出版社）
		S_22:"22",
		//苏科版（江苏科学技术出版社）
		S_20:"20",
		//苏科新版（江苏科学技术出版社）
		S_19:"19",
		//沪科版（上海科学技术出版社）
		S_14:"14",
		//沪科新版（上海科学技术出版社）
		S_13:"13",
		//沪教版（上海教育出版社）
		S_12:"12",
		//湘教版（湖南教育出版社）
		S_18:"18",
		//湘教新版（湖南教育出版社）
		S_17:"17",
		//浙教版（浙江教育出版社）
		S_16:"16",
		//浙教新版（浙江教育出版社）
		S_15:"15"


},

relation_ship : {
	desc_map : {
		'1' : "父亲",
		'2' : "母亲",
		'3' : "爷爷",
		'4' : "奶奶",
		'5' : "外公",
		'6' : "外婆",
		'7' : "其他"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//父亲
		V_1:1,
		//母亲
		V_2:2,
		//爷爷
		V_3:3,
		//奶奶
		V_4:4,
		//外公
		V_5:5,
		//外婆
		V_6:6,
		//其他
		V_7:7,

		//父亲
		S_1:"1",
		//母亲
		S_2:"2",
		//爷爷
		S_3:"3",
		//奶奶
		S_4:"4",
		//外公
		S_5:"5",
		//外婆
		S_6:"6",
		//其他
		S_7:"7"


},

revisit_type : {
	desc_map : {
		'0' : "学情回访",
		'1' : "首次回访",
		'2' : "月度回访",
		'3' : "其他回访"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3"
	},

		//学情回访
		V_0:0,
		//首次回访
		V_1:1,
		//月度回访
		V_2:2,
		//其他回访
		V_3:3,

		//学情回访
		S_0:"0",
		//首次回访
		S_1:"1",
		//月度回访
		S_2:"2",
		//其他回访
		S_3:"3"


},

role : {
	desc_map : {
		'1' : "学生",
		'2' : "老师",
		'3' : "助教",
		'4' : "家长"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : ""
	},
	s2v_map:{
		"student" : 1,
		"teacher" : 2,
		"assistent" : 3,
		"parent" : 4
	},
	v2s_map:{
		 '1':  "student",
		 '2':  "teacher",
		 '3':  "assistent",
		 '4':  "parent"
	},

		//学生
		V_STUDENT:1,
		//老师
		V_TEACHER:2,
		//助教
		V_ASSISTENT:3,
		//家长
		V_PARENT:4,

		//学生
		S_STUDENT:"student",
		//老师
		S_TEACHER:"teacher",
		//助教
		S_ASSISTENT:"assistent",
		//家长
		S_PARENT:"parent"


},

school_scores_type : {
	desc_map : {
		'1' : "零志愿",
		'2' : "名额分配",
		'3' : "普通高中",
		'4' : "中本贯通",
		'5' : "中职贯通",
		'6' : "最低投档线"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6"
	},

		//零志愿
		V_1:1,
		//名额分配
		V_2:2,
		//普通高中
		V_3:3,
		//中本贯通
		V_4:4,
		//中职贯通
		V_5:5,
		//最低投档线
		V_6:6,

		//零志愿
		S_1:"1",
		//名额分配
		S_2:"2",
		//普通高中
		S_3:"3",
		//中本贯通
		S_4:"4",
		//中职贯通
		S_5:"5",
		//最低投档线
		S_6:"6"


},

seller_book_status : {
	desc_map : {
		'0' : "未回访",
		'1' : "无效资源",
		'2' : "未接通",
		'3' : "有效-意向A档",
		'4' : "有效-意向B档",
		'5' : "有效-意向C档"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//未回访
		V_0:0,
		//无效资源
		V_1:1,
		//未接通
		V_2:2,
		//有效-意向A档
		V_3:3,
		//有效-意向B档
		V_4:4,
		//有效-意向C档
		V_5:5,

		//未回访
		S_0:"0",
		//无效资源
		S_1:"1",
		//未接通
		S_2:"2",
		//有效-意向A档
		S_3:"3",
		//有效-意向B档
		S_4:"4",
		//有效-意向C档
		S_5:"5"


},

send_gift : {
	desc_map : {
		'0' : "未兑换",
		'1' : "已兑换"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//未兑换
		V_0:0,
		//已兑换
		V_1:1,

		//未兑换
		S_0:"0",
		//已兑换
		S_1:"1"


},

sh_area : {
	desc_map : {
		'101' : "黄浦",
		'102' : "徐汇",
		'103' : "长宁",
		'104' : "静安",
		'105' : "普陀",
		'106' : "虹口",
		'107' : "杨浦",
		'108' : "闵行",
		'109' : "宝山",
		'111' : "嘉定",
		'112' : "浦东新区",
		'113' : "金山",
		'114' : "松江",
		'115' : "青浦",
		'116' : "奉贤",
		'117' : "崇明县",
		'118' : "闸北区"
	},
	simple_desc_map: {
		'101' : "",
		'102' : "",
		'103' : "",
		'104' : "",
		'105' : "",
		'106' : "",
		'107' : "",
		'108' : "",
		'109' : "",
		'111' : "",
		'112' : "",
		'113' : "",
		'114' : "",
		'115' : "",
		'116' : "",
		'117' : "",
		'118' : ""
	},
	s2v_map:{
		"101" : 101,
		"102" : 102,
		"103" : 103,
		"104" : 104,
		"105" : 105,
		"106" : 106,
		"107" : 107,
		"108" : 108,
		"109" : 109,
		"111" : 111,
		"112" : 112,
		"113" : 113,
		"114" : 114,
		"115" : 115,
		"116" : 116,
		"117" : 117,
		"118" : 118
	},
	v2s_map:{
		 '101':  "101",
		 '102':  "102",
		 '103':  "103",
		 '104':  "104",
		 '105':  "105",
		 '106':  "106",
		 '107':  "107",
		 '108':  "108",
		 '109':  "109",
		 '111':  "111",
		 '112':  "112",
		 '113':  "113",
		 '114':  "114",
		 '115':  "115",
		 '116':  "116",
		 '117':  "117",
		 '118':  "118"
	},

		//黄浦
		V_101:101,
		//徐汇
		V_102:102,
		//长宁
		V_103:103,
		//静安
		V_104:104,
		//普陀
		V_105:105,
		//虹口
		V_106:106,
		//杨浦
		V_107:107,
		//闵行
		V_108:108,
		//宝山
		V_109:109,
		//嘉定
		V_111:111,
		//浦东新区
		V_112:112,
		//金山
		V_113:113,
		//松江
		V_114:114,
		//青浦
		V_115:115,
		//奉贤
		V_116:116,
		//崇明县
		V_117:117,
		//闸北区
		V_118:118,

		//黄浦
		S_101:"101",
		//徐汇
		S_102:"102",
		//长宁
		S_103:"103",
		//静安
		S_104:"104",
		//普陀
		S_105:"105",
		//虹口
		S_106:"106",
		//杨浦
		S_107:"107",
		//闵行
		S_108:"108",
		//宝山
		S_109:"109",
		//嘉定
		S_111:"111",
		//浦东新区
		S_112:"112",
		//金山
		S_113:"113",
		//松江
		S_114:"114",
		//青浦
		S_115:"115",
		//奉贤
		S_116:"116",
		//崇明县
		S_117:"117",
		//闸北区
		S_118:"118"


},

sh_page_grade : {
	desc_map : {
		'1' : "小升初",
		'2' : "中考"
	},
	simple_desc_map: {
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2"
	},

		//小升初
		V_1:1,
		//中考
		V_2:2,

		//小升初
		S_1:"1",
		//中考
		S_2:"2"


},

sms_type : {
	desc_map : {
		'7795923' : "用户注册验证码",
		'7786570' : "通知家长预约成功",
		'7771547' : "通用验证",
		'8295424' : "课程当天早上通知",
		'10615821' : "早8点 通知家长上课",
		'10642098' : "晚8点 通知老师明天上课"
	},
	simple_desc_map: {
		'7795923' : "",
		'7786570' : "",
		'7771547' : "",
		'8295424' : "",
		'10615821' : "",
		'10642098' : ""
	},
	s2v_map:{
		"register" : 7795923,
		"7786570" : 7786570,
		"7771547" : 7771547,
		"8295424" : 8295424,
		"10615821" : 10615821,
		"10642098" : 10642098
	},
	v2s_map:{
		 '7795923':  "register",
		 '7786570':  "7786570",
		 '7771547':  "7771547",
		 '8295424':  "8295424",
		 '10615821':  "10615821",
		 '10642098':  "10642098"
	},

		//用户注册验证码
		V_REGISTER:7795923,
		//通知家长预约成功
		V_7786570:7786570,
		//通用验证
		V_7771547:7771547,
		//课程当天早上通知
		V_8295424:8295424,
		//早8点 通知家长上课
		V_10615821:10615821,
		//晚8点 通知老师明天上课
		V_10642098:10642098,

		//用户注册验证码
		S_REGISTER:"register",
		//通知家长预约成功
		S_7786570:"7786570",
		//通用验证
		S_7771547:"7771547",
		//课程当天早上通知
		S_8295424:"8295424",
		//早8点 通知家长上课
		S_10615821:"10615821",
		//晚8点 通知老师明天上课
		S_10642098:"10642098"


},

star_level : {
	desc_map : {
		'1' : "一星",
		'2' : "二星",
		'3' : "三星",
		'4' : "四星",
		'5' : "五星"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//一星
		V_1:1,
		//二星
		V_2:2,
		//三星
		V_3:3,
		//四星
		V_4:4,
		//五星
		V_5:5,

		//一星
		S_1:"1",
		//二星
		S_2:"2",
		//三星
		S_3:"3",
		//四星
		S_4:"4",
		//五星
		S_5:"5"


},

student_type : {
	desc_map : {
		'0' : "正式学员",
		'1' : "已结课学员",
		'2' : "停课学员"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//正式学员
		V_0:0,
		//已结课学员
		V_1:1,
		//停课学员
		V_2:2,

		//正式学员
		S_0:"0",
		//已结课学员
		S_1:"1",
		//停课学员
		S_2:"2"


},

stu_origin : {
	desc_map : {
		'0' : "注册",
		'1' : "转介绍"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//注册
		V_0:0,
		//转介绍
		V_1:1,

		//注册
		S_0:"0",
		//转介绍
		S_1:"1"


},

subject : {
	desc_map : {
		'1' : "语文",
		'2' : "数学",
		'3' : "英语",
		'4' : "化学",
		'5' : "物理",
		'6' : "生物",
		'7' : "政治",
		'8' : "历史",
		'9' : "地理"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : "",
		'8' : "",
		'9' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7,
		"8" : 8,
		"9" : 9
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7",
		 '8':  "8",
		 '9':  "9"
	},

		//语文
		V_1:1,
		//数学
		V_2:2,
		//英语
		V_3:3,
		//化学
		V_4:4,
		//物理
		V_5:5,
		//生物
		V_6:6,
		//政治
		V_7:7,
		//历史
		V_8:8,
		//地理
		V_9:9,

		//语文
		S_1:"1",
		//数学
		S_2:"2",
		//英语
		S_3:"3",
		//化学
		S_4:"4",
		//物理
		S_5:"5",
		//生物
		S_6:"6",
		//政治
		S_7:"7",
		//历史
		S_8:"8",
		//地理
		S_9:"9"


},

tea_type : {
	desc_map : {
		'0' : "老师",
		'1' : "助教"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//老师
		V_0:0,
		//助教
		V_1:1,

		//老师
		S_0:"0",
		//助教
		S_1:"1"


},

test_listen_from_type : {
	desc_map : {
		'0' : "渠道试听",
		'1' : "扩课试听",
		'2' : "换老师试听"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2"
	},

		//渠道试听
		V_0:0,
		//扩课试听
		V_1:1,
		//换老师试听
		V_2:2,

		//渠道试听
		S_0:"0",
		//扩课试听
		S_1:"1",
		//换老师试听
		S_2:"2"


},

test_user : {
	desc_map : {
		'0' : "不是",
		'1' : "是"
	},
	simple_desc_map: {
		'0' : "",
		'1' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1"
	},

		//不是
		V_0:0,
		//是
		V_1:1,

		//不是
		S_0:"0",
		//是
		S_1:"1"


},

trial_type : {
	desc_map : {
		'0' : "无",
		'1' : "1v1试听课",
		'2' : "1v1定制课",
		'3' : "1v1自选课",
		'4' : "小班课购买",
		'5' : "公开课报名"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"0" : 0,
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5
	},
	v2s_map:{
		 '0':  "0",
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5"
	},

		//无
		V_0:0,
		//1v1试听课
		V_1:1,
		//1v1定制课
		V_2:2,
		//1v1自选课
		V_3:3,
		//小班课购买
		V_4:4,
		//公开课报名
		V_5:5,

		//无
		S_0:"0",
		//1v1试听课
		S_1:"1",
		//1v1定制课
		S_2:"2",
		//1v1自选课
		S_3:"3",
		//小班课购买
		S_4:"4",
		//公开课报名
		S_5:"5"


},

user_lesson_account_reason : {
	desc_map : {
		'1000' : "新增",
		'1001' : "充值",
		'1002' : "课程退费",
		'1003' : "账户间移动",
		'1004' : "修改价格",
		'2001' : "课时消耗",
		'2002' : "账户间移动",
		'3001' : "重设1v1价格"
	},
	simple_desc_map: {
		'1000' : "",
		'1001' : "",
		'1002' : "",
		'1003' : "",
		'1004' : "",
		'2001' : "",
		'2002' : "",
		'3001' : ""
	},
	s2v_map:{
		"add_money_for_init" : 1000,
		"add_money_for_user_add" : 1001,
		"add_money_for_cancel_lesson" : 1002,
		"add_money_for_move" : 1003,
		"change_money_for_change_price" : 1004,
		"reduce_money_for_add_lesson" : 2001,
		"reduce_money_for_move" : 2002,
		"other_reset_1v1_price" : 3001
	},
	v2s_map:{
		 '1000':  "add_money_for_init",
		 '1001':  "add_money_for_user_add",
		 '1002':  "add_money_for_cancel_lesson",
		 '1003':  "add_money_for_move",
		 '1004':  "change_money_for_change_price",
		 '2001':  "reduce_money_for_add_lesson",
		 '2002':  "reduce_money_for_move",
		 '3001':  "other_reset_1v1_price"
	},

		//新增
		V_ADD_MONEY_FOR_INIT:1000,
		//充值
		V_ADD_MONEY_FOR_USER_ADD:1001,
		//课程退费
		V_ADD_MONEY_FOR_CANCEL_LESSON:1002,
		//账户间移动
		V_ADD_MONEY_FOR_MOVE:1003,
		//修改价格
		V_CHANGE_MONEY_FOR_CHANGE_PRICE:1004,
		//课时消耗
		V_REDUCE_MONEY_FOR_ADD_LESSON:2001,
		//账户间移动
		V_REDUCE_MONEY_FOR_MOVE:2002,
		//重设1v1价格
		V_OTHER_RESET_1V1_PRICE:3001,

		//新增
		S_ADD_MONEY_FOR_INIT:"add_money_for_init",
		//充值
		S_ADD_MONEY_FOR_USER_ADD:"add_money_for_user_add",
		//课程退费
		S_ADD_MONEY_FOR_CANCEL_LESSON:"add_money_for_cancel_lesson",
		//账户间移动
		S_ADD_MONEY_FOR_MOVE:"add_money_for_move",
		//修改价格
		S_CHANGE_MONEY_FOR_CHANGE_PRICE:"change_money_for_change_price",
		//课时消耗
		S_REDUCE_MONEY_FOR_ADD_LESSON:"reduce_money_for_add_lesson",
		//账户间移动
		S_REDUCE_MONEY_FOR_MOVE:"reduce_money_for_move",
		//重设1v1价格
		S_OTHER_RESET_1V1_PRICE:"other_reset_1v1_price"


},

week : {
	desc_map : {
		'1' : "周一",
		'2' : "周二",
		'3' : "周三",
		'4' : "周四",
		'5' : "周五",
		'6' : "周六",
		'7' : "周七"
	},
	simple_desc_map: {
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : "",
		'6' : "",
		'7' : ""
	},
	s2v_map:{
		"1" : 1,
		"2" : 2,
		"3" : 3,
		"4" : 4,
		"5" : 5,
		"6" : 6,
		"7" : 7
	},
	v2s_map:{
		 '1':  "1",
		 '2':  "2",
		 '3':  "3",
		 '4':  "4",
		 '5':  "5",
		 '6':  "6",
		 '7':  "7"
	},

		//周一
		V_1:1,
		//周二
		V_2:2,
		//周三
		V_3:3,
		//周四
		V_4:4,
		//周五
		V_5:5,
		//周六
		V_6:6,
		//周七
		V_7:7,

		//周一
		S_1:"1",
		//周二
		S_2:"2",
		//周三
		S_3:"3",
		//周四
		S_4:"4",
		//周五
		S_5:"5",
		//周六
		S_6:"6",
		//周七
		S_7:"7"


},

work_status : {
	desc_map : {
		'0' : "未传",
		'1' : "已传",
		'2' : "学生",
		'3' : "老师",
		'4' : "教研",
		'5' : "助教"
	},
	simple_desc_map: {
		'0' : "",
		'1' : "",
		'2' : "",
		'3' : "",
		'4' : "",
		'5' : ""
	},
	s2v_map:{
		"no_upload" : 0,
		"issue" : 1,
		"finish" : 2,
		"check" : 3,
		"tea_research" : 4,
		"ass_research" : 5
	},
	v2s_map:{
		 '0':  "no_upload",
		 '1':  "issue",
		 '2':  "finish",
		 '3':  "check",
		 '4':  "tea_research",
		 '5':  "ass_research"
	},

		//未传
		V_NO_UPLOAD:0,
		//已传
		V_ISSUE:1,
		//学生
		V_FINISH:2,
		//老师
		V_CHECK:3,
		//教研
		V_TEA_RESEARCH:4,
		//助教
		V_ASS_RESEARCH:5,

		//未传
		S_NO_UPLOAD:"no_upload",
		//已传
		S_ISSUE:"issue",
		//学生
		S_FINISH:"finish",
		//老师
		S_CHECK:"check",
		//教研
		S_TEA_RESEARCH:"tea_research",
		//助教
		S_ASS_RESEARCH:"ass_research"


},

year : {
	desc_map : {
		'2016' : "2016",
		'2015' : "2015",
		'2014' : "2014",
		'2013' : "2013",
		'2012' : "2012",
		'2011' : "2011",
		'2010' : "2010"
	},
	simple_desc_map: {
		'2016' : "",
		'2015' : "",
		'2014' : "",
		'2013' : "",
		'2012' : "",
		'2011' : "",
		'2010' : ""
	},
	s2v_map:{
		"2016" : 2016,
		"2015" : 2015,
		"2014" : 2014,
		"2013" : 2013,
		"2012" : 2012,
		"2011" : 2011,
		"2010" : 2010
	},
	v2s_map:{
		 '2016':  "2016",
		 '2015':  "2015",
		 '2014':  "2014",
		 '2013':  "2013",
		 '2012':  "2012",
		 '2011':  "2011",
		 '2010':  "2010"
	},

		//2016
		V_2016:2016,
		//2015
		V_2015:2015,
		//2014
		V_2014:2014,
		//2013
		V_2013:2013,
		//2012
		V_2012:2012,
		//2011
		V_2011:2011,
		//2010
		V_2010:2010,

		//2016
		S_2016:"2016",
		//2015
		S_2015:"2015",
		//2014
		S_2014:"2014",
		//2013
		S_2013:"2013",
		//2012
		S_2012:"2012",
		//2011
		S_2011:"2011",
		//2010
		S_2010:"2010"


},
__END: {}
};
